{"248536934":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/248536934/","description":"<p>We are excited to announce that the fourth Athenian Papers We Love meetup will feature Spyros Anastasopoulos presenting on Principled Design of the Modern Web Architecture (<a href=\"https://www.ics.uci.edu/%7Etaylor/documents/2002-REST-TOIT.pdf\" class=\"linkified\">https://www.ics.uci.edu/%7Etaylor/documents/2002-REST-TOIT.pdf</a>) by Roy Fielding [2002].</p> <p>Talks</p> <p>• Spyros Anastasopoulos on Principled Design of the Modern Web Architecture:</p> <p>Roy Fielding introduced the REST architecture for networked applications in his PhD Dissertation and used it to formally define the architecture of the web. He presented his research in two papers: A preliminary version at ICSE 2000 and published an extended version at ACM Transactions on Internet Technology.</p> <p>My presentation will focus on the extended version.</p> <p>Bio</p> <p>I enjoy working with likeminded programmers on challenging projects in environments where I can experiment, innovate, learn, and have fun. My areas of interest are software architecture, distributed systems, cloud computing and the open web.</p> <p>I work as a software engineer at Pollfish.</p> <p>twitter: @anastasop</p> <p>Details</p> <p>Doors open at 6:30pm; the presentations will begin around 7pm.</p> <p>The talk will be in Greek.</p> <p>Enter the building from the entrance right beside the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> <p>We hope you will read the paper before the meetup, but don't stress if you can't. If you have any questions please add them on this event's thread.</p> <p>We have a Github repo which we use for coordinating Papers We Love Athens: <a href=\"https://github.com/papers-we-love/athens\" class=\"linkified\">https://github.com/papers-we-love/athens</a> We will be opening an issue before each meetup to serve as a space for Call for Presentations. If you have any ideas/questions about the meetup please open up an issue.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":7200000,"time":1521133200000,"title":"Spyros Anastasopoulos on Principled Design of the Modern Web Architecture"},"268600142":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/268600142/","description":"<p>We are very excited to announce that the 12th Athenian Papers We Love meetup will feature George Kadianakis presenting on his work on Tor. This is a bit of a departure from our usual meetups since it won't focus on a single paper. Rather, the talk will cover various cutting-edge areas of research and engineering.</p> <p>Talks</p> <p>• George Kadianakis on Onions Everyday: Food? Medicine? Protocol?</p> <p>Onions have many uses! Most people know Tor as a browser that provides a private web browsing experience. However, Tor can also provide privacy and anonymity to websites and other servers using \"onion services\". This talk is gonna give a high-level overview of how modern onion services work, shed some light to the crypto tricks used to make service-side anonymity happen and show people various improvements and behind-the-scenes developments that have happened in this space over the past year.</p> <p>Reading material, in this order:</p> <p>- <a href=\"https://community.torproject.org/onion-services/overview/\" class=\"linkified\">https://community.torproject.org/onion-services/overview/</a><br/>- <a href=\"https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;arnumber=6547103\" class=\"linkified\">https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;arnumber=6547103</a><br/>- <a href=\"https://github.com/torproject/torspec/blob/master/rend-spec-v3.txt\" class=\"linkified\">https://github.com/torproject/torspec/blob/master/rend-spec-v3.txt</a><br/>- <a href=\"https://github.com/torproject/torspec/blob/master/srv-spec.txt\" class=\"linkified\">https://github.com/torproject/torspec/blob/master/srv-spec.txt</a><br/>- <a href=\"https://www-users.cs.umn.edu/~hoppernj/basic-proof.pdf\" class=\"linkified\">https://www-users.cs.umn.edu/~hoppernj/basic-proof.pdf</a></p> <p>Bio</p> <p>George Kadianakis has been working on Tor for the past 9 years of his life. Over this period of time he has worked on Tor from all sides: from designing user-centric improvements to fixing weird esoteric attacks that only concern the most intricate use cases. Most recently his Tor work is focused on onion services and he is also a PhD student in the University of Athens. George has been a speaker at many hacker and academic conferences and through his travels he has talked with Tor users from all walks of life.</p> <p>Details</p> <p>Enter the building from the entrance next to the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> <p>The talk will be in Greek.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":7200000,"time":1582736400000,"title":"George Kadianakis on Onions Everyday: Food? Medicine? Protocol?"},"254437702":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/254437702/","description":"<p>We are very excited to announce that the seventh Athenian Papers We Love meetup will feature George Psarakis presenting on HyperLogLog in Practice: Algorithmic Engineering of a State of The Art Cardinality Estimation Algorithm (<a href=\"https://storage.googleapis.com/pub-tools-public-publication-data/pdf/40671.pdf\" class=\"linkified\">https://storage.googleapis.com/pub-tools-public-publication-data/pdf/40671.pdf</a>), by Heule et al. [2013].</p> <p>Talks</p> <p>• George Psarakis on HyperLogLog in Practice: Algorithmic Engineering of a State of The Art Cardinality Estimation Algorithm</p> <p>Cardinality estimation has a wide range of applications and is of particular importance in database systems. Various algorithms have been proposed in the past, and the HyperLogLog algorithm is one of them. We will outline the basic concepts and characteristics of the original HyperLogLog algorithm, and also present a series of improvements to this algorithm proposed by the Google researchers in the paper. Finally, we will refer to the use cases of approximate cardinality calculation as well as implementations in popular databases, such as Redis and Elasticsearch.</p> <p>Bio</p> <p>George Psarakis is a software engineer at Skroutz.</p> <p>Twitter: @georgepsarakis<br/>GitHub: @georgepsarakis</p> <p>Details</p> <p>Enter the building from the entrance next to the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":10800000,"time":1537459200000,"title":"George Psarakis on HyperLogLog in Practice"},"246898009":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/246898009/","description":"<p>The third Athenian Papers We Love meetup will feature Nikos Fertakis presenting on The Dataflow Model: A Practical Approach to Balancing Correctness, Latency, and Cost in Massive-Scale, Unbounded, Out-of-Order Data Processing (<a href=\"https://research.google.com/pubs/archive/43864.pdf\" class=\"linkified\">https://research.google.com/pubs/archive/43864.pdf</a>), by Akidau et al (Google) [2015].</p> <p>Talks</p> <p>• Nikos Fertakis on The Dataflow Model:</p> <p>As Adrian Colyer put it on his Morning Paper blog: \"Akidau et al. set out a strong manifesto for modern data processing, based on the notion of accepting uncertainty and incompleteness.\"</p> <p>I think Dataflow is a really interesting framework on processing infinite streams. And make no mistake, infinite streams are all around us, even though we are used to splitting them into artificial segments (batches) to simplify how we process them.</p> <p>The problems that can be solved this way include:</p> <p>• log joining pipelines<br/>• session-based analysis for search, ads, analytics, social, and YouTube<br/>• billing pipelines<br/>• aggregate statistics calculations<br/>• abuse detection pipelines<br/>• recommendation generation</p> <p>But most of all, what I found especially interesting about this paper was that it gave me the mental tools to frame the data processing problem and its various nuances. All in all, I think it should make for an interesting topic!</p> <p>Bio</p> <p>Nikos Fertakis (twitter: @nikosfertakis, github: @greenonion) is a software engineer, and a tech lead of Skroutz's Search team. He holds a BSc in Computer Science from the University of Athens, and an MSc in Machine Learning from University College London.</p> <p>Details</p> <p>Doors open at 6:30pm; the presentations will begin around 7pm.</p> <p>The talk will be in Greek, unless there are non-Greek speakers in the audience. In that case the talk can be in English.</p> <p>Enter the building from the entrance right beside the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> <p>We hope you will read the paper before the meetup, but don't stress if you can't. If you have any questions please add them on this event's thread.</p> <p>We have a Github repo which we use for coordinating Papers We Love Athens: <a href=\"https://github.com/papers-we-love/athens\" class=\"linkified\">https://github.com/papers-we-love/athens</a> We will be opening an issue before each meetup to serve as a space for Call for Presentations. If you have any ideas/questions about the meetup please open up an issue.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":7200000,"time":1518714000000,"title":"Nikos Fertakis on The Dataflow Model"},"255631499":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/255631499/","description":"<p>We are very excited to announce that the eighth Athenian Papers We Love meetup will feature Pantelis P. Analytis presenting on Social Learning Strategies for Matters of Taste (<a href=\"https://www.researchgate.net/publication/325403552_Social_learning_strategies_for_matters_of_taste\" class=\"linkified\">https://www.researchgate.net/publication/325403552_Social_learning_strategies_for_matters_of_taste</a>), by Analytis, Barkoczi, and Herzog. [2018].</p> <p>Talks</p> <p>• Pantelis P. Analytis on Social Learning Strategies for Matters of Taste</p> <p>Most choices people make are about ‘matters of taste’, on which there is no universal, objective truth. Nevertheless, people can learn from the experiences of individuals with similar tastes who have already evaluated the available options—a potential harnessed by recommender systems. We mapped recommender system algorithms to models of human judgement and decision-making about ‘matters of fact’ and recast the latter as social learning strategies for matters of taste. Using computer simulations on a large-scale, empirical dataset, we studied how people could leverage the experiences of others to make better decisions. Our simulations showed that experienced individuals can benefit from relying mostly on the opinions of seemingly similar people; by contrast, inexperienced individuals cannot reliably estimate similarity and are better off picking the mainstream option despite differences in taste. Crucially, the level of experience beyond which people should switch to similarity-heavy strategies varies substantially across individuals and depends on how mainstream (or alternative) an individual’s tastes are and the level of dispersion in taste similarity with the other people in the group.</p> <p>Bio</p> <p>Pantelis is an assistant professor at the Danish Institute of Advanced Studies (D-IAS). Pantelis develops mathematical and computational models of individual and collective behavior and uses experiments, big-data and large-scale simulations to assess their descriptive and prescriptive value. He received a PhD in Psychology from Humboldt University, a Diploma in Economics from University of Athens and a Master's in Cognitive Science from EHESS in Paris. Before joining D-IAS he worked as a predoctoral researcher at the Max Planck Institute for Human Development in Berlin and as a postdoctoral researcher at the Computer and Information Science departments at Cornell University in Ithaca.</p> <p>Twitter: @pantelispa<br/>Personal website: <a href=\"http://analytis.tumblr.com\" class=\"linkified\">http://analytis.tumblr.com</a></p> <p>Details</p> <p>Enter the building from the entrance next to the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":10800000,"time":1540483200000,"title":"Pantelis P. Analytis on Social Learning Strategies for Matters of Taste"},"251945199":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/251945199/","description":"<p>We are very excited to announce that the sixth Athenian Papers We Love meetup will feature professor Nikolaos Papaspyrou presenting on QuickCheck: Α lightweight tool for random testing of Haskell programs (<a href=\"https://www.cs.tufts.edu/%7Enr/cs257/archive/john-hughes/quick.pdf\" class=\"linkified\">https://www.cs.tufts.edu/%7Enr/cs257/archive/john-hughes/quick.pdf</a>), by Koen Claessen and John Hughes [2000].</p> <p>Talks</p> <p>• Nikolaos Papaspyrou on QuickCheck: Α lightweight tool for random testing of Haskell programs</p> <p>QuickCheck is a combinator library originally written in Haskell, designed to assist in software testing by generating test cases for test suites.</p> <p>In QuickCheck the programmer writes assertions about logical properties that a function should fulfill. Then QuickCheck attempts to generate a test case that falsifies these assertions. Once such a test case is found, QuickCheck tries to reduce it to a minimal failing subset by removing or simplifying input data that are not needed to make the test fail.</p> <p>The project was started in 1999. Besides being used to test regular programs, QuickCheck is also useful for building up a functional specification, for documenting what functions should be doing, and for testing compiler implementations.</p> <p>Bio</p> <p>Nikolaos Papaspyrou is an associate professor at the School of Electrical and Computer Engineering of the National Technical University of Athens (NTUA), since 2002, and a member of the Software Engineering Laboratory. He has a PhD in Computer Science from the NTUA (1998), a M.Sc. in Computer Science from Cornell University (1995) and a Diploma in Electrical and Computer Engineering from the NTUA (1993). He has worked as a postdoctoral researcher at Yale University [masked]) and as a visiting researcher on sabbatical at Google's compiler group [masked]). His interests lie in the area of programming language theory and implementation: semantics, type systems, compilers, static analysis, formal verification.</p> <p>Homepage: www.softlab.ntua.gr/~nickie/<br/>Twitter: @nickie_42</p> <p>Details</p> <p>Enter the building from the entrance next to the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":10800000,"time":1530806400000,"title":"Nikolaos Papaspyrou on QuickCheck"},"256837467":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/256837467/","description":"<p>We are very excited to announce that the 9th Athenian Papers We Love meetup will feature Linos Giannopoulos presenting on Building a DDoS mitigation pipeline using XDP, based on the paper XDP in practice: integrating XDP into our DDoS mitigation pipeline (<a href=\"https://netdevconf.org/2.1/papers/Gilberto_Bertin_XDP_in_practice.pdf\" class=\"linkified\">https://netdevconf.org/2.1/papers/Gilberto_Bertin_XDP_in_practice.pdf</a>), by Gilberto Bertin. [2018].</p> <p>Talks</p> <p>• Linos Giannopoulos on Building a DDoS mitigation pipeline using XDP</p> <p>XDP (eXpress Data Path) and eBPF in general is a relatively new technology added to the Linux kernel. It seems like the industry has picked up this technology and supported its growth these passed few years of its existence. For instance, Facebook has built and open-sourced its L4 Load Balancer (Katran) since March and Suricata (IDS) has built a packet filter based on XDP for faster packet processing.</p> <p>During this talk, a brief introduction will be given to eBPF, and then to XDP and its capabilities. Moreover, we will explore how we can build a DDoS mitigation pipeline based on the paper of Gilberto Bertin: \"XDP in practice: integrating XDP into our DDoS mitigation pipeline\".</p> <p>Bio</p> <p>Linos Giannopoulos is working as a security engineer at the Greek Research and Technology Network (GRNET) for the past year. He has also worked for Riot Games as an Information Security Intern. Linos holds a MSc in Computer Science from the National and Technical University of Athens (NTUA) and his interests lie in following fields: Web Security, Network Security, Penetration Testing, Reverse Engineering and Programming Languages.</p> <p>GitHub: @linosgian<br/>Twitter: @coheNakatos</p> <p>Details</p> <p>Enter the building from the entrance next to the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":7200000,"time":1545325200000,"title":"Linos Giannopoulos on Building a DDoS mitigation pipeline using XDP"},"250608763":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/250608763/","description":"<p>We are very excited to announce that the fifth Athenian Papers We Love meetup will feature professor Diomidis Spinellis presenting on the Unix Architecture Evolution.</p> <p>Talks</p> <p>• Diomidis Spinellis presenting on the Unix Architecture Evolution: Milestones and Lessons Learned</p> <p>The Unix operating system has had a profound influence on the development of open source software and associated communities. Many of today's systems trace their code or design to a 1970 unnamed operating system kernel, implemented in 2489 lines of PDP-7 assembly language. This evolved into the Unix operating system, whose direct descendants include today's BSD systems and intellectual heirs form the various GNU/Linux distributions.</p> <p>How did the architecture of Unix evolve over the past half century? Based on a GitHub repository (<a href=\"https://github.com/dspinellis/unix-history-repo\" class=\"linkified\">https://github.com/dspinellis/unix-history-repo</a>) recording the system's history from 1970 until today, a database recording the evolution of provided facilities, and the reconstruction of the Third and Fourth Edition Unix manuals, we will examine the most significant milestones of this development and the lessons we can learn. Many architectural features, such as layering, system calls, devices as files, an interpreter, and process management, were already visible in the 1970 version. Other ideas followed quickly: the tree directory structure, user contributed code, I/O redirection, the shell as a user program, groups, pipes, and scripting. Later versions added domain-specific languages, environment variables, a documented file system hierarchy, software packages, virtual memory support, optimized screen handling, networking, storage pools, dynamic tracing, and a packet capture library. Based on a record of facilities documented over the years we will see areas in which evolution continues at an unchanged pace and areas where it appears stalled. We will also see how one measure of code complexity has followed a self-correcting path. Lessons we can derive from this amazing ride include the durability of early architectural features, the value of establishing conventions over the imposition of rigid mechanisms, the importance of additions made after the system's gestation, and the increasing difficulty of bringing about ground-breaking changes as Unix ages.</p> <p>Bio</p> <p>Diomidis Spinellis is a Professor of software engineering, the Editor in Chief of the IEEE Software magazine, a programmer, and technology author.</p> <p>Diomidis Spinellis is a Professor in the Department of Management Science and Technology at the Athens University of Economics and Business, Greece. His research interests include software engineering, IT security, and cloud systems engineering. He has written two award-winning, widely-translated books: “Code Reading” and “Code Quality: The Open Source Perspective”. In 2016 he published the book Effective Debugging: 66 Specific Ways to Debug Software and Systems. Diomidis has also published more than 250 technical papers in journals and refereed conference proceedings, which have received more than 5000 citations. He served for a decade as a member of the IEEE Software editorial board, authoring the regular “Tools of the Trade” column. He has contributed code that ships with Apple’s macOS and BSD Unix and is the developer of CScout, UMLGraph, dgsh, and other open-source software packages, libraries, and tools. He holds an MEng in Software Engineering and a PhD in Computer Science, both from Imperial College London. Dr. Spinellis has served as an elected member of the IEEE Computer Society Board of Governors (2013–2015), and is a senior member of the ACM and the IEEE. From January 2015 he is serving as the Editor-in-Chief for IEEE Software.</p> <p>Homepage: <a href=\"https://www.dmst.aueb.gr/dds/\" class=\"linkified\">https://www.dmst.aueb.gr/dds/</a><br/>Twitter: @CoolSWEng</p> <p>Details</p> <p>Enter the building from the entrance next to the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/a/6/6/3/600_471822595.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/a/6/7/e/600_471822622.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/a/7/4/c/600_471822828.jpeg","height":null,"width":null}],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":10800000,"time":1528387200000,"title":"Diomidis Spinellis on Unix Architecture Evolution Milestones and Lessons Learned"},"245941205":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/245941205/","description":"<p>We are very excited to host Chris Mantas for our second meetup! Chris will be presenting on Chord: A scalable peer-to-peer lookup service for internet applications (<a href=\"https://pdos.csail.mit.edu/papers/chord:sigcomm01/chord_sigcomm.pdf\" class=\"linkified\">https://pdos.csail.mit.edu/papers/chord:sigcomm01/chord_sigcomm.pdf</a>) by Stoica, et al.</p> <p>In addition to Chris' talk, Costas Drogos will be closing the event with a lightning talk on the Meltdown and Spectre attacks as these are described in their papers, found on <a href=\"https://meltdownattack.com\" class=\"linkified\">https://meltdownattack.com</a>.</p> <p>Talks</p> <p>• Chris Mantas on Chord:</p> <p>This 2001 paper has over 13K (!) citations on Google Scholar and is considered to be one of the most influential architectures in Distributed Systrems.</p> <p>While originally designed with P2P in mind, evolutions of Its architecture (Distributed Hash Table based) are the at the core of many modern (and old) NoSQL systems: Cassandra, Amazon's Dynamo, Riak, Voldemord, etc. Not to mention that it single-handendly brought P2P file-sharing to the 21st century by proviting the indexing service for BitTorrent.</p> <p>What I propose is a presentation of the architecture and protocol, with a verbal explanation of its application in the P2P era.</p> <p>If we have time after the presentation we could talk about how subsequently Dynamo (one of the first dstributed Key-Value storage systems) brought DHTs in the datacenter, staring the NoSQL boom.</p> <p>• Costas Drogos on the Meltdown and Spectre attacks:</p> <p>I will do a small intro on the Meltdown and Spectre attacks as these are described in their papers, found on <a href=\"https://meltdownattack.com\" class=\"linkified\">https://meltdownattack.com</a>.</p> <p>Papers are well written, so I'm not thinking of a full-blown presentation, something short just to get people acclimated to the techniques used in these attacks, why I liked these papers and what to do from now on.</p> <p>Bios</p> <p>Christos Mantas is a backend software engineer, working at Skroutz's Search team.<br/>Formerly he was a PhD candidate studying Distributed Systems in NTUA's CSLab.<br/>He has implemented a version of Chord in hi pre-graduate studies and it is precisely that assignment (and course) that convinced him to start studing about Distributed Systems in general, therefore beeing a big influence on him.</p> <p>Costas Drogos is a Site Reliability Engineer/Sysadmin, working for Kentik's ops team.</p> <p>Details</p> <p>Doors open at 6:30pm; the presentations will begin around 7pm.</p> <p>The talks will be in Greek, unless there are non-Greek speakers in the audience. In that case both talks will be in English.</p> <p>Enter the building from the entrance right beside the parking lot and climb to the second floor.</p> <p>After each presentation, we will open the floor to discussion and questions.</p> <p>We hope you will read the papers before the meetup, but don't stress if you can't. If you have any questions please add them on this event's thread.</p> <p>We have a Github repo which we use for coordinating Papers We Love Athens: <a href=\"https://github.com/papers-we-love/athens\" class=\"linkified\">https://github.com/papers-we-love/athens</a> We will be opening an issue before each meetup to serve as a space for Call for Presentations. If you have any ideas/questions about the meetup please open up an issue.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":7200000,"time":1515690000000,"title":"Chris Mantas on Chord"},"244537265":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/244537265/","description":"<p>We are very excited to host Nick Palladinos for our very first meetup! Nick will be presenting on <a href=\"https://page.mi.fu-berlin.de/scravy/realworldhaskell/materialien/the-essence-of-functional-programming.pdf\">The Essence of Functional Programming</a> by Phillip Wadler.</p> <p><b>Talks</b></p> <p><b><i>• Nick Palladinos on The Essence of Functional Programming:</i></b></p> <p>The paper is full of beautiful ideas and introduces the notion of a monad as a program structuring mechanism. You can think of it as the first and best monad tutorial out there! For me personally is not only a beautiful written paper but also a milestone for my later intellectual development.</p> <p><b>Bios</b></p> <p><a href=\"https://github.com/palladin\">Nick Palladinos</a> (<a href=\"https://twitter.com/NickPalladinos\">twitter</a>) has more than 20 years of programming experience in many different programming paradigms and development environments. Over the years he has acquired great interest and expertise in applying functional programming techniques to various business domains. Nick is also a frequent speaker at various programming meetup groups and IT conferences.</p> <p><b>Details</b></p> <p>Doors open at 6:30pm; the presentation will begin around 7pm.</p> <p>Enter the building from the entrance right beside the parking lot and climb to the second floor.</p> <p>After Nick's presentation, we will open the floor to discussion and questions.</p> <p>We hope you will read the paper before the meetup, but don't stress if you can't. If you have any questions please add them on this event's thread.</p> <p>We have a Github repo which we use for coordinating Papers We Love Athens: <a href=\"https://github.com/papers-we-love/athens\"><a href=\"https://github.com/papers-we-love/athens\" class=\"linkified\">https://github.com/papers-we-love/athens</a></a> We will be opening an issue before each meetup to serve as a space for Call for Presentations. If you have any ideas/questions about the meetup please open up an issue.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/8/9/b/8/600_466715256.jpeg","height":null,"width":null}],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":7200000,"time":1512666000000,"title":"Nick Palladinos on The Essence of Functional Programming"},"266726741":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/266726741/","description":"<p>We are very excited to announce that the 11th Athenian Papers We Love meetup will feature Apollonas Matsoukas presenting on Rapid solutions of problems by quantum computation (<a href=\"https://www.isical.ac.in/~rcbose/internship/lectures2016/rt08deutschjozsa.pdf\" class=\"linkified\">https://www.isical.ac.in/~rcbose/internship/lectures2016/rt08deutschjozsa.pdf</a>), by David Deutsch and Richard Jozsa. [1992].</p> <p>Talks</p> <p>• Apollonas Matsoukas on Rapid solutions of problems by quantum computation</p> <p>The Deutsch–Jozsa algorithm is the first and simplest example of a deterministic quantum algorithm that solves a problem exponentially faster than any classical deterministic algorithm.</p> <p>The key concept in quantum information theory is the \"qubit\". A set of controllable, interacting qubits can be used as a \"quantum register\". In this talk, after a brief introduction to the above notions, the Deutsch–Jozsa algorithm will be presented via a \"quantum circuit\", the most widespread model of a quantum Turing machine.</p> <p>Bio</p> <p>Apollonas Matsoukas holds a Bachelor’s degree in Physics with Major in Astrophysics, Astronomy and Mechanics, Department of Physics, University of Athens, Greece and a Master’s degree in Quantum Physics, from Niels Bohr’s institute, University of Copenhagen, Denmark.<br/>His research interests include high order perturbation theory, nearly-integrable systems, quasi-one dimensional systems, optical lattices, and ultracold atoms.</p> <p>----</p> <p>Lightning Talk:</p> <p>• Nikos Fertakis on The Deep Learning Revolution and Its Implications for Computer Architecture and Chip Design by Jeffrey Dean (<a href=\"https://arxiv.org/abs/1911.05289\" class=\"linkified\">https://arxiv.org/abs/1911.05289</a>)</p> <p>This paper discusses some of the advances in machine learning, and their implications on the kinds of computational devices we need to build, especially in the post-Moore's Law-era. It also discusses some of the ways that machine learning may also be able to help with some aspects of the circuit design process. Finally, it provides a sketch of at least one interesting direction towards much larger-scale multi-task models that are sparsely activated and employ much more dynamic, example- and task-based routing than the machine learning models of today.</p> <p>Bio</p> <p>Nikos Fertakis is a software engineer, and a tech lead at Skroutz's Search team. He holds a BSc in Computer Science from the University of Athens, and an MSc in Machine Learning from University College London.</p> <p>twitter: @nikosfertakis<br/>github: @greenonion</p> <p>Details</p> <p>Enter the building from the entrance next to the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> <p>Both talks will be in Greek.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":7200000,"time":1576083600000,"title":"Apollonas Matsoukas on Rapid solutions of problems by quantum computation"},"262123066":{"url":"https://www.meetup.com/Papers-We-Love-Athens/events/262123066/","description":"<p>We are very excited to be back with a new event! The 10th Athenian Papers We Love meetup will feature Kakia Panagidi and Kostis Gerakos presenting on The use of Kafka Platform for Mobile IOT</p> <p>Talks</p> <p>• Kakia Panagidi and Kostis Gerakos presenting on The use of Kafka Platform for Mobile IOT</p> <p>This presentation aims to describe the adoption of a highly efficient pub/sub middleware platform for unmanned mobile vehicles - UxVs (i.e., mobile vehicles of different categories) in real-world scenarios.</p> <p>After the introduction of the designed architecture, the insights of applying a distributed middleware providing 'experimentation as a service' in an Internet-of-Things (IoT) environment are discussed.</p> <p>It is worth noting that the discussed solution is invariant to the robotic platforms and scalable to new installations and additions in both software and hardware components. Quantitative findings presented show that the proposed scheme is efficient and can control UxVs in real time experiments.</p> <p>Bios</p> <p>• Kakia Panagidi</p> <p>My name is Kakia Panagidi and I am Senior Research And Development Engineer. I hold a M.Sc and a B.Sc. in \"Informatics and Telecommunications\" from the same Department. Furthermore, since January 2012, Ι am working as a researcher in the Pervasive Computing Research Group. I have participated in R&amp;D projects funded by the Horizon 2020, EU FP7 programme and national initiatives. My research interests focus on key problems on Machine Learning in Pervasive Computing and Internet of Things.</p> <p>GitHub: @kakiap</p> <p>• Kostis Gerakos</p> <p>My name is Kostis Gerakos and I am a Software Developer and Researcher in the Pervasive Computing Research Group. I hold a B.Sc in Digital Systems from the University of Piraeus and an M.Sc in Software and Hardware from the Department of Informatics and Telecommunications of National and Kapodistrian University of Athens. In the past, I have worked as a Web and Java developer. My research interests focus on Distributed Computing and Middleware.</p> <p>GitHub: @kostisgerakos</p> <p>Details</p> <p>Enter the building from the entrance next to the parking lot and climb to the second floor.</p> <p>After the presentation we will open the floor to discussion and questions.</p> ","photos":[],"venue":{"lat":38.043148040771484,"address1":"Alekou Panagouli 91","address2":null,"name":"Skroutz.gr","postalCode":null,"lon":23.760175704956055,"country":"gr","city":"Nea Ionia"},"utcOffset":10800000,"time":1561651200000,"title":"Kakia Panagidi and Kostis Gerakos on The use of Kafka Platform for Mobile IOT "}}