{"244023221":{"url":"https://www.meetup.com/papers-we-love-bcn/events/244023221/","description":"<p>Data Streams as Random Permutations (Paper) (<a href=\"https://hal.inria.fr/hal-01197221/document\" class=\"linkified\">https://hal.inria.fr/hal-01197221/document</a>)</p> <p>Presented by Jordi Montes, Research Engineer</p> <p>Abstract:</p> <p>Cardinality estimation has a wide range of applications from databases to network systems. The problem has been studied since the 80's and many algorithms have been proposed: Adaptive Sampling, HyperLogLog or Recorinality to say some of them.</p> <p>In this talk we will discuss why cardinality estimation is an important problem, how it has been solved before and why looking at data streams as random permutations can be useful (Hint: This simple observation allows a wealth of classical and recent results from combinatorics to be recycled, with minimal effort, as estimators for various statistics over data streams.).</p> <p>Talk will be based on this paper (<a href=\"https://hal.inria.fr/hal-01197221/document\"><a href=\"https://hal.inria.fr/hal-01197221/document\" class=\"linkified\">https://hal.inria.fr/hal-01197221/document</a></a>) but audience is not expected to know the paper or have previous exposure to this topic.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/4/6/f/0/600_466338160.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/4/6/f/1/600_466338161.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/4/6/f/3/600_466338163.jpeg","height":null,"width":null}],"venue":{"lat":41.385948181152344,"address1":"Plaça Catalunya 21, 3rd floor","address2":null,"name":"Verse HQ","postalCode":null,"lon":2.1702840328216553,"country":"es","city":"Barcelona"},"utcOffset":7200000,"time":1508864400000,"title":"Data Streams as Random Permutations: the Distinct Element Problem"},"247274095":{"url":"https://www.meetup.com/papers-we-love-bcn/events/247274095/","description":"<p>• What we'll do<br/>Papers we love Barcelona is back and we already have a list of amazing talks for the next months. The events will alternate between noon at the University and evenings at some company to be sure that everyone can attend.</p> <p>Searching with Dices: a survey on randomized data structures by Conrado Martinez (<a href=\"https://www.cs.upc.edu/~conrado/\" class=\"linkified\">https://www.cs.upc.edu/~conrado/</a>).</p> <p>The usefulness of randomization in the design of algorithms has been known for a long time (Rabin's primality test or Karger's algorithm). Randomized algorithms usually yield algorithms which are simple, elegant, with guaranteed expected performance and practical.</p> <p>Not many people know about why they work (theoretical basis) or how to analyze these algorithms. In this talk Conrado Martinez will explain two well-know data structures: Skip-lists (<a href=\"https://en.wikipedia.org/wiki/Skip_list\" class=\"linkified\">https://en.wikipedia.org/wiki/Skip_list</a>) and Randomized binary search trees (<a href=\"https://en.wikipedia.org/wiki/Treap#Randomized_binary_search_tree\" class=\"linkified\">https://en.wikipedia.org/wiki/Treap#Randomized_binary_search_tree</a>). We will grasp the basic idea of those data structures and the speaker will provide us the tools for analyzing those kind of data structures.</p> <p>The two papers of this event are:<br/>- Skip lists: <a href=\"http://www.epaperpress.com/sortsearch/download/skiplist.pdf\" class=\"linkified\">http://www.epaperpress.com/sortsearch/download/skiplist.pdf</a><br/>- Randomized Binary Search Trees: <a href=\"https://cis.temple.edu/~wolfgang/cis551/martinez.pdf\" class=\"linkified\">https://cis.temple.edu/~wolfgang/cis551/martinez.pdf</a></p> <p>This is an event organized by the UPC ACM Student Chapter for more information <a href=\"https://upc.acm.org\" class=\"linkified\">https://upc.acm.org</a> . If you need anything you can contact us at [masked].</p> <p>• What to bring<br/>You don't need to bring anything especial for this meetup.</p> <p>• Important to know<br/>Reading the papers is not a must but you should come in an open minded mood :)</p> <p>We have a code of conduct (<a href=\"https://github.com/papers-we-love/barcelona/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/barcelona/blob/master/code-of-conduct.md</a>) and everyone HAS to follow it. The rules are very simple: Be an adult, don't be a jerk.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/9/c/f/1/600_468880177.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/9/c/f/2/600_468880178.jpeg","height":null,"width":null}],"venue":{"lat":41.388587951660156,"address1":"C/ Jordi Girona 29","address2":null,"name":"Campus Nord UPC","postalCode":null,"lon":2.1161489486694336,"country":"es","city":"Barcelona"},"utcOffset":3600000,"time":1519815600000,"title":"Searching with Dice: Skip lists and Randomized Binary search trees"},"rklclpyxfbcc":{"url":"https://www.meetup.com/papers-we-love-bcn/events/248431744/","description":"<p>• What we'll do</p> <p>Argimiro Arratia will peresent the paper Matroids and the greedy algorithm J. Edmonds (1971).</p> <p>Argimiro Arratia is currently a professor of UPC and obtained his Ph.D in Mathematics (Wisconsin)<br/>You can find more information about him following the next link: <a href=\"http://www.cs.upc.edu/~argimiro/\" class=\"linkified\">http://www.cs.upc.edu/~argimiro/</a></p> <p>Abstract:</p> <p>A greedy algorithm is one of the simplest strategies to solve an optimization problem. It is based on a step-by-step selection of the best candidate (local) solution, in the hope that in the end of this process a global optimal solution is obtained. Greedy algorithms do not always output global optimal solutions, but for many optimization problems they do, in which case one says that the greedy algorithm works. Is there some criterion to know when it will work?</p> <p>A result that we should love, and I will present in this talk, due to Jack Edmonds and published in 1971, states that for a greedy algorithm to output optimal solutions it is necessary and sufficient that the input is a matroid.</p> <p>The intuition behind Edmonds’ result is to view the problem of determining the correctness of the greedy algorithm as a localization problem: in order to know if greedy works for some set, it suffices to check if greedy works for each of the parts of some discrete partition of the set. This is a classical working paradigm for the algebraic geometer, namely to solve problems locally and translate solutions globally, and vice versa. And a criterion that guarantees success of this local-to-global process when objects are viewed as ideals in some ring of polynomials is the Cohen-Macaulay property, which extends the concept of matroids.</p> <p>I will try to explain what this is, without going too deep into the mathematics, and show how this more ample algebraic concept explains when greedy works for computationally hard optimization problems like the Maximum Independent Set (to find the largest subset of vertices in a given graph which are pairwise non-adjacent), and the Coin-Exchange problem (to find the minimum number of coins, in a given monetary system, whose values sum up to a given target positive number).</p> <p>References:</p> <p>This talk is mostly based on my recent paper:</p> <p>- A. Arratia (2018) The Greedy Algorithm and the Cohen-Macaulay property of rings, graphs and toric projective curves (To appear in the Festshrift volume for Antonio Campillo on the occasion of his 65th birthday (Springer 2018))</p> <p>and the seminal paper of Jack Edmonds:</p> <p>- J. Edmonds (1971) Matroids and the greedy algorithm, Math. Programming 1,[masked]</p> <p>However I advise to learn Edmonds result from<br/>- Papadimitriou and Steiglitz (1998) Combinatorial Optimization, Algorithms and Complexity (Dover)<br/>- Cormen, Leiserson and Rivest, Introduction to Algorithms (MIT Press, 1990)</p> <p>• What to bring<br/>You don't need to bring anything especial for this meetup.</p> <p>• Important to know<br/>Reading the papers is not a must but you should come in an open minded mood :)</p> <p>We have a code of conduct (<a href=\"https://github.com/papers-we-love/barcelona/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/barcelona/blob/master/code-of-conduct.md</a>) and everyone HAS to follow it. The rules are very simple: Be an adult, don't be a jerk.</p> ","photos":[],"venue":{"lat":41.385948181152344,"address1":"Plaça Catalunya 21, 3rd floor","address2":null,"name":"Verse HQ","postalCode":null,"lon":2.1702840328216553,"country":"es","city":"Barcelona"},"utcOffset":3600000,"time":1521655200000,"title":"Why the Greedy algorithm works?"}}