{"256070810":{"url":"https://www.meetup.com/papers-we-love-bcn/events/256070810/","description":"<p>We open this new season of Papers We Love Barcelona with a really hot topic: Computer vision.</p> <p>We count with an expert in the topic: Carlos Andujar from the Universtat Politecnica de Catalunya. Carlos will discuss the paper DensePose: Dense Human Pose Estimation In The Wild from INRIA and Facebook AI Research. The paper can be download [here](<a href=\"http://openaccess.thecvf.com/content_cvpr_2018/papers/Guler_DensePose_Dense_Human_CVPR_2018_paper.pdf\" class=\"linkified\">http://openaccess.thecvf.com/content_cvpr_2018/papers/Guler_DensePose_Dense_Human_CVPR_2018_paper.pdf</a>) although there is no need to know anything about the topic before the talk.</p> <p>Talk: DensePose: Dense Human Pose Estimation In The Wild</p> <p>Dense human pose estimation is defined in this paper like the correspondences between an RGB image and a surface-based representation of the human body. Carlos will explain and discuss the last tecniques in this area like CNN-Based systems and fully-convunational networks from the point of view of a researcher in Graphics.</p> <p>Supplementary materials, data, code, and videos from the paper are provided on the project page <a href=\"http://densepose.org\" class=\"linkified\">http://densepose.org</a></p> <p>Speaker: Carlos Andújar Gran<br/>Carlos is an associate professor in the Computer Science Dept. of the Universitat Politècnica de Catalunya - BarcelonaTech. He is member of the ViRVIG - Research Center for Visualization, Virtual Reality and Graphics Interaction. He is also member of the Eurographics Association.<br/>His current research interests are: Computer Graphics, 3D modeling and animation, Virtual and augmented reality and 3D user interfaces.</p> ","photos":[],"venue":{"lat":41.3857536315918,"address1":"Plaça Catalunya 21, 3rd floor","address2":null,"name":"Verse HQ","postalCode":null,"lon":2.1708359718322754,"country":"es","city":"Barcelona"},"utcOffset":3600000,"time":1541699100000,"title":"PWL 11/2019: Dense Human Pose Estimation In The Wild"},"244023221":{"url":"https://www.meetup.com/papers-we-love-bcn/events/244023221/","description":"<p>Data Streams as Random Permutations (Paper) (<a href=\"https://hal.inria.fr/hal-01197221/document\" class=\"linkified\">https://hal.inria.fr/hal-01197221/document</a>)</p> <p>Presented by Jordi Montes, Research Engineer</p> <p>Abstract:</p> <p>Cardinality estimation has a wide range of applications from databases to network systems. The problem has been studied since the 80's and many algorithms have been proposed: Adaptive Sampling, HyperLogLog or Recorinality to say some of them.</p> <p>In this talk we will discuss why cardinality estimation is an important problem, how it has been solved before and why looking at data streams as random permutations can be useful (Hint: This simple observation allows a wealth of classical and recent results from combinatorics to be recycled, with minimal effort, as estimators for various statistics over data streams.).</p> <p>Talk will be based on this paper (<a href=\"https://hal.inria.fr/hal-01197221/document\"><a href=\"https://hal.inria.fr/hal-01197221/document\" class=\"linkified\">https://hal.inria.fr/hal-01197221/document</a></a>) but audience is not expected to know the paper or have previous exposure to this topic.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/4/6/f/0/600_466338160.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/4/6/f/1/600_466338161.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/4/6/f/3/600_466338163.jpeg","height":null,"width":null}],"venue":{"lat":41.385948181152344,"address1":"Plaça Catalunya 21, 3rd floor","address2":null,"name":"Verse HQ","postalCode":null,"lon":2.1702840328216553,"country":"es","city":"Barcelona"},"utcOffset":7200000,"time":1508864400000,"title":"Data Streams as Random Permutations: the Distinct Element Problem"},"249591640":{"url":"https://www.meetup.com/papers-we-love-bcn/events/249591640/","description":"<p>Paper: <a href=\"https://www.cc.gatech.edu/~mihail/LINIALexpsurvey.pdf\" class=\"linkified\">https://www.cc.gatech.edu/~mihail/LINIALexpsurvey.pdf</a></p> <p>More info: <a href=\"https://upc.acm.org\" class=\"linkified\">https://upc.acm.org</a></p> <p>Expander graphs and applications</p> <p>Expanding graphs grew up in the context of communication networks. The notion of expansion is related to the growth of neighborhoods of sets in graphs and it is so natural that it found its place in a wide area of applications, some of them unexpected, in computer science, statistics and mathematics. The aim of the talk is to describe some of these applications in computation, random walks and in error correcting codes. A probabilistic argument shows that expander graphs are abundant, but explicit constructions turn out to be connected to sophisticated mathematical tools, which will be only summarized in the talk.</p> <p>Nowadays there is a rich literature on the topic. The talk is based on the excellent survey :</p> <p>Shlomo Hoory, Nathan Linial and Avi Widgerson, Expander Graphs and their applications, Bulletin of the<br/>AMS Volume 43, Number 4, October 2006, Pages 439–561</p> ","photos":[],"venue":{"lat":41.3894157409668,"address1":"Facultat d'Informàtica de Barcelona","address2":null,"name":"UPC campus nord","postalCode":null,"lon":2.1133229732513428,"country":"es","city":"Edifici B6"},"utcOffset":7200000,"time":1524650400000,"title":"Expander graphs and applications"},"265954661":{"url":"https://www.meetup.com/papers-we-love-bcn/events/265954661/","description":"<p>We're really happy to announce the new season of PWL Barcelona.</p> <p>The event will have place at Travelperk's HQ</p> <p>As you may know papers we love is a community of people who meet for discussing different computer science papers. However, the reality is that we use papers as an excuse to talk about interesting topics in CS. What we all have all in common is curiosity. Many of us are students, researchers or software engineers who spend 8h coding/solving problems.</p> <p>Once per month we meet and talk about Computer Science/Software engineering. Our events are open to people from all levels so don't be scared by the word \"paper\".</p> <p>In this event we will try a new format were we will talk about different topics and we will avoid the convention of one lighting talk + one paper talk. We will discuss:</p> <p>- Industry-scale knowledge graphs<br/>- Scaling static analysis @ Facebook<br/>- The algorithm that changed quantum machine learning<br/>- The success of the web<br/>- The history of spam</p> <p>The topics have been extracted from the ACM Communications 08/2019</p> <p>If you enjoy CS related content don't be shy and come to say hi!</p> ","photos":[],"venue":{"lat":41.403404235839844,"address1":"Avinguda Diagonal, 211","address2":null,"name":"TravelPerk","postalCode":null,"lon":2.1895930767059326,"country":"es","city":"Barcelona"},"utcOffset":3600000,"time":1574877600000,"title":"Papers We Love Barcelona November Meetup"},"268140742":{"url":"https://www.meetup.com/papers-we-love-bcn/events/268140742/","description":"<p>[Paper link](<a href=\"https://web.cs.ucdavis.edu/~filkov/papers/lang_github.pdf\" class=\"linkified\">https://web.cs.ucdavis.edu/~filkov/papers/lang_github.pdf</a>)</p> <p>Software engineers seem to develop a strange attachment for the tools they use. There seems to be consensus about \"using the right tool for the right job\" but the war about which tool is better suited for a job is a typical topic of discussion in our field. From Vim vs Emacs to OOP vs Functional programming most of the arguments seem to be based on feelings/abstract ideas instead of being backed by data.</p> <p>Lau Llobet from Codurance will present a paper based on a large scale study of projects on Github trying to correlate different code quality metrics to the programming language that those projects are written in.</p> <p>This will be a good occasion for discussing some controverted topics and try to shed light on an endless discussion.</p> <p>About the author:</p> <p>Lau Llobet discovered his passion for programming methodologies when he read the Clean Code book, directly after finishing his software engineering degree. Since then he has had the opportunity to practice clean code in several fields, including research, startups and education. He loves languages and their ability to define and deliver concepts.</p> <p>About Codurance</p> <p>Codurance is a partner to create a more sustainable and adaptable future via well-crafted software and positive cultural change.<br/>They help development teams to get better at continuously delivering software through the application of Extreme Programming practices and Software Craftsmanship values. The way they work is firmly grounded in Software Craftsmanship and Agile principles. They believe that software should continuously add value to the business with inherent quality that allows it to evolve along with the changing needs of the business.</p> ","photos":[],"venue":{"lat":41.39607620239258,"address1":"C. de Pallars, 99","address2":null,"name":"Codurance","postalCode":null,"lon":2.1907310485839844,"country":"es","city":"Barcelona"},"utcOffset":3600000,"time":1582135200000,"title":"02/20 Lau Llobet on A Large-Scale Study of Programming Languages & Code Quality"},"247274095":{"url":"https://www.meetup.com/papers-we-love-bcn/events/247274095/","description":"<p>• What we'll do<br/>Papers we love Barcelona is back and we already have a list of amazing talks for the next months. The events will alternate between noon at the University and evenings at some company to be sure that everyone can attend.</p> <p>Searching with Dices: a survey on randomized data structures by Conrado Martinez (<a href=\"https://www.cs.upc.edu/~conrado/\" class=\"linkified\">https://www.cs.upc.edu/~conrado/</a>).</p> <p>The usefulness of randomization in the design of algorithms has been known for a long time (Rabin's primality test or Karger's algorithm). Randomized algorithms usually yield algorithms which are simple, elegant, with guaranteed expected performance and practical.</p> <p>Not many people know about why they work (theoretical basis) or how to analyze these algorithms. In this talk Conrado Martinez will explain two well-know data structures: Skip-lists (<a href=\"https://en.wikipedia.org/wiki/Skip_list\" class=\"linkified\">https://en.wikipedia.org/wiki/Skip_list</a>) and Randomized binary search trees (<a href=\"https://en.wikipedia.org/wiki/Treap#Randomized_binary_search_tree\" class=\"linkified\">https://en.wikipedia.org/wiki/Treap#Randomized_binary_search_tree</a>). We will grasp the basic idea of those data structures and the speaker will provide us the tools for analyzing those kind of data structures.</p> <p>The two papers of this event are:<br/>- Skip lists: <a href=\"http://www.epaperpress.com/sortsearch/download/skiplist.pdf\" class=\"linkified\">http://www.epaperpress.com/sortsearch/download/skiplist.pdf</a><br/>- Randomized Binary Search Trees: <a href=\"https://cis.temple.edu/~wolfgang/cis551/martinez.pdf\" class=\"linkified\">https://cis.temple.edu/~wolfgang/cis551/martinez.pdf</a></p> <p>This is an event organized by the UPC ACM Student Chapter for more information <a href=\"https://upc.acm.org\" class=\"linkified\">https://upc.acm.org</a> . If you need anything you can contact us at [masked].</p> <p>• What to bring<br/>You don't need to bring anything especial for this meetup.</p> <p>• Important to know<br/>Reading the papers is not a must but you should come in an open minded mood :)</p> <p>We have a code of conduct (<a href=\"https://github.com/papers-we-love/barcelona/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/barcelona/blob/master/code-of-conduct.md</a>) and everyone HAS to follow it. The rules are very simple: Be an adult, don't be a jerk.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/9/c/f/1/600_468880177.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/9/c/f/2/600_468880178.jpeg","height":null,"width":null}],"venue":{"lat":41.388587951660156,"address1":"C/ Jordi Girona 29","address2":null,"name":"Campus Nord UPC","postalCode":null,"lon":2.1161489486694336,"country":"es","city":"Barcelona"},"utcOffset":3600000,"time":1519815600000,"title":"Searching with Dice: Skip lists and Randomized Binary search trees"},"rklclpyxfbcc":{"url":"https://www.meetup.com/papers-we-love-bcn/events/rklclpyxfbcc/","description":"<p>• What we'll do</p> <p>Argimiro Arratia will peresent the paper Matroids and the greedy algorithm J. Edmonds (1971).</p> <p>Argimiro Arratia is currently a professor of UPC and obtained his Ph.D in Mathematics (Wisconsin)<br/>You can find more information about him following the next link: <a href=\"http://www.cs.upc.edu/~argimiro/\" class=\"linkified\">http://www.cs.upc.edu/~argimiro/</a></p> <p>Abstract:</p> <p>A greedy algorithm is one of the simplest strategies to solve an optimization problem. It is based on a step-by-step selection of the best candidate (local) solution, in the hope that in the end of this process a global optimal solution is obtained. Greedy algorithms do not always output global optimal solutions, but for many optimization problems they do, in which case one says that the greedy algorithm works. Is there some criterion to know when it will work?</p> <p>A result that we should love, and I will present in this talk, due to Jack Edmonds and published in 1971, states that for a greedy algorithm to output optimal solutions it is necessary and sufficient that the input is a matroid.</p> <p>The intuition behind Edmonds’ result is to view the problem of determining the correctness of the greedy algorithm as a localization problem: in order to know if greedy works for some set, it suffices to check if greedy works for each of the parts of some discrete partition of the set. This is a classical working paradigm for the algebraic geometer, namely to solve problems locally and translate solutions globally, and vice versa. And a criterion that guarantees success of this local-to-global process when objects are viewed as ideals in some ring of polynomials is the Cohen-Macaulay property, which extends the concept of matroids.</p> <p>I will try to explain what this is, without going too deep into the mathematics, and show how this more ample algebraic concept explains when greedy works for computationally hard optimization problems like the Maximum Independent Set (to find the largest subset of vertices in a given graph which are pairwise non-adjacent), and the Coin-Exchange problem (to find the minimum number of coins, in a given monetary system, whose values sum up to a given target positive number).</p> <p>References:</p> <p>This talk is mostly based on my recent paper:</p> <p>- A. Arratia (2018) The Greedy Algorithm and the Cohen-Macaulay property of rings, graphs and toric projective curves (To appear in the Festshrift volume for Antonio Campillo on the occasion of his 65th birthday (Springer 2018))</p> <p>and the seminal paper of Jack Edmonds:</p> <p>- J. Edmonds (1971) Matroids and the greedy algorithm, Math. Programming 1,[masked]</p> <p>However I advise to learn Edmonds result from<br/>- Papadimitriou and Steiglitz (1998) Combinatorial Optimization, Algorithms and Complexity (Dover)<br/>- Cormen, Leiserson and Rivest, Introduction to Algorithms (MIT Press, 1990)</p> <p>• What to bring<br/>You don't need to bring anything especial for this meetup.</p> <p>• Important to know<br/>Reading the papers is not a must but you should come in an open minded mood :)</p> <p>We have a code of conduct (<a href=\"https://github.com/papers-we-love/barcelona/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/barcelona/blob/master/code-of-conduct.md</a>) and everyone HAS to follow it. The rules are very simple: Be an adult, don't be a jerk.</p> ","photos":[],"venue":{"lat":41.385948181152344,"address1":"Plaça Catalunya 21, 3rd floor","address2":null,"name":"Verse HQ","postalCode":null,"lon":2.1702840328216553,"country":"es","city":"Barcelona"},"utcOffset":3600000,"time":1521655200000,"title":"Why the Greedy algorithm works?"}}