{"236666972":{"url":"https://www.meetup.com/Papers-We-Love-Belfast/events/236666972/","description":"<p>Happy New Year, paper fans! For our first PWL Belfast event of 2017 sponsored by HighWire Press, we're very happy to have Phil Weir presenting a talk titled <a href=\"https://maths.ucd.ie/~plynch/Publications/WPNP-Foreword.pdf\">20 May 1910: LF Richardson and the Dawn of Simulation</a>.</p> <p><br/>Summary</p> <p>Accurate weather forecasts based on computer simulation are now produced as a routine, and have reached such a level of reliability that the rare forecast failures evoke a strong reaction in the media and amongst users. Numerical simulation of an ever-increasing range of geophysical phenomena is adding enormously to our understanding of complex processes in the Earth system. The consequences for mankind of ongoing climate change will be far-reaching. Earth System Models are capable of replicating climate regimes of past millennia and are the best means we have of predicting the future of our climate. </p> <p><br/>Details</p> <p>Doors open at 6.30 pm and the presentation will begin at 7 pm. There will be food (please drop the organisers a message if you have dietary requirements), beers and lemonade!</p> <p>After Phil presents the paper, we will open up the floor to discussion and questions.  We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, feel free to <a href=\"https://twitter.com/PWLBelfast\">twitter</a>, or add to the discussion on this event's thread. </p> <p>Never read a paper before? Try <a href=\"http://www4.ncsu.edu/~akmassey/posts/[masked]-advice-on-reading-academic-papers.html\">this</a> or <a href=\"https://violentmetaphors.com/2013/08/25/how-to-read-and-understand-a-scientific-paper-2\">this</a> to help you get started :)</p> <p>Note that by RSVPing to this event you are agreeing to follow our <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a>.</p> <p>\n\n\nAbout our Sponsors</p> <p><i>HighWire: Technology for Scholarly Communication</i></p> <p>Hosting over 3000 high-impact journals, books, and other scholarly publications, HighWire delivers continuously evolving and flexible technology solutions to influential societies, university presses and independent publishers that disseminate scholarly research worldwide.</p> <p>Informed by industry advancements and the HighWire Publisher Community, HighWire plays a leadership role in maximizing world-wide discovery of scholarly articles and have consistently been the first to implement key search-related features that have since become adopted as industry standard.</p> <p>HighWire provides strategic consulting, from daily tasks to long-term strategy, professional services and innovative open platform technologies. Product offerings include digital content development and hosting services; BenchPress, a highly customizable peer-review manuscript submission system; and Vizors, a suite of visual analytics tools for publishing insights.</p> <p>In the rapidly changing environment that is facing the publishing industry, HighWire’s investment in its people, products, infrastructure and the scholarly community is delivering real operational excellence, customer centricity and pragmatic innovation. The commitment of our people to our customers significantly differentiates HighWire in the market and our customers see HighWire as a trusted partner rather than simply a supplier.</p> <p>With offices in the US and new offices in the UK, HighWire is a truly global organisation serving customers around the clock. <a href=\"http://www.highwire.org/\">www.highwire.org</a></p> ","photos":[],"venue":{"lat":54.594112396240234,"address1":"Andras House, th Floor, 60 Great Victoria Street","address2":null,"name":"Highwire Press","postalCode":null,"lon":-5.933835983276367,"country":"gb","city":"Belfast"},"utcOffset":0,"time":1485369000000,"title":"PWL Belfast #3 - \"20 May 1910: LF Richardson and the Dawn of Simulation\""},"235879149":{"url":"https://www.meetup.com/Papers-We-Love-Belfast/events/235879149/","description":"<p>For our second Papers We Love Belfast event we're very pleased to have Chris Nixon presenting <a href=\"https://www.ece.cmu.edu/~ganger/712.fall02/papers/p761-thompson.pdf\">\"Reflections on Trusting Trust\"</a>!</p> <p>Details</p> <p><br/>Doors open at 6.30 pm and the presentation will begin at 7 pm. There will (hopefully!) be food and refreshments (including vegetarian and vegan options, please let us know if you have any other dietary requirements).</p> <p>After Chris presents the paper, we will open up the floor to discussion and questions.  We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, feel free to get in touch on <a href=\"https://twitter.com/PWLBelfast\">twitter</a>, or add to the discussion on this event's thread. </p> <p>Never read a paper before? Try <a href=\"http://www4.ncsu.edu/~akmassey/posts/[masked]-advice-on-reading-academic-papers.html\">this</a> or <a href=\"https://violentmetaphors.com/2013/08/25/how-to-read-and-understand-a-scientific-paper-2\">this</a> to help you get started :)</p> <p>Note that by RSVPing to this event you are agreeing to follow our <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a>.</p> <p>Hope to see everyone there!</p> ","photos":[],"venue":{"lat":54.597286224365234,"address1":"Unit 20B Weavers Court, Linfield Industrial Estate","address2":null,"name":"Proofpoint","postalCode":null,"lon":-5.93011999130249,"country":"gb","city":"Belfast"},"utcOffset":0,"time":1481050800000,"title":"Papers We Love Belfast #2 - \"Reflections on Trusting Trust\""},"243093533":{"url":"https://www.meetup.com/Papers-We-Love-Belfast/events/243093533/","description":"<p>Speaker(s!) TBC</p> ","photos":[],"venue":{"lat":54.597286224365234,"address1":"1 Weavers Court Business Park","address2":"Linfield Road","name":"Farset Labs","postalCode":null,"lon":-5.93011999130249,"country":"gb","city":"Belfast"},"utcOffset":3600000,"time":1508349600000,"title":"PWL Belfast #5"},"240506364":{"url":"https://www.meetup.com/Papers-We-Love-Belfast/events/240506364/","description":"<p>Papers We Love Belfast is pleased to announce our fourth event, sponsored by Flax &amp; Teal! This time, we're delighted to welcome Michael Jason Smith presenting a Research at Google paper, &lt;a&gt;Idle Time Garbage Collection Scheduling&lt;/a&gt;!</p> <p><br/><i>Abstract</i></p> <p>Efficient garbage collection is increasingly important in today’s managed language runtime systems that demand low latency, low memory consumption, and high throughput. Garbage collection may pause the application for many milliseconds to identify live memory, free unused memory, and compact fragmented regions of memory, even when employing concurrent garbage collection. In animation-based applications that require 60 frames per second, these pause times may be observable, degrading user experience. This paper introduces idle time garbage collection scheduling to increase the responsiveness of applications by hiding expensive garbage collection operations inside of small, otherwise unused idle portions of the application’s execution, resulting in smoother animations. </p> <p>\n\n<i>Details</i></p> <p>Doors open at 6.30 pm and the presentation will begin at 7 pm. There will be some food (incl vegan options), beers and lemonade afterwards.</p> <p>After Michael presents the paper, we will open up the floor to discussion and questions.  We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, feel free to <a href=\"https://twitter.com/PWLBelfast\">twitter</a>, or add to the discussion on this event's thread. </p> <p>Never read a paper before? Try <a href=\"http://www4.ncsu.edu/~akmassey/posts/[masked]-advice-on-reading-academic-papers.html\">this</a> or <a href=\"https://violentmetaphors.com/2013/08/25/how-to-read-and-understand-a-scientific-paper-2\">this</a> to help you get started :)</p> <p>Note that by RSVPing to this event you are agreeing to follow our <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a>.</p> <p>\n\n\n<i>About our Sponsors - Flax &amp; Teal</i></p> <p>Flax &amp; Teal focuses on using open source technology to do better business, building solutions that empower clients from the ground up. In collaboration with experienced independent practitioners across the local IT sector, we provide services to international and local clients including consultancy, managed projects, web development, infrastructure, programming training, science and data analysis.</p> ","photos":[],"venue":{"lat":54.597286224365234,"address1":"Unit 20B Weavers Court, Linfield Industrial Estate","address2":null,"name":"Proofpoint","postalCode":null,"lon":-5.93011999130249,"country":"gb","city":"Belfast"},"utcOffset":3600000,"time":1499364000000,"title":"PWL Belfast #4 - \"Idle Time Garbage Collection Scheduling\""},"234379377":{"url":"https://www.meetup.com/Papers-We-Love-Belfast/events/234379377/","description":"<p>For our very first Papers We Love Belfast we're delighted to have Paddy Carey presenting <a href=\"https://raft.github.io/raft.pdf\">Raft</a>, a distributed consensus algorithm!</p> <p><br/>Abstract</p> <p><br/>Raft is a consensus algorithm for managing a replicated log. It produces a result equivalent to (multi-)Paxos, and it is as efficient as Paxos, but its structure is different from Paxos; this makes Raft more understandable than Paxos and also provides a better foundation for building practical systems. In order to enhance understandability, Raft separates the key elements of consensus, such as leader election, log replication, and safety, and it enforces a stronger degree of coherency to reduce the number of states that must be considered. Results from a user study demonstrate that Raft is easier for students to learn than Paxos. Raft also includes a new mechanism for changing the cluster membership, which uses overlapping majorities to guarantee safety.</p> <p><br/>Details</p> <p>Doors open at 6.30 pm and the presentation will begin at 7 pm. There will be food (including some really nice vegetarian and vegan options), craft beers and some stonkingly good lemonade.</p> <p>After Paddy presents the paper, we will open up the floor to discussion and questions.  We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, feel free to &lt;a&gt;email us&lt;/a&gt;, contact us on <a href=\"https://twitter.com/PWLBelfast\">twitter</a>, or add to the discussion on this event's thread. </p> <p>Never read a paper before? Try <a href=\"http://www4.ncsu.edu/~akmassey/posts/[masked]-advice-on-reading-academic-papers.html\">this</a> or <a href=\"https://violentmetaphors.com/2013/08/25/how-to-read-and-understand-a-scientific-paper-2\">this</a> to help you get started :)</p> <p>Note that by RSVPing to this event you are agreeing to follow our <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a>.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/a/1/2/8/600_455261256.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/a/1/3/9/600_455261273.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/a/1/4/4/600_455261284.jpeg","height":null,"width":null}],"venue":{"lat":54.597286224365234,"address1":"1 Weavers Court Business Park","address2":"Linfield Road","name":"Farset Labs","postalCode":null,"lon":-5.93011999130249,"country":"gb","city":"Belfast"},"utcOffset":3600000,"time":1476811800000,"title":"Papers We Love - Raft"}}