{"228982555":{"url":"https://www.meetup.com/papers-we-love-bsb/events/228982555/","description":"<p><b>Paper</b>:</p> <p><br/>Abhishek Verma, Luis Pedrosa, Madhukar Korupolu, David Oppenheimer, Eric Tune, and John Wilkes. &lt;a&gt;Large-scale cluster management at Google with Borg&lt;/a&gt;. In the Tenth European Conference on Computer Systems (EuroSys), 2015.</p> <p><b>PDF:</b></p> <p><b><a href=\"http://static.googleusercontent.com/media/research.google.com/en/pubs/archive/43438.pdf\">&lt;/a&gt;</b>&lt;a&gt;<a href=\"http://static.googleusercontent.com/media/research.google.com/en//pubs/archive/43438.pdf\" class=\"linkified\">http://static.googleusercontent.com/media/research.google.com/en//pubs/archive/43438.pdf</a></a><b><br/></b></p> <p><b>Abstract:</b></p> <p>Google's Borg system is a cluster manager that runs hundreds of thousands of jobs, from many thousands of different applications, across a number of clusters each with up to tens of thousands of machines.<br/>It achieves high utilization by combining admission control, efficient task-packing, over-commitment, and machine sharing with process-level performance isolation. It supports high-availability applications with runtime features that minimize fault-recovery time, and scheduling policies that reduce the probability of correlated failures. Borg simplifies life for its users by offering a declarative job specification language, name service integration, real-time job monitoring, and tools to analyze and simulate system behavior.<br/>We present a summary of the Borg system architecture and features, important design decisions, a quantitative analysis of some of its policy decisions, and a qualitative examination of lessons learned from a decade of operational experience with it.<b><br/></b></p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":null,"postalCode":null,"lon":null,"country":false,"city":false},"utcOffset":-7200000,"time":1481839200000,"title":"Large-scale cluster management at Google with Borg"},"224034566":{"url":"https://www.meetup.com/papers-we-love-bsb/events/224034566/","description":"<p>Montola, Markus. <i>\"<a href=\"http://www.markusmontola.fi/exploringtheedge.pdf\">Exploring the edge of the magic circle: Defining pervasive games</a>.\"</i> Proceedings of DAC. Vol. 1966. 2005.<br/><a href=\"http://www.markusmontola.fi/exploringtheedge.pdf\" class=\"linkified\">http://www.markusmontola.fi/exploringtheedge.pdf</a></p> <p><b>Intro</b></p> <p><br/>Pervasive gaming is a genre of gaming systematically blurring and breaking the traditional boundaries of game. The new game genres include alternate reality games, reality games, trans-reality games and cross-media games.</p> <p><br/><b>About the speaker</b></p> <p><b><a href=\"http://about.buzeto.com\">Fabricio Buzeto</a></b> is a PhD candidate at University of Brasilia, in which his main work focuses on Ubiquitous Computing and Games. Additionally, Fabricio is a co-founder of the <a href=\"http://www.unbiquitous.org/\">UnBiquitous</a> research group at UnB. Likewise, he co-founded two startups: Intacto and Qual Canal. His technical blog is at <a href=\"http://blog.buzeto.com/\"><a href=\"http://blog.buzeto.com\" class=\"linkified\">http://blog.buzeto.com</a></a>, and he's <a href=\"https://twitter.com/nukdf\">@nukdf</a> on Twitter</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/e/5/5/d/600_441538717.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/e/5/5/e/600_441538718.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/e/5/5/f/600_441538719.jpeg","height":null,"width":null}],"venue":{"lat":0.0,"address1":"Departamento de Ciência da Computação - Campus Universitário Darcy Ribeiro - Asa Norte Edifício CIC/EST 70910-900 Brasília","address2":null,"name":"Laboratório de Sistemas Integrados e Concorrente (LAICO)","postalCode":null,"lon":0.0,"country":"br","city":"Brasília"},"utcOffset":-10800000,"time":1440023400000,"title":"Fabricio Buzeto on Exploring the Edge of the Magic Circle"},"234325718":{"url":"https://www.meetup.com/papers-we-love-bsb/events/234325718/","description":"<p><b>Paper</b></p> <p><br/>Kreps, Jay, Neha Narkhede, and Jun Rao. <a href=\"http://research.microsoft.com/en-us/um/people/srikanth/netdb11/netdb11papers/netdb11-final12.pdf\">Kafka: A distributed messaging system for log processing</a>. In Proceedings of the NetDB, pp. 1-7. 2011.</p> <p><b>PDF</b>:  </p> <p><a href=\"http://research.microsoft.com/en-us/um/people/srikanth/netdb11/netdb11papers/netdb11-final12.pdf\"><a href=\"http://research.microsoft.com/en-us/um/people/srikanth/netdb11/netdb11papers/netdb11-final12.pdf\" class=\"linkified\">http://research.microsoft.com/en-us/um/people/srikanth/netdb11/netdb11papers/netdb11-final12.pdf</a></a></p> <p><b>Abstract</b>:</p> <p>Log processing has become a critical component of the data pipeline for consumer internet companies. We introduce Kafka, a distributed messaging system that we developed for collecting and delivering high volumes of log data with low latency. Our system incorporates ideas from existing log aggregators and messaging systems, and is suitable for both offline and online message consumption. We made quite a few unconventional yet practical design choices in Kafka to make our system efficient and scalable. Our experimental results show that Kafka has superior performance when compared to two popular messaging systems. We have been using Kafka in production for some time and it is processing hundreds of gigabytes of new data each day.</p> <p><b>Local</b>:</p> <p>Excepcionalmente este encontro será online. O link para participar é: <a href=\"https://hangouts.google.com/call/7typjyvojncrdjtsefvagjucxie\"><a href=\"https://hangouts.google.com/call/7typjyvojncrdjtsefvagjucxie\" class=\"linkified\">https://hangouts.google.com/call/7typjyvojncrdjtsefvagjucxie</a></a></p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":null,"postalCode":null,"lon":null,"country":false,"city":false},"utcOffset":-10800000,"time":1475794800000,"title":"Kafka: A distributed messaging system for log processing"},"229004456":{"url":"https://www.meetup.com/papers-we-love-bsb/events/229004456/","description":"<p><b>Paper:</b></p> <p>Pang, Candy; Hindle, Abram; Adams, Bram;  Hassan, Ahmed. \"<a href=\"https://peerj.com/preprints/886.pdf\">What do programmers know about software energy consumption?</a>\", in IEEE Software, vol. 33, no. 3, pp. 83-89, May-June 2016.</p> <p><br/><b>PDF</b>:</p> <p><a href=\"https://peerj.com/preprints/886.pdf\"><a href=\"https://peerj.com/preprints/886.pdf\" class=\"linkified\">https://peerj.com/preprints/886.pdf</a></a></p> <p><b>Abstract</b>:</p> <p>Traditionally, programmers have received a wide range of training on programming languages and methodologies, but rarely about software energy consumption. Yet, the popularity of mobile devices and cloud computing require increased awareness about software energy consumption. On a mobile device, computation is often limited by the battery life. Under the demands of cloud computing, data centers struggle to reduce energy consumption through virtualization and data center infrastructure management (DCIM) systems. Efficient energy consumption of software is increasingly becoming an important non-functional requirement for programmers. However, are programmers knowledgeable enough about software energy consumption? Do programmers base their implementation decision on popular beliefs? In this article, we survey over 100 programmers for their knowledge of software energy consumption. We find that programmers have limited knowledge about energy efficiency, lack the knowledge about the best practice to reduce energy consumption of software, and are often unsure about how software consumes energy. Education about the importance of energy effective software will benefit the programmers. Our results highlight the need for training about energy consumption and efficiency.</p> <p>Hangout:</p> <p><a href=\"https://plus.google.com/events/cam7v6phqcdls7332m214bioueo\"><a href=\"https://plus.google.com/events/cam7v6phqcdls7332m214bioueo\" class=\"linkified\">https://plus.google.com/events/cam7v6phqcdls7332m214bioueo</a></a></p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":null,"postalCode":null,"lon":null,"country":false,"city":false},"utcOffset":-7200000,"time":1486677600000,"title":"What do programmers know about software energy consumption?"}}