{"239510839":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/239510839/","description":"<p>Paper: <br/><a href=\"http://www.exp-platform.com/Documents/puzzlingOutcomesInControlledExperiments.pdf\"><a href=\"http://www.exp-platform.com/Documents/puzzlingOutcomesInControlledExperiments.pdf\" class=\"linkified\">http://www.exp-platform.com/Documents/puzzlingOutcomesInControlledExperiments.pdf</a></a></p> <p>Summary: <br/>Designing experiments for the web is hard. Making sound business decisions without validation is even harder. This paper looks at experiments that had confusing/misleading/puzzling results. We’ll deconstruct the experiments and the relevant terminology in order to craft better experiences ourselves.</p> <p><br/>Bio:<br/>Neil Menne is an engineer at Pylon ai where he has been working on how to manage experiments in conversational experiences and other fun, interesting things.</p> <p>Also:<br/>this is a good way</p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1493760600000,"title":"Neil Menne on Trustworthy Online Controlled Experiments: Five Puzzling Outcomes"},"247388086":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/247388086/","description":"<p>• What we'll do<br/>Zero-knowledge proofs, specifically zkSNARKs, are an interesting and powerful method for encryption whose use has recently risen due to their applications in cryptocurrencies. Following up on his November overview of Zcash and by popular demand, Bill will lead us on a more in-depth look at these methodologies and how to understand them in laymen's terms.</p> <p>Bill Brock is the head of delivery at Very, a Chattanooga based web and mobile consultancy. At Very, he runs the gamut from product management to sales with a smattering of utilitarian hacking. Lately Bill has fully fallen prey to the blockchain hype and planning to launch an ICO in early 2018 to to fund the brockchain: skynet V0.1</p> <p>Link to paper: <a href=\"http://chriseth.github.io/notes/articles/zksnarks/zksnarks.pdf\" class=\"linkified\">http://chriseth.github.io/notes/articles/zksnarks/zksnarks.pdf</a></p> <p>• What to bring</p> <p><br/>• Important to know</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1517956200000,"title":"Bill Brock on zkSNARKs in a Nutshell"},"240378747":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/240378747/","description":"<p>This paper attempts to set the epistemology of machine intelligence by exploring the relationships between various components such as unintelligent machine characteristics, intelligent characteristics, classification of intelligence, and more. </p> <p>Derik is a native Chattanoogan working as an engineer at Emma Email Marketing writing mostly Python, and as little JavaScript as he can get away with.</p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1496784600000,"title":"Derik Pell on Elementary Epistemological Features of Machine Intelligence"},"245517172":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/245517172/","description":"<p>Challenging Neural Dialogue Models with Natural Data: Memory Networks Fail on Incremental Phenomena</p> <p><a href=\"https://arxiv.org/abs/1709.07840\"><a href=\"https://arxiv.org/abs/1709.07840\" class=\"linkified\">https://arxiv.org/abs/1709.07840</a></a></p> <p>Neural networks are, in the immortal words of Mugatu, “so hot right now”. In the frenzied attempt to apply them to every known problem from image processing to NLP, very few people (or at least very few papers) stop to ask the question, “Is this really the right tool for the job?” This, as you may have guessed, is one of the few papers that does.</p> <p>About the Presenter:</p> <p>Josh Ziegler is a Principal Software Engineer at Pylon ai, a pronounced logophile, and co-hosts The Screeners podcast when he's not listening to Lana Del Rey.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1512513000000,"title":"Challenging Neural Dialogue Models with Natural Data"},"241799114":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/241799114/","description":"<p>Reinforcement Learning is a sixty year old AI discipline that attempts to mimic human learning through actions and rewards. This is a paper written by the team at DeepMind and is one of the reasons Google bought their company for $500M. A variant of this algorithm was used in the AlphaGo program that beat Lee Sedol in 2016.</p> <p>Brent Spell is a programmer at Pylon ai, Inc. and is interested in distributed systems and machine learning.</p> <p><br/>Paper: <a href=\"https://arxiv.org/pdf/1312.5602v1.pdf\">Playing Atari with Deep Reinforcement Learning</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1502227800000,"title":"Brent Spell on Playing Atari with Deep Reinforcement Learning"},"237702021":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/237702021/","description":"<p>In recent years, supervised learning with convolutional neural networks (CNNs) has seen huge adoption in computer vision applications. Comparatively, unsupervised learning with CNNs has received less attention. In this work, the authors attempt to bridge the gap between supervised learning and unsupervised learning using CNNs.</p> <p>This paper introduces the concept of DCGANs, which are neural networks that are trained to distinguish interesting structures and meaning from raw image data by competing with one another. In particular, the networks that are presented appear to be a strong candidate set for unsupervised learning of features for use in realistic image generation.&gt;&gt;We’ll explore convincing evidence that the DCGAN pair used here learns a hierarchical representation of the features held within images ranging from objects to entire scenes. Additionally, we’ll explore the use of these learned features for novel tasks - demonstrating their applicability as generic image representations.</p> <p><br/>Matt Hardwick is a software engineer with 10+ years of experience creating software systems in various industries, including defense simulations and web-based applications. He currently leads an engineering team at Bellhops using technology to improve the way that people move from place to place. His recent software interests are Machine Learning and Elixir.</p> <p>Paper: <a href=\"https://arxiv.org/pdf/1511.06434v2.pdf\">Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1488925800000,"title":"Matt Hardwick on Unsupervised Representation Learning"},"bzdctlyvmbjb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/233440211/","description":"<p>In 1985 Fischer, Lynch, and Paterson proved that consensus was impossible in a distributed system even if communication is perfectly reliable, if at most one process can fail, and if it can do so only by crashing. In 1991 Damien Hirst put a tiger shark in a steel tank filled with formaldehyde. I doubt these two things are related.</p> <p>Paper: <a href=\"http://macs.citadel.edu/rudolphg/csci604/ImpossibilityofConsensus.pdf\"><a href=\"http://macs.citadel.edu/rudolphg/csci604/ImpossibilityofConsensus.pdf\" class=\"linkified\">http://macs.citadel.edu/rudolphg/csci604/ImpossibilityofConsensus.pdf</a></a></p> <p>Noel Weichbrodt is a softwarerer at OpenTable and enjoys things that are unrelated.</p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1473197400000,"title":"Physical impossibility of consensus of death in the mind of someone faulty"},"gmtvslyvjbkb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/230869596/","description":"<p>Building robust systems is an important part of software engineering. For various reasons, it's rarer than it should be. How can we improve as engineers to provide robust systems in a fast-paced environment?</p> <p>The wizard himself, Gerald Sussman, explores this topic by exploring how biological systems maintain functionality under the constant assault of everyday life. <a href=\"https://groups.csail.mit.edu/mac/users/gjs/6.945/readings/robust-systems.pdf\">Building Robust Systems</a> promises to be an interesting dive into two seemingly disparate worlds.</p> <p>The entrance on Cherry Street will probably be locked by the time we get setup. We have several different avenues for contacting us on <a href=\"https://github.com/papers-we-love/chattanooga\">our PWL github</a> as well as being hooked into the Chadev slack. We'll also try and have someone at the door between 5:15 and 5:45 to let you in.</p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1465335000000,"title":"Neil Menne on Building Robust Systems"},"235597854":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/235597854/","description":"<p><b>Mind-reading for fun and profit</b></p> <p>Sometimes (believe it or not), dialogues actually involve two people working together to accomplish a shared goal. Inferring a detailed understanding of these dialogues is an important topic in natural language processing, but the concepts in play extend beyond the domain of explicit spoken or written exchanges. Come for the implicit promise of a fortune telling; stay for the Prolog!</p> <p><br/>Josh Ziegler is currently between jobs and might be convinced to mow your lawn for money.</p> <p><a href=\"https://researchspace.auckland.ac.nz/bitstream/handle/2292/24149/Langley.pdf?sequence=10\">Full paper</a> for those who are interested in diving in beforehand.</p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1481063400000,"title":"Josh Ziegler on Abductive Understanding of Dialogues..."},"233975419":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/233975419/","description":"<p>\"The devil is in the [implementation]\". In today's distributed system world of hip marketing and product-pushing companies with smooth-sounding tools digital solution descriptions are often a few sentences in a tweet or a simple proof on the back of a napkin. But are these candy-prescriptions actually easy to implement? This paper tells of the joys and fears confronted by the Google team who built Chubby, an implementation of Paxos.</p> <p>Jacob left the world of liberal arts at a mature age to follow the bread-crumb trail of programming theory. He cut his teeth on lisp dialects decades after they were forgotten, grew a large mustache to earn respect, and at one point thought all objects were immutable. Today he alternates between being lost in Clojure or in some new beer, and works for Opentable as a Software Engineer.</p> <p><a href=\"http://www.read.seas.harvard.edu/~kohler/class/08w-dsi/chandra07paxos.pdf\">Paxos Made Live Paper</a></p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1475616600000,"title":"Jacob Kobernik on Paxos Made Live"},"cbrmkpyxfbjb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/248197206/","description":"<p>*Paper*<br/>Dynamic Routing Between Capsules<br/>Sara Sabour, Nicholas Frosst, Geoffrey E Hinton<br/><a href=\"https://arxiv.org/abs/1710.09829\" class=\"linkified\">https://arxiv.org/abs/1710.09829</a></p> <p>*Description*<br/>Neural Nets used for computer vision typically contain many parameters that must be trained accurately. In this work, Sabour et. al. introduce a new approach that utilizes \"capsules\", or groups of neurons in a layer that work in concert, to restructure network activations as vectors rather than simple scalar values. The results of this new approach are remarkable, achieving state of the art performance on computer vision problems with much shallower neural networks and a fraction of the typical number of trained parameters.</p> <p>*Presenter Bio*<br/>Matt Hardwick is a software engineer with 10+ years of experience building systems ranging from military simulations to high-scale web applications. His interests lie in machine learning, computer perception and control systems, self-driving vehicles, and other similar real-world data science problems. Currently employed by Skuid in Chattanooga as a full-stack software engineer, he spends his day building systems to accelerate the development and deployment of enterprise-scale web applications.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1520375400000,"title":"Using Vectors to Reduce Neural Net Complexity"},"234756751":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/234756751/","description":"<p>Old ideas have a way of re-emerging in the field of computer science. One of these ideas that's coming back around is CQRS. The short version is that by separating the write responsibilities from the read responsibilities you can more accurately capture the domain model. Unsurprisingly, things like REST aren't very good at modeling the behaviors of a diverse set of behaviors/users.</p> <p>Neil Menne is an engineer at OpenTable who works on back end services. He likes to learn new things: technologies, patterns, languages.</p> <p>This paper is a lengthy one, so buckle your seatbelts. It's going to be a bumpy ride.</p> <p>The Paper: <a href=\"https://cqrs.files.wordpress.com/2010/11/cqrs_documents.pdf\">CQRS Documents</a></p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1478035800000,"title":"Neil Menne on CQRS"},"238807283":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/238807283/","description":"<p>Property testing has risen to popularity in the past years due to its ability to find edge cases and other hard to reproduce bugs. But for programmers new to property testing it can be difficult to see how to use property tests to exercise entire systems.</p> <p>In this paper we'll look at a real world use case for property tests and examine the tools and techniques used by the authors to find and reliably reproduce race conditions in a concurrent, distributed system.</p> <p>Chris is a software engineer building services and applications for Le Tote.  Although he started out writing C for embedded systems, these days he spends his time in Elixir, Haskell, Elm, and Rust.  When not writing code for work, Chris can be found writing code for fun, talking about the joys of functional programming, playing pinball, roasting coffee, or building lego with his kids.</p> <p><br/><a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.724.3518&amp;rep=rep1&amp;type=pdf\">Link to Paper</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1491341400000,"title":"Chris Keathley on Finding Race Conditions in Erlang with QuickCheck and PULSE"},"242993742":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/242993742/","description":"<p>Like Kay’s “Early History of Smalltalk” and Stoyan’s “Early LISP History”, Erlang creator Joe Armstrong delves into his personal archives and recounts the design decisions, people, failures, and culture that contextualize his language. Doing the right thing for the wrong reasons, which Armstrong calls luck, leads to the unwitting success of his language.</p> <p>Noel Weichbrodt is a softwarerer at Pylon and enjoys things that are unrelated.</p> <p>Paper: <a href=\"http://webcem01.cem.itesm.mx:8005/erlang/cd/downloads/hopl_erlang.pdf\">A History of Erlang</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1504647000000,"title":"Noel Weichbrodt on A History of Erlang"},"243650192":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/243650192/","description":"<p>With the popularity of Bitcoin on the rise, the underlying technology is being constantly explained as it is dissected and evolved. The term “blockchain” has necessarily become a complex and dense entity when explaining the mechanics of cryptocurrencies. Authors Akcora, Gel, and Kantarcioglu attempt to enlighten us by introducing the blockchain holistically and in a manner that doesn’t require prior knowledge of the underlying components. They cover history of the blockchain as well as practical operation and current shortcomings in various implementations.</p> <p><br/>Jacob Kobernik is backend Software Engineer at Skuid who likes to hang out with smart people in hopes that something rubs off. When he isn’t on a computer he likes to powerlift, ride motorcycles, and brew beer.</p> <p>\n\n\nPaper: <a href=\"https://arxiv.org/pdf/1708.08749.pdf\">Blockchain: A Graph Primer</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1507066200000,"title":"Jacob Kobernik on Blockchain: A Graph Primer"},"244515378":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/244515378/","description":"<p>Following close on the heels of Jacob Kobernik’s thorough investigation of bitcoin, we will review the Zerocash whitepaper which picks up where all the anonymity concerns of bitcoin left off. Zerocash “provides a full-fledged ledger-based digital currency with strong privacy guarantees” by leveraging recent advancements in the zero-knowledge Succinct Non-interactive ARguments of Knowledge (ZKSNARKs). This paper leads with a high level review of the shortcomings of bitcoin, investigates some alternatives utilizing the mixers and the Zerocoin protocol and then dives deep into the formulation and creation of Zerocash and ZKSNARKs.</p> <p>Bill Brock is the head of delivery at Very, a Chattanooga based web and mobile consultancy. At Very, he runs the gamut from product management to sales with a smattering of utilitarian hacking. Lately Bill has fully fallen prey to the blockchain hype and planning to launch an ICO in early 2018 to to fund the brockchain: skynet V0.1</p> <p>Link to Paper: <a href=\"http://zerocash-project.org/media/pdf/zerocash-oakland2014.pdf\">Zerocash Paper</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1510093800000,"title":"Bill Brock on Zerocash: Decentralized Anonymous Payments from Bitcoin"},"bzdctlyvkbhb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/231948068/","description":"<p>In <a href=\"http://okmij.org/ftp/Computation/Subtyping/\">Subtyping vs. Subclassing</a>, Oleg Kiselyov addresses the separation of interface and implementation. The first section shows that in good object oriented design, the type system can't be used in general to decide whether implementations can be safely substituted for one another. In <a href=\"http://okmij.org/ftp/Computation/Subtyping/Preventing-Trouble.html\">Preventing Trouble</a>, he outlines a set of rules (in C++) that do allow the type system to enforce subtype relationships, and that look suspiciously familiar.</p> <p>Lang Martin is a Principal Software Engineer at OpenTable and renown thought-leader in the hand gesture space.</p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1467756000000,"title":"Lang Martin on Subtyping, Subclassing, and Trouble with OOP"},"gmtvslyvhbfb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/230675662/","description":"<p><b>Noel Weichbrodt</b> will summarize a recent paper that appeared in the ACM Queue, <a href=\"https://queue.acm.org/detail.cfm?id=2903468\"><b>\"Statistics for Engineers\"</b></a> by Heinrich Hartmann. \"Statistics for Engineers\" surveys common statistical techniques for extracting useful, actionable information from the engineering data we regularly generate and encounter.</p> <p><b>About the Author:</b></p> <p><b>Heinrich Hartmann</b> is chief data scientist for Circonus. He earned his PhD in pure mathematics from the University of Bonn (Germany) on geometric aspects of string theory and worked as a researcher for the University of Oxford (UK) afterwards. In 2012 he transitioned into computer science and worked as an independent consultant for a number of different companies and research institutions. He is now leading the development of data analytics for the Circonus monitoring product.</p> <p>\n\n\n<b>About the Presenter:</b></p> <p><b>Noel Weichbrodt</b> is a software engineer at OpenTable, working on distributed systems that power great dining experiences. </p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1462311000000,"title":"Inaugural PWL!"},"bzdctlyvlbdb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/230880604/","description":"<p>Collecting real-time metrics like request latency is a critical part of production support. While it is easy to aggregate summary statistics like count, mean, and range, they are often a poor representation of actual service performance. This paper [1] describes a data structure that efficiently and accurately represents a histogram, which can be used to monitor and alert on quantile metrics (median, 99th percentile, etc.) in real time and constant space.</p> <p><br/>Brent Spell is a programmer at OpenTable in Chattanooga, where he works on infrastructure for distributed systems and machine learning applications for restaurants.</p> <p>\n\n\n[1]: <a href=\"https://github.com/tdunning/t-digest/blob/master/docs/t-digest-paper/histo.pdf\">Computing Extremely Accurate Quantiles Using t-Digests</a></p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1470173400000,"title":"Brent Spell on Computing Extremely Accurate Quantiles Using t-Digests"},"236484022":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/236484022/","description":"<p>Much AI/ML research focuses on building systems that excel in a narrow area (image recognition, planning, motor control, NLP).  While there is tremendous benefit there, it's also interesting to consider building autonomous agents which combine multiple subsystems (NLP, Planning, etc).</p> <p>Josh Marlow is a startup-addict. He's a python web-app engineer by day, and a functional programmer by night.</p> <p><a href=\"http://dl.acm.org/citation.cfm?id=91035\">A Basic Agent Paper</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1484087400000,"title":"Josh Marlow on A Basic Agent"},"237376175":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/237376175/","description":"<p>Recent advances in AI have yielded some impressive results. The use of deep neural networks in particular have led to astounding gains; machines have now approached or surpassed human ability at tasks such as object recognition, video games, and board games.</p> <p>Despite their biological inspiration and performance achievements, these systems differ from human intelligence in crucial ways. Humans still excel at learning quickly from only a handful of examples, and applying knowledge to novel situations.</p> <p>Can reverse engineering human intelligence usefully inform AI and machine learning? The authors believe so, and offer a set of core ingredients that could pave the way for even more human-like, and powerful, AI.</p> <p>Stephen Spalding is a technologist, cyclist, and Chattanooga native. Over his professional career, he’s enjoyed working with 3d x-ray machines at GE Healthcare, nuclear reactors at TVA, Clojure services at OpenTable, and serving tables at Boathouse Rotisserie. Recently, he has joined the engineering team at Netflix to help deliver continuous streams of entertainment for more compliant humans, amenable to our robot overlords.</p> <p>\n\n\n\n<b>LINK TO PAPER: <a href=\"https://arxiv.org/pdf/1604.00289v3.pdf\">Building Machines That Think and Learn Like People</a></b></p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1486506600000,"title":"Stephen Spalding on Building Machines That Think and Learn Like People"}}