{"255611334":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/255611334/","description":"<p>Full Title: Transparency by Design: Closing the Gap Between Performance and<br/>Interpretability in Visual Reasoning</p> <p>Link: <a href=\"http://openaccess.thecvf.com/content_cvpr_2018/papers/Mascharka_Transparency_by_Design_CVPR_2018_paper.pdf\" class=\"linkified\">http://openaccess.thecvf.com/content_cvpr_2018/papers/Mascharka_Transparency_by_Design_CVPR_2018_paper.pdf</a></p> <p>Description: Visual question answering and neural module networks aren’t new concepts, but researchers at MIT and Planck have combined the two in a way that would make James Mickens proud. Just kidding—nothing will make James Mickens proud.</p> <p>Bio: Joshua Ziegler is Pylon's one and only Conversation Engineer. As a YAML enthusiast and Pythonista, Joshua spends his waking hours devising conversations that are sure to delight (or possibly torment) users everywhere.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1541543400000,"title":"Joshua Ziegler on Transparency by Design"},"239510839":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/239510839/","description":"<p>Paper: <br/><a href=\"http://www.exp-platform.com/Documents/puzzlingOutcomesInControlledExperiments.pdf\"><a href=\"http://www.exp-platform.com/Documents/puzzlingOutcomesInControlledExperiments.pdf\" class=\"linkified\">http://www.exp-platform.com/Documents/puzzlingOutcomesInControlledExperiments.pdf</a></a></p> <p>Summary: <br/>Designing experiments for the web is hard. Making sound business decisions without validation is even harder. This paper looks at experiments that had confusing/misleading/puzzling results. We’ll deconstruct the experiments and the relevant terminology in order to craft better experiences ourselves.</p> <p>Bio:<br/>Neil Menne is an engineer at Pylon ai where he has been working on how to manage experiments in conversational experiences and other fun, interesting things.</p> <p>Also:<br/>this is a good way</p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1493760600000,"title":"Neil Menne on Trustworthy Online Controlled Experiments: Five Puzzling Outcomes"},"264429321":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/264429321/","description":"<p>Publications We Love: A Philosophy of Software Design</p> <p>A small book with an outsized impact since it’s publishing, PoSD fundamentally addresses how to manage complexity. Drawing from both deep industry and academic experience, John Ousterhout of Stanford (and the TCL language) distills design principles into pithy commands. We’ll compare his principles with our own experiences, and also with Ousterhout’s other statements on these subjects (containing vital background to understanding how he arrived at the PoSD principles).</p> <p>Bio: Noel Weichbrodt's third eye, the all-seeing eye of Pylon ai, Inc., has been opened (by James Mickens' Usenix '18 talk no less) for over a year now.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1567546200000,"title":"Noel Weichbrodt on Publications We Love: A Philosophy of Software Design"},"256842203":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/256842203/","description":"<p>We're bringing back an old holiday tradition, the show-and-tell language battle! Solve any or all of the four very simple problems in the shootout repo (<a href=\"https://github.com/papers-we-love/chattanooga/tree/master/shootout\" class=\"linkified\">https://github.com/papers-we-love/chattanooga/tree/master/shootout</a>) with your languge of choice, send a PR, and then show up with your running solution(s)!</p> <p>Nota Bene: you will need to sign an NDA for our Skuid hosts. TL;DR: \"If, while in the Skuid office, you learn anything about Skuid that you didn't already know through public disclosure or general knowledge, you are not allowed to share that information. Also, don't steal our software.\"</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1543962600000,"title":"Holiday Language Buffet"},"269014590":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/269014590/","description":"<p>Link: <a href=\"https://www.ericsson.com/4af00f/assets/local/reports-papers/research-papers/host_identity_protocol_connectivity_multi-homing_security_and_privacy_over_ipv4_and_ipv6_networks.pdf\" class=\"linkified\">https://www.ericsson.com/4af00f/assets/local/reports-papers/research-papers/host_identity_protocol_connectivity_multi-homing_security_and_privacy_over_ipv4_and_ipv6_networks.pdf</a></p> <p>Description: The Host Identity Protocol (HIP) is an inter-networking architecture and an associated set of protocols. HIP enhances the original Internet architecture by adding a name space used between the IP layer and the transport protocols. This new name space consists of cryptographic identifiers, thereby implementing the so-called identifier/locator split. Mobility, multi-homing, and baseline end-to-end security integrate neatly into the new architecture. The use of cryptographic identifiers allows enhanced accountability, thereby providing a base for easier build up of trust. With privacy enhancements, HIP allows good location anonymity, assuring strong identity only towards relevant trusted parties. This article provides an in-depth look at HIP, discussing its architecture, design, benefits, potential drawbacks, and ongoing work.</p> <p>Bio: Andrew Rodgers is a medium data expert, with expensive experience deploying and managing edge and IoT systems who is very excited for yet another DNS to blame.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1583274600000,"title":"Andrew Rodgers on Host Identity Protocol"},"247388086":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/247388086/","description":"<p>• What we'll do<br/>Zero-knowledge proofs, specifically zkSNARKs, are an interesting and powerful method for encryption whose use has recently risen due to their applications in cryptocurrencies. Following up on his November overview of Zcash and by popular demand, Bill will lead us on a more in-depth look at these methodologies and how to understand them in laymen's terms.</p> <p>Bill Brock is the head of delivery at Very, a Chattanooga based web and mobile consultancy. At Very, he runs the gamut from product management to sales with a smattering of utilitarian hacking. Lately Bill has fully fallen prey to the blockchain hype and planning to launch an ICO in early 2018 to to fund the brockchain: skynet V0.1</p> <p>Link to paper: <a href=\"http://chriseth.github.io/notes/articles/zksnarks/zksnarks.pdf\" class=\"linkified\">http://chriseth.github.io/notes/articles/zksnarks/zksnarks.pdf</a></p> <p>• What to bring</p> <p>• Important to know</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1517956200000,"title":"Bill Brock on zkSNARKs in a Nutshell"},"266842122":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/266842122/","description":"<p>Bring in the Advent of Code season with a community language shootout! Participation with just three simple steps:<br/>1. Solve Days 1 &amp; 2 of Advent of Code with your language of choice<br/>2. Send a PR to <a href=\"https://github.com/papers-we-love/chattanooga/tree/master/shootout\" class=\"linkified\">https://github.com/papers-we-love/chattanooga/tree/master/shootout</a><br/>3. Show up with your running solution(s)!</p> <p>AoC Day 3 is a bonus, and the more obscure/obtuse your language the better! Yes, that means you, Java.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1575412200000,"title":"Advent of Code (aka Language Shootout)"},"259907884":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/259907884/","description":"<p>Full Title: Pixie: A System for Recommending 3+ Billion Items to<br/>200+ Million Users in Real-Time</p> <p>Link: <a href=\"https://arxiv.org/pdf/1711.07601.pdf\" class=\"linkified\">https://arxiv.org/pdf/1711.07601.pdf</a></p> <p>Description: Pixie is a novel graph-based recommender system developed at Pinterest for recommending new pins/boards to a user based on history and interest. The abstract algorithm is presented, along with a detailed description of the engineering challenges, tradeoffs, and optimizations considered in its implementation.</p> <p>Speaker Bio: Brent Spell is the CTO of Pylon ai, Inc., a voicestuff company. His interests include long experiment runs in a Jupyter notebook, installing GPUs, and reading new things in order to forget old things.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1554240600000,"title":"Brent Spell on Pixie: A System for Recommending 3+ Billion Items..."},"261833661":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/261833661/","description":"<p>Link to Paper: <a href=\"https://arxiv.org/abs/1901.04407\" class=\"linkified\">https://arxiv.org/abs/1901.04407</a></p> <p>About the Paper: An exploration of recent works in self-driving vehicles with emphasis on the technologies that enable autonomous actions.</p> <p>Bio: Will is a recent MSCS grad and a member of the engineering team at Pylon. His academic work focused on applications of generative models and object detection in subsurface imaging. In industry, he focuses on TTS, NLP, and Recommendation Systems.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1559683800000,"title":"Will Rice on Self-Driving Cars: A Survey"},"240378747":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/240378747/","description":"<p>This paper attempts to set the epistemology of machine intelligence by exploring the relationships between various components such as unintelligent machine characteristics, intelligent characteristics, classification of intelligence, and more. </p> <p>Derik is a native Chattanoogan working as an engineer at Emma Email Marketing writing mostly Python, and as little JavaScript as he can get away with.</p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1496784600000,"title":"Derik Pell on Elementary Epistemological Features of Machine Intelligence"},"262707246":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/262707246/","description":"<p>Link to paper: <a href=\"https://raft.github.io/raft.pdf\" class=\"linkified\">https://raft.github.io/raft.pdf</a></p> <p>Description: Raft is a consensus algorithm for managing a replicated log. It has a lot in common with Multi-Paxos, but the authors emphasize teachability. Additionally, they detail a number of cases that would otherwise only be discovered during implementation. To further motivate and differentiate this talk, Chris will be talking about some of the prior art as well as his own experience building a Raft implementation.</p> <p>Bio: Chris is a software engineer building services and applications for Bleacher Report. Although he started out writing C for embedded systems, these days he spends his time in Elixir, Go, and Rust. When not writing code for work, Chris can be found writing code for fun, talking about the joys of functional programming, playing pinball, roasting coffee, or building lego with his kids.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1562103000000,"title":"Chris Keathley on In Search of an Understandable Consensus Algorithm"},"251202991":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/251202991/","description":"<p>Full paper title: Unsupervised anomaly detection via variational auto-encoder for seasonal KPIs in web applications</p> <p>Description: Anomaly detection for web applications is a challenging but important use of resources. Complicating the matter further, a lot of training data is either unlabeled or missing examples of the anomalies they're trying to prevent. This paper looks to push the state of the art forward by using a few new techniques together against seasonal KPIs.</p> <p>Bio: Neil works at Pylon ai as an Analytics Engineer (a term which here means interactor with logs and metrics). He aspires to one day use some of the concepts presented here; similar techniques would also be acceptable.</p> <p>Paper: <a href=\"https://dl.acm.org/citation.cfm?id=3185996\" class=\"linkified\">https://dl.acm.org/citation.cfm?id=3185996</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1528234200000,"title":"Neil Menne on Unsupervised Anomaly Detection via Variational Auto-Encoders"},"245517172":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/245517172/","description":"<p>Challenging Neural Dialogue Models with Natural Data: Memory Networks Fail on Incremental Phenomena</p> <p><a href=\"https://arxiv.org/abs/1709.07840\"><a href=\"https://arxiv.org/abs/1709.07840\" class=\"linkified\">https://arxiv.org/abs/1709.07840</a></a></p> <p>Neural networks are, in the immortal words of Mugatu, “so hot right now”. In the frenzied attempt to apply them to every known problem from image processing to NLP, very few people (or at least very few papers) stop to ask the question, “Is this really the right tool for the job?” This, as you may have guessed, is one of the few papers that does.</p> <p>About the Presenter:</p> <p>Josh Ziegler is a Principal Software Engineer at Pylon ai, a pronounced logophile, and co-hosts The Screeners podcast when he's not listening to Lana Del Rey.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1512513000000,"title":"Challenging Neural Dialogue Models with Natural Data"},"241799114":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/241799114/","description":"<p>Reinforcement Learning is a sixty year old AI discipline that attempts to mimic human learning through actions and rewards. This is a paper written by the team at DeepMind and is one of the reasons Google bought their company for $500M. A variant of this algorithm was used in the AlphaGo program that beat Lee Sedol in 2016.</p> <p>Brent Spell is a programmer at Pylon ai, Inc. and is interested in distributed systems and machine learning.</p> <p>Paper: <a href=\"https://arxiv.org/pdf/1312.5602v1.pdf\">Playing Atari with Deep Reinforcement Learning</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1502227800000,"title":"Brent Spell on Playing Atari with Deep Reinforcement Learning"},"237702021":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/237702021/","description":"<p>In recent years, supervised learning with convolutional neural networks (CNNs) has seen huge adoption in computer vision applications. Comparatively, unsupervised learning with CNNs has received less attention. In this work, the authors attempt to bridge the gap between supervised learning and unsupervised learning using CNNs.</p> <p>This paper introduces the concept of DCGANs, which are neural networks that are trained to distinguish interesting structures and meaning from raw image data by competing with one another. In particular, the networks that are presented appear to be a strong candidate set for unsupervised learning of features for use in realistic image generation.&gt;&gt;We’ll explore convincing evidence that the DCGAN pair used here learns a hierarchical representation of the features held within images ranging from objects to entire scenes. Additionally, we’ll explore the use of these learned features for novel tasks - demonstrating their applicability as generic image representations.</p> <p>Matt Hardwick is a software engineer with 10+ years of experience creating software systems in various industries, including defense simulations and web-based applications. He currently leads an engineering team at Bellhops using technology to improve the way that people move from place to place. His recent software interests are Machine Learning and Elixir.</p> <p>Paper: <a href=\"https://arxiv.org/pdf/1511.06434v2.pdf\">Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1488925800000,"title":"Matt Hardwick on Unsupervised Representation Learning"},"bzdctlyvmbjb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/bzdctlyvmbjb/","description":"<p>In 1985 Fischer, Lynch, and Paterson proved that consensus was impossible in a distributed system even if communication is perfectly reliable, if at most one process can fail, and if it can do so only by crashing. In 1991 Damien Hirst put a tiger shark in a steel tank filled with formaldehyde. I doubt these two things are related.</p> <p>Paper: <a href=\"http://macs.citadel.edu/rudolphg/csci604/ImpossibilityofConsensus.pdf\"><a href=\"http://macs.citadel.edu/rudolphg/csci604/ImpossibilityofConsensus.pdf\" class=\"linkified\">http://macs.citadel.edu/rudolphg/csci604/ImpossibilityofConsensus.pdf</a></a></p> <p>Noel Weichbrodt is a softwarerer at OpenTable and enjoys things that are unrelated.</p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1473197400000,"title":"Physical impossibility of consensus of death in the mind of someone faulty"},"gmtvslyvjbkb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/gmtvslyvjbkb/","description":"<p>Building robust systems is an important part of software engineering. For various reasons, it's rarer than it should be. How can we improve as engineers to provide robust systems in a fast-paced environment?</p> <p>The wizard himself, Gerald Sussman, explores this topic by exploring how biological systems maintain functionality under the constant assault of everyday life. <a href=\"https://groups.csail.mit.edu/mac/users/gjs/6.945/readings/robust-systems.pdf\">Building Robust Systems</a> promises to be an interesting dive into two seemingly disparate worlds.</p> <p>The entrance on Cherry Street will probably be locked by the time we get setup. We have several different avenues for contacting us on <a href=\"https://github.com/papers-we-love/chattanooga\">our PWL github</a> as well as being hooked into the Chadev slack. We'll also try and have someone at the door between 5:15 and 5:45 to let you in.</p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1465335000000,"title":"Neil Menne on Building Robust Systems"},"235597854":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/235597854/","description":"<p><b>Mind-reading for fun and profit</b></p> <p>Sometimes (believe it or not), dialogues actually involve two people working together to accomplish a shared goal. Inferring a detailed understanding of these dialogues is an important topic in natural language processing, but the concepts in play extend beyond the domain of explicit spoken or written exchanges. Come for the implicit promise of a fortune telling; stay for the Prolog!</p> <p>Josh Ziegler is currently between jobs and might be convinced to mow your lawn for money.</p> <p><a href=\"https://researchspace.auckland.ac.nz/bitstream/handle/2292/24149/Langley.pdf?sequence=10\">Full paper</a> for those who are interested in diving in beforehand.</p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1481063400000,"title":"Josh Ziegler on Abductive Understanding of Dialogues..."},"273631683":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/273631683/","description":"<p>Link to Paper: <a href=\"https://www.maa.org/external_archive/devlin/LockhartsLament.pdf\" class=\"linkified\">https://www.maa.org/external_archive/devlin/LockhartsLament.pdf</a></p> <p>Description: “So let me try to explain what mathematics is, and what mathematicians do.” So begins the photocopied rant on intuitionism in mathematics education by a college dropout. Passed around at conferences, the rant is eventually published as a column by the Mathematical Association of America, and then as a book. The range of the rant is as wide and wild as the author: Paul Lockhart became interested in mathematics when he was 14 (outside of the school math class, he points out) and read voraciously, becoming especially interested in analytic number theory. He dropped out of college after one semester to devote himself to math, supporting himself by working as a computer programmer and as an elementary school teacher. Eventually he started working with Ernst Strauss at UCLA, and the two published a few papers together. Strauss introduced him to Paul Erdos, and they somehow arranged it so that he became a graduate student there. He ended up getting a Ph.D. from Columbia in 1990, and went on to be a fellow at MSRI and an assistant professor at Brown. He also taught at UC Santa Cruz. Since then he has taught math at Saint Ann’s School in Brooklyn, New York City. His main research interests are automorphic forms and Diophantine geometry.</p> <p>Speaker Bio: Noel is an unusually Swift, Principled Engineer with ostensibly inscrutable hair trying to get people to talk to their computers in an increasingly less scrutable world.</p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":"Online event","postalCode":null,"lon":null,"country":"","city":false},"utcOffset":-14400000,"time":1602019800000,"title":"Noel Weichbrodt on A Mathematician’s Lament"},"274108432":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/274108432/","description":"<p>Link: <a href=\"https://arxiv.org/abs/2004.10151\" class=\"linkified\">https://arxiv.org/abs/2004.10151</a></p> <p>Description: The hype machine programmed to make NLP a household term is busy earning its keep. Whether they’re boiling oceans to write people’s Medium posts for them or to produce almost certainly useless React code, giant language models are what all the cool kids are using. As you might expect, we’re going to be talking about why maybe everyone shouldn’t be quite so excited just yet, and we’ll discuss a couple ideas for improving the state of the art.</p> <p>Speaker Bio: Joshua Ziegler is principal computational linguist at Spokestack, where he dies a little inside each time he reads the phrase “natural language understanding” in a paper about voice assistants. One day he will have his revenge.</p> <p>NOTE: Due to this being election night, we might end up delaying until 11/10 if scheduling conflicts occur.</p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":"Online event","postalCode":null,"lon":null,"country":"","city":false},"utcOffset":-18000000,"time":1604442600000,"title":"Joshua Ziegler on Experience Grounds Language"},"261138394":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/261138394/","description":"<p>Link to Paper: <a href=\"http://asc.di.fct.unl.pt/~jleitao/pdf/dsn07-leitao.pdf\" class=\"linkified\">http://asc.di.fct.unl.pt/~jleitao/pdf/dsn07-leitao.pdf</a></p> <p>About the Paper: Gossip based protocols are great for sharing information across large networks. A naive approach to gossip relies on broadcasting new messages to all nodes from the node who learned it; since this obviously doesn't scale well, partial views are the answer. HyParView is one such partial view algorithm. We'll look at what makes it different and how it can help improve the resiliency of the gossip protocol.</p> <p>Bio: Neil is an engineer at Pylon with some particular title that varies based on who you ask or where you look. He focuses on services in Elixir with the promise to one day do something interesting.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1557264600000,"title":"Neil Menne on HyParView"},"266028254":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/266028254/","description":"<p>Whether you’re detecting hot dogs or hotel reservations, deep learning is all the rage. When you pull back that pretty curtain made of pure math, though, guess what you find? That’s right: people. Lazy, unkempt, indecisive people, just waiting to make your beautiful functions useless. Join us as we explore the state of the art in machines not really learning what we think they’re learning, probably because of something we did.</p> <p>This talk is more of a survey than a deep dive into a single paper, but a couple papers that go into detail on some methods we’ll explore toward the end of the talk (spoiler alert) are:<br/>- Unmasking Clever Hans Predictors and Assessing What Machines Really Learn: <a href=\"https://arxiv.org/pdf/1902.10178.pdf\" class=\"linkified\">https://arxiv.org/pdf/1902.10178.pdf</a><br/>- AllenNLP Interpret: A Framework for Explaining Predictions of NLP Models: <a href=\"https://arxiv.org/pdf/1909.09251.pdf\" class=\"linkified\">https://arxiv.org/pdf/1909.09251.pdf</a></p> <p>Josh Ziegler fancies himself to be something other than a YAML engineer at Pylon. He spends his days eating peanuts and throwing the shells at ML researchers whose papers he’s reading.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1572993000000,"title":"Josh Ziegler on What Stands in the Way of the Robot Revolution?"},"265170390":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/265170390/","description":"<p>Distributed consensus, the ability to reach agreement in the face of failures and asynchrony, is a fundamental and powerful primitive for constructing reliable distributed systems from unreliable components. For over two decades, the Paxos algorithm has been synonymous with distributed consensus. Paxos is widely deployed in production systems, yet it is poorly understood and it proves to be heavyweight, unscalable and unreliable in practice.</p> <p>In this talk, we re-examine the foundations of how Paxos solves distributed consensus. Our hypothesis is that these limitations are not inherent to the problem of consensus but instead specific to the approach of Paxos. The surprising result of our analysis is a substantial weakening to the requirements of this widely studied algorithm. Building on this insight, we are able to prove an extensive generalization over the Paxos algorithm.</p> <p><a href=\"https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-935.pdf\" class=\"linkified\">https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-935.pdf</a></p> <p>Biography<br/>----------------</p> <p>Dr. Heidi Howard is a research fellow based at Cambridge University’s Department of Computer Science and Technology. Heidi’s research focuses on improving consistency, reliability and performance in distributed systems. Heidi received her BA in Computer Science from Cambridge University in 2014.</p> <p>In 2019, Heidi received her PhD from Cambridge University for her research on distributed consensus. Heidi is probably most widely known for her generalizations of the widely used Paxos algorithm for solving consensus, including her work on Flexible Paxos.<br/>Twitter: <a href=\"https://twitter.com/heidiann360\" class=\"linkified\">https://twitter.com/heidiann360</a><br/>Site: <a href=\"http://heidihoward.co.uk\" class=\"linkified\">http://heidihoward.co.uk</a></p> <p>(Nota bene this is a video talk due to a scheduling conflict)</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1569965400000,"title":"Distributed Consensus Revised by Heidi Howard"},"267428622":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/267428622/","description":"<p>Link: <a href=\"https://people.cs.umass.edu/~yanlei/courses/CS691LL-f06/papers/SH05.pdf\" class=\"linkified\">https://people.cs.umass.edu/~yanlei/courses/CS691LL-f06/papers/SH05.pdf</a></p> <p>Description: This paper provides a summary of 35 years of data model proposals, grouped into 9 different eras. We discuss the proposals of each era, and show that there are only a few basic data modeling ideas, and most have been around a long time. Hence, the purpose of this paper is to summarize 35 years worth of “progress” and point out what should be learned from this lengthy exercise.</p> <p>Bio: Lang is a Senior Engineer at Hashicorp where he orchestrates<br/>containers and sometimes tries to float rafts. Reluctant gopher,<br/>seasoned schemer, distributed systems dweeb.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1580855400000,"title":"Lang Martin on What Goes Around Comes Around"},"272250733":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/272250733/","description":"<p>Full Paper Title: An Algorithm for the Machine Calculation of Complex Fourier Series</p> <p>Link: <a href=\"https://www.ams.org/journals/mcom/1965-19-090/S0025-5718-1965-0178586-1/S0025-5718-1965-0178586-1.pdf\" class=\"linkified\">https://www.ams.org/journals/mcom/1965-19-090/S0025-5718-1965-0178586-1/S0025-5718-1965-0178586-1.pdf</a></p> <p>Bio: Brent is the chief technology officer of Spokestack. When he isn't working on machine learning systems for speech, he can be found reading papers, building prototypes, and curating the best memes the internet has to offer.</p> <p>This will be the first of our socially distant PWL meetups, so a special thanks to Brent for leading the charge.</p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":"Online event","postalCode":null,"lon":null,"country":"","city":false},"utcOffset":-14400000,"time":1596576600000,"title":"Brent Spell on An Algorithm for the Machine Calculation of Complex Fourier..."},"233975419":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/233975419/","description":"<p>\"The devil is in the [implementation]\". In today's distributed system world of hip marketing and product-pushing companies with smooth-sounding tools digital solution descriptions are often a few sentences in a tweet or a simple proof on the back of a napkin. But are these candy-prescriptions actually easy to implement? This paper tells of the joys and fears confronted by the Google team who built Chubby, an implementation of Paxos.</p> <p>Jacob left the world of liberal arts at a mature age to follow the bread-crumb trail of programming theory. He cut his teeth on lisp dialects decades after they were forgotten, grew a large mustache to earn respect, and at one point thought all objects were immutable. Today he alternates between being lost in Clojure or in some new beer, and works for Opentable as a Software Engineer.</p> <p><a href=\"http://www.read.seas.harvard.edu/~kohler/class/08w-dsi/chandra07paxos.pdf\">Paxos Made Live Paper</a></p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1475616600000,"title":"Jacob Kobernik on Paxos Made Live"},"cbrmkpyxfbjb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/cbrmkpyxfbjb/","description":"<p>*Paper*<br/>Dynamic Routing Between Capsules<br/>Sara Sabour, Nicholas Frosst, Geoffrey E Hinton<br/><a href=\"https://arxiv.org/abs/1710.09829\" class=\"linkified\">https://arxiv.org/abs/1710.09829</a></p> <p>*Description*<br/>Neural Nets used for computer vision typically contain many parameters that must be trained accurately. In this work, Sabour et. al. introduce a new approach that utilizes \"capsules\", or groups of neurons in a layer that work in concert, to restructure network activations as vectors rather than simple scalar values. The results of this new approach are remarkable, achieving state of the art performance on computer vision problems with much shallower neural networks and a fraction of the typical number of trained parameters.</p> <p>*Presenter Bio*<br/>Matt Hardwick is a software engineer with 10+ years of experience building systems ranging from military simulations to high-scale web applications. His interests lie in machine learning, computer perception and control systems, self-driving vehicles, and other similar real-world data science problems. Currently employed by Skuid in Chattanooga as a full-stack software engineer, he spends his day building systems to accelerate the development and deployment of enterprise-scale web applications.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1520375400000,"title":"Using Vectors to Reduce Neural Net Complexity"},"234756751":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/234756751/","description":"<p>Old ideas have a way of re-emerging in the field of computer science. One of these ideas that's coming back around is CQRS. The short version is that by separating the write responsibilities from the read responsibilities you can more accurately capture the domain model. Unsurprisingly, things like REST aren't very good at modeling the behaviors of a diverse set of behaviors/users.</p> <p>Neil Menne is an engineer at OpenTable who works on back end services. He likes to learn new things: technologies, patterns, languages.</p> <p>This paper is a lengthy one, so buckle your seatbelts. It's going to be a bumpy ride.</p> <p>The Paper: <a href=\"https://cqrs.files.wordpress.com/2010/11/cqrs_documents.pdf\">CQRS Documents</a></p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1478035800000,"title":"Neil Menne on CQRS"},"238807283":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/238807283/","description":"<p>Property testing has risen to popularity in the past years due to its ability to find edge cases and other hard to reproduce bugs. But for programmers new to property testing it can be difficult to see how to use property tests to exercise entire systems.</p> <p>In this paper we'll look at a real world use case for property tests and examine the tools and techniques used by the authors to find and reliably reproduce race conditions in a concurrent, distributed system.</p> <p>Chris is a software engineer building services and applications for Le Tote.  Although he started out writing C for embedded systems, these days he spends his time in Elixir, Haskell, Elm, and Rust.  When not writing code for work, Chris can be found writing code for fun, talking about the joys of functional programming, playing pinball, roasting coffee, or building lego with his kids.</p> <p><a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.724.3518&amp;rep=rep1&amp;type=pdf\">Link to Paper</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1491341400000,"title":"Chris Keathley on Finding Race Conditions in Erlang with QuickCheck and PULSE"},"242993742":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/242993742/","description":"<p>Like Kay’s “Early History of Smalltalk” and Stoyan’s “Early LISP History”, Erlang creator Joe Armstrong delves into his personal archives and recounts the design decisions, people, failures, and culture that contextualize his language. Doing the right thing for the wrong reasons, which Armstrong calls luck, leads to the unwitting success of his language.</p> <p>Noel Weichbrodt is a softwarerer at Pylon and enjoys things that are unrelated.</p> <p>Paper: <a href=\"http://webcem01.cem.itesm.mx:8005/erlang/cd/downloads/hopl_erlang.pdf\">A History of Erlang</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1504647000000,"title":"Noel Weichbrodt on A History of Erlang"},"253310110":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/253310110/","description":"<p>Full Title: New Directions in Cryptography by Whitfield Diffie and Martin E. Hellman<br/>Link: <a href=\"https://ee.stanford.edu/~hellman/publications/24.pdf\" class=\"linkified\">https://ee.stanford.edu/~hellman/publications/24.pdf</a><br/>Description:<br/>This is the classic paper by Diffie and Hellman that made public the concept of asymmetric cryptography. The paper’s impact is difficult to overstate because its ideas lay the foundation of trust on the internet. We’ll discuss the history and context of the paper and walk through a simple implementation of a public key cryptosystem.</p> <p>Bio:<br/>Brent Spell is CTO of Pylon ai and a David Attenborough enthusiast.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1533677400000,"title":"Brent Spell on New Directions in Cryptography"},"243650192":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/243650192/","description":"<p>With the popularity of Bitcoin on the rise, the underlying technology is being constantly explained as it is dissected and evolved. The term “blockchain” has necessarily become a complex and dense entity when explaining the mechanics of cryptocurrencies. Authors Akcora, Gel, and Kantarcioglu attempt to enlighten us by introducing the blockchain holistically and in a manner that doesn’t require prior knowledge of the underlying components. They cover history of the blockchain as well as practical operation and current shortcomings in various implementations.</p> <p>Jacob Kobernik is backend Software Engineer at Skuid who likes to hang out with smart people in hopes that something rubs off. When he isn’t on a computer he likes to powerlift, ride motorcycles, and brew beer.</p> <p>Paper: <a href=\"https://arxiv.org/pdf/1708.08749.pdf\">Blockchain: A Graph Primer</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1507066200000,"title":"Jacob Kobernik on Blockchain: A Graph Primer"},"273047281":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/273047281/","description":"<p>Link to Paper: <a href=\"https://raw.githubusercontent.com/jepsen-io/elle/master/paper/elle.pdf\" class=\"linkified\">https://raw.githubusercontent.com/jepsen-io/elle/master/paper/elle.pdf</a></p> <p>Description: Starting with a level of snark we've come to know and love from the authors, Elle proposes a powerful, sound model of anomaly detection. This is accomplished by relating strict formalisms to weaker client-side observations, graphviz, and parentheses.</p> <p>Speaker Bio: Neil is a Senior Backend Engineer Level I at Bleacher Report. When he is not keeping sports on the internet, he can be found wallowing in existential dread, reading papers such as this, and pining for sense data that is actually useful for his problems (both real and imaginary).</p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":"Online event","postalCode":null,"lon":null,"country":"","city":false},"utcOffset":-14400000,"time":1599600600000,"title":"Neil Menne on Elle: Inferring Isolation Anomalies from Experimental Observations"},"244515378":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/244515378/","description":"<p>Following close on the heels of Jacob Kobernik’s thorough investigation of bitcoin, we will review the Zerocash whitepaper which picks up where all the anonymity concerns of bitcoin left off. Zerocash “provides a full-fledged ledger-based digital currency with strong privacy guarantees” by leveraging recent advancements in the zero-knowledge Succinct Non-interactive ARguments of Knowledge (ZKSNARKs). This paper leads with a high level review of the shortcomings of bitcoin, investigates some alternatives utilizing the mixers and the Zerocoin protocol and then dives deep into the formulation and creation of Zerocash and ZKSNARKs.</p> <p>Bill Brock is the head of delivery at Very, a Chattanooga based web and mobile consultancy. At Very, he runs the gamut from product management to sales with a smattering of utilitarian hacking. Lately Bill has fully fallen prey to the blockchain hype and planning to launch an ICO in early 2018 to to fund the brockchain: skynet V0.1</p> <p>Link to Paper: <a href=\"http://zerocash-project.org/media/pdf/zerocash-oakland2014.pdf\">Zerocash Paper</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1510093800000,"title":"Bill Brock on Zerocash: Decentralized Anonymous Payments from Bitcoin"},"249983081":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/249983081/","description":"<p>*Paper*<br/>Improving predictions of hydrological low-flow indices in ungaged basins using machine learning<br/>Scott C. Worland, William H. Farmer, Julie E. Kiang<br/><a href=\"https://www.sciencedirect.com/science/article/pii/S1364815217303535\" class=\"linkified\">https://www.sciencedirect.com/science/article/pii/S1364815217303535</a></p> <p>*Description*<br/>We compare the ability of eight machine-learning models (elastic net, gradient boosting, kernel-k- nearest neighbors, two variants of support vector machines, M5-cubist, random forest, and a meta-learning ensemble M5-cubist model) and four baseline models (ordinary kriging, a unit area discharge model, and two variants of censored regression) to generate estimates of the annual minimum 7-day mean streamflow with an annual exceedance probability of 90% (7Q10) at 224 unregulated sites in South Carolina, Georgia, and Alabama, USA. The machine-learning models produced substantially lower cross-validation errors compared to the baseline models. The meta-learning M5-cubist model had the lowest root-mean-squared-error of 26.72 cubic feet per second. Partial dependence plots show that 7Q10s are likely moderated by late summer and early fall precipitation and the infiltration capacity of basin soils.</p> <p>*Presenter Bio*<br/>Scott C. Worland is a hydrologist who applies statistical learning methods to answer pressing earth science questions. He hopes to bring strong disciplinary knowledge to interdisciplinary research teams. Research interests include statistical hydrology, machine learning, and Bayesian statistics.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1525210200000,"title":"Improving predictions of hydrological low-flow indices using machine learning"},"263563542":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/263563542/","description":"<p>Full Title: BERT - Pre-training of Deep Bidirectional Transformers for Language Understanding</p> <p>Description: BERT is an unsupervised deep language model that smashed benchmarks for many Natural Language Processing (NLP) tasks in 2018. While it no longer remains the state of the art for many NLP tasks, BERT represents an evolutionary milestone in language understanding, while democratizing access to deep NLP as a pre-trained model.</p> <p>Brent is the chief technology officer of Pylon. When he isn't working on machine learning systems for speech, he can be found reading papers, building prototypes, and curating the best memes the internet has to offer.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1565127000000,"title":"Brent Spell on BERT: Pre-training of Deep Bidirectional Transformers..."},"259471194":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/259471194/","description":"<p>Due to all the organizing team being out of town or on paternity leave, there will be no formal PWL talk tomorrow. However, a couple of members expressed interest in getting together, so if you'd like to chat about papers, meet at Barley Chattanooga (<a href=\"https://www.chattanoogabarley.com/\" class=\"linkified\">https://www.chattanoogabarley.com/</a>) at 5:30! Go ahead and RSVP as usual if you're planning on showing up. Have fun! Regular PWL service will resume in April featuring Brent Spell.</p> ","photos":[],"venue":{"lat":35.04497528076172,"address1":"235 E M L King Blvd","address2":null,"name":"Barley Chattanooga | Taproom |","postalCode":"37403","lon":-85.30563354492188,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1551825000000,"title":"March 2019: Meetup at Barley, No Talk"},"254999145":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/254999145/","description":"<p>Paper: Ouroboros: A Provably Secure Proof-of-Stake Blockchain Protocol<br/>Link: <a href=\"https://eprint.iacr.org/2016/889\" class=\"linkified\">https://eprint.iacr.org/2016/889</a></p> <p>Description:<br/>This paper describes a blockchain protocol that uses proof-of-stake to fulfill the requirements of a distributed secure ledger. This protocol is the backbone for the cardano cryptocurency token, Ada, which has been proclaimed as a \"third wave\" crypto that can scale to meet global commerce demands. Most of this paper is dedicated to proving the security claims, which we will discuss lightly, instead focusing on how blocks are created and consensus is achieved.</p> <p>Bio:<br/>Jacob is a Sr. Software Engineer at Skuid (aka skuidlet) who spends most of his free time dreaming about machines, talking about (and possibly consuming) alcohol, or taking naps with his cat.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1538515800000,"title":"Jacob Kobernik on Ouroboros: A Provably Secure Proof-of-Stake Blockchain Proto.."},"bzdctlyvkbhb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/bzdctlyvkbhb/","description":"<p>In <a href=\"http://okmij.org/ftp/Computation/Subtyping/\">Subtyping vs. Subclassing</a>, Oleg Kiselyov addresses the separation of interface and implementation. The first section shows that in good object oriented design, the type system can't be used in general to decide whether implementations can be safely substituted for one another. In <a href=\"http://okmij.org/ftp/Computation/Subtyping/Preventing-Trouble.html\">Preventing Trouble</a>, he outlines a set of rules (in C++) that do allow the type system to enforce subtype relationships, and that look suspiciously familiar.</p> <p>Lang Martin is a Principal Software Engineer at OpenTable and renown thought-leader in the hand gesture space.</p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1467756000000,"title":"Lang Martin on Subtyping, Subclassing, and Trouble with OOP"},"gmtvslyvhbfb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/gmtvslyvhbfb/","description":"<p><b>Noel Weichbrodt</b> will summarize a recent paper that appeared in the ACM Queue, <a href=\"https://queue.acm.org/detail.cfm?id=2903468\"><b>\"Statistics for Engineers\"</b></a> by Heinrich Hartmann. \"Statistics for Engineers\" surveys common statistical techniques for extracting useful, actionable information from the engineering data we regularly generate and encounter.</p> <p><b>About the Author:</b></p> <p><b>Heinrich Hartmann</b> is chief data scientist for Circonus. He earned his PhD in pure mathematics from the University of Bonn (Germany) on geometric aspects of string theory and worked as a researcher for the University of Oxford (UK) afterwards. In 2012 he transitioned into computer science and worked as an independent consultant for a number of different companies and research institutions. He is now leading the development of data analytics for the Circonus monitoring product.</p> <p><b>About the Presenter:</b></p> <p><b>Noel Weichbrodt</b> is a software engineer at OpenTable, working on distributed systems that power great dining experiences. </p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1462311000000,"title":"Inaugural PWL!"},"bzdctlyvlbdb":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/bzdctlyvlbdb/","description":"<p>Collecting real-time metrics like request latency is a critical part of production support. While it is easy to aggregate summary statistics like count, mean, and range, they are often a poor representation of actual service performance. This paper [1] describes a data structure that efficiently and accurately represents a histogram, which can be used to monitor and alert on quantile metrics (median, 99th percentile, etc.) in real time and constant space.</p> <p>Brent Spell is a programmer at OpenTable in Chattanooga, where he works on infrastructure for distributed systems and machine learning applications for restaurants.</p> <p>[1]: <a href=\"https://github.com/tdunning/t-digest/blob/master/docs/t-digest-paper/histo.pdf\">Computing Extremely Accurate Quantiles Using t-Digests</a></p> ","photos":[],"venue":{"lat":35.048187255859375,"address1":"701 Cherry St., Suite 300","address2":null,"name":"OpenTable Chattanooga","postalCode":"","lon":-85.30865478515625,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1470173400000,"title":"Brent Spell on Computing Extremely Accurate Quantiles Using t-Digests"},"254247626":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/254247626/","description":"<p>Description: Often neglected by historians and modern scientists, algorithmic procedures have been instrumental in the development of fundamental ideas: practice led to theory just as much as the other way round. The purpose of this book is to offer a historical background to contemporary algorithmic practice. We will discuss a selection of chapters from AHA and examine their history, development, and impact.</p> <p>Bio: Noel Weichbrodt's third eye, the all seeing eye of Pylon ai, Inc., has been recently opened (by James Mickens' Usenix '18 talk no less). With his newfound sight, he engineers the finest solutions; this entails all of the trials and tribulations of regular engineering, but he also has to be a salesman for some reason.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1536096600000,"title":"Noel Weichbrodt on A History of Algorithms: From the Pebble to the Microchip"},"258594201":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/258594201/","description":"<p>To get 2019 started right (or at all), we are going to do a more relaxed event. Noel is working on selecting a recorded talk from another PWL chapter to watch: Papers I Have Loved by Casey Muratori (<a href=\"https://www.youtube.com/watch?v=SDS5gLSiLg0\" class=\"embedded\">https://www.youtube.com/watch?v=SDS5gLSiLg0</a>). We'll pause for discussion as necessary and enjoy getting back into the swing of things.</p> <p>We had a couple of speakers move out of the area last year, so we are also going to be demystifying talks at PWL Chattanooga by having a discussion on our various techniques for talk prep; it's not as daunting as you think. We all approach it differently, so we'll share what works and what doesn't.</p> ","photos":[],"venue":{"lat":35.04936218261719,"address1":"605 Chestnut St","address2":"#700","name":"Liberty Tower","postalCode":"37450","lon":-85.31192779541016,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1549405800000,"title":"2019 Kickoff and Papers I Have Loved"},"249262759":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/249262759/","description":"<p>*Paper*<br/>The Power of Two Random Choices: A Survey of Techniques and Results<br/>Michael Mitzenmacher, Andréa W. Richa, Ramesh Sitaraman<br/><a href=\"http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.25.8277\" class=\"linkified\">http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.25.8277</a></p> <p>*Description*<br/>So this is a big paper about a small idea: two random choices and a<br/>comparison are unreasonably more effective than one random choice, and<br/>you don't need a third. We'll go through the introduction completely,<br/>and I'll cherry pick things that I find interesting in the main body<br/>of the paper. So many proofs. It's a tool you'll use!</p> <p>*Presenter Bio*<br/>Lang Martin is a hacker, hand waver, and eternal optimist interested<br/>in languages and problems of expression, distributed systems, and better<br/>communication. Currently working at his own startup as the fullest stack<br/>engineer ever, and wishing he had someone to dump frontend work<br/>onto.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1522791000000,"title":"A Survey of Techniques and Results"},"236484022":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/236484022/","description":"<p>Much AI/ML research focuses on building systems that excel in a narrow area (image recognition, planning, motor control, NLP).  While there is tremendous benefit there, it's also interesting to consider building autonomous agents which combine multiple subsystems (NLP, Planning, etc).</p> <p>Josh Marlow is a startup-addict. He's a python web-app engineer by day, and a functional programmer by night.</p> <p><a href=\"http://dl.acm.org/citation.cfm?id=91035\">A Basic Agent Paper</a></p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1484087400000,"title":"Josh Marlow on A Basic Agent"},"252166748":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/252166748/","description":"<p>Full Title: Writing, reading, and talking mathematics: One interdisciplinary possibility<br/>Link: <a href=\"http://stfj.net/DesigningForProblem-Solvers/Winograd1995.pdf\" class=\"linkified\">http://stfj.net/DesigningForProblem-Solvers/Winograd1995.pdf</a></p> <p>Description:<br/>As engineers we're consistently challenged with new problems.<br/>Often times these problems are outside of our initial reach. In order to<br/>solve them we have to use modeling techniques combined with our previous experiences. Learning how to solve problems in this way is difficult and it can leave many people feeling lost.</p> <p>In 1995, Ken Winograd and Karen M. Higgins presented a paper that examined the concept of \"problem writing\" and how it could be used to effectively teach children mathematics.</p> <p>In this talk we'll see two distinct viewpoints on learning, examine the<br/>nature of problem solving, and discuss ways that we can apply problem<br/>writing in our work.</p> <p>Bio:<br/>Chris Keathley is a senior backend engineer at Bleacher Report. He spends his days scaling services, building distributed systems, and making things integrate with Kafka.</p> <p>When he's not writing code for work, Chris can be found writing code for<br/>fun, talking about the joys of functional programming, playing pinball,<br/>roasting coffee, or building lego with his kids.</p> ","photos":[],"venue":{"lat":0.0,"address1":"1426 Williams St Suite 11","address2":null,"name":"Very Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-14400000,"time":1530653400000,"title":"Chris Keathley on Writing, reading, and talking mathematics"},"237376175":{"url":"https://www.meetup.com/Papers-We-Love-Chattanooga/events/237376175/","description":"<p>Recent advances in AI have yielded some impressive results. The use of deep neural networks in particular have led to astounding gains; machines have now approached or surpassed human ability at tasks such as object recognition, video games, and board games.</p> <p>Despite their biological inspiration and performance achievements, these systems differ from human intelligence in crucial ways. Humans still excel at learning quickly from only a handful of examples, and applying knowledge to novel situations.</p> <p>Can reverse engineering human intelligence usefully inform AI and machine learning? The authors believe so, and offer a set of core ingredients that could pave the way for even more human-like, and powerful, AI.</p> <p>Stephen Spalding is a technologist, cyclist, and Chattanooga native. Over his professional career, he’s enjoyed working with 3d x-ray machines at GE Healthcare, nuclear reactors at TVA, Clojure services at OpenTable, and serving tables at Boathouse Rotisserie. Recently, he has joined the engineering team at Netflix to help deliver continuous streams of entertainment for more compliant humans, amenable to our robot overlords.</p> <p><b>LINK TO PAPER: <a href=\"https://arxiv.org/pdf/1604.00289v3.pdf\">Building Machines That Think and Learn Like People</a></b></p> ","photos":[],"venue":{"lat":0.0,"address1":"50 East Main Street","address2":null,"name":"Startup Office","postalCode":"","lon":0.0,"country":"us","city":"Chattanooga"},"utcOffset":-18000000,"time":1486506600000,"title":"Stephen Spalding on Building Machines That Think and Learn Like People"}}