{"248836089":{"url":"https://www.meetup.com/Papers-We-Love-Kyiv/events/248836089/","description":"<p>First Papers We Love Kyiv meetup this year!<br/>Schedule:<br/>• The first talk: HyperLogLog by Eugen Kosteev (~ 40 min)<br/>• The second talk: Parsing with derivatives by Artem Mishchenko (~40 min)<br/>• The third talk: Link Grammar by Dmytro Yakymets (~ 20 min)<br/>• The time: 5th of April, 18:00<br/>• The place: Takeoff Technologies Kyiv, Saksahanskoho str. 40/85</p> <p>We aim for the conference to take approx. 2 hours</p> <p>Details:<br/>• HyperLogLog by Eugen Kosteev<br/>‣ <a href=\"http://algo.inria.fr/flajolet/Publications/FlFuGaMe07.pdf\" class=\"linkified\">http://algo.inria.fr/flajolet/Publications/FlFuGaMe07.pdf</a><br/>‣ Abstract: HyperLogLog is dedicated to estimating the number of distinct elements (the cardinality) of very large data ensembles. Using an auxiliary memory of m units (typically, \"short bytes''), HyperLogLog performs a single pass over the data and produces an estimate of the cardinality such that the relative accuracy (the standard error) is typically about 1.04/sqrt(m). This improves on the best previously known cardinality estimator, LogLog, whose accuracy can be matched by consuming only 64% of the original memory.<br/>‣ Bio: Eugen is a Big Data Engineer at Tubular Labs with more than 5 years of experience. Prior to his current role he worked as a Senior Programmer on such projects as Hotelcard and Zakaz.ua. He enjoys algorithms, competitive programming and will be happy to guide you through the paper.</p> <p>• Link Grammar by Dmytro Yakymets<br/>‣ <a href=\"https://arxiv.org/abs/cmp-lg/9508004\" class=\"linkified\">https://arxiv.org/abs/cmp-lg/9508004</a><br/>‣ Abstract: We develop a formal grammatical system called a link grammar, show how English grammar can be encoded in such a system, and give algorithms for efficiently parsing with a link grammar. Although the expressive power of link grammars is equivalent to that of context free grammars, encoding natural language grammars appears to be much easier with the new system.<br/>‣ Bio: Dmytro is a Consultant with experience in building private blockchains and research projects in different fields. Passionate linguist, with interests in NLP, worldbuilding and conlangs.</p> <p>• Parsing with derivatives by Artem Mishchenko<br/>‣ <a href=\"https://arxiv.org/abs/1010.5023\" class=\"linkified\">https://arxiv.org/abs/1010.5023</a><br/>‣ Abstract: We present two novel approaches to parsing context-free languages. The first approach is based on an extension of Brzozowski's derivative from regular expressions to context-free grammars. The second approach is based on a generalization of the derivative to parser combinators.<br/>‣ Bio: Artem is a Senior Software Engineer with more than 9 years in the industry, currently working at Takeoff Technologies. His main interests are PLs with different paradigms (Lisps in particular), and chess</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/e/7/0/e/600_470039150.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/e/7/1/0/600_470039152.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/e/7/4/f/600_470039215.jpeg","height":null,"width":null}],"venue":{"lat":50.436134338378906,"address1":"Саксаганського, 40/85","address2":null,"name":"Takeoff Technologies Kyiv HQ","postalCode":null,"lon":30.509674072265625,"country":"ua","city":"Kyiv"},"utcOffset":10800000,"time":1522940400000,"title":"Papers We Love Kyiv, Spring 2018"},"259898039":{"url":"https://www.meetup.com/Papers-We-Love-Kyiv/events/259898039/","description":"<p>We're proud to announce our next PWL meetup in Kyiv!</p> <p>Update 27/03 #2:<br/>Our second speaker tomorrow will be Ruslan Shevchenko with papers about Labelled Transition Systems (Hennessy-Milner logic).</p> <p>Update 27/03:<br/>Unfortunately due to personal issues Paweł Szulc will not be able to attend PWL Kyiv this time. We're looking for replacement.</p> <p>Details<br/>First PWL Kyiv meetup this year!</p> <p>- The time: Thursday, 28th of March, 6.00 p.m.<br/>- The place: 101 Tower, 7th floor (Lva Tolstoho St, 57, Kyiv, 01032)<br/>- Time, Clocks, and the Ordering of Events in a Distributed System by Max Klymyshyn (~30 min)<br/>- Time, Clocks, and the Ordering of Events in a Distributed System by Max Klymyshyn (~30 min)<br/>- Labelled Transition Systems (Hennessy-Milner logic) by Ruslan Shevchenko</p> <p>Details:<br/>- Time, Clocks, and the Ordering of Events in a Distributed System (Laslie Lamport)<br/>- <a href=\"https://lamport.azurewebsites.net/pubs/time-clocks.pdf\" class=\"linkified\">https://lamport.azurewebsites.net/pubs/time-clocks.pdf</a></p> ","photos":[],"venue":{"lat":50.439334869384766,"address1":"Lva Tolstoho St, 57","address2":null,"name":"Lva Tolstoho St, 57","postalCode":null,"lon":30.496028900146484,"country":"ua","city":"Kyiv"},"utcOffset":7200000,"time":1553788800000,"title":"Papers We Love Kyiv, Spring 2019"},"252974063":{"url":"https://www.meetup.com/Papers-We-Love-Kyiv/events/252974063/","description":"<p>Second PWL Kyiv meetup this year!</p> <p>‣ The time: Friday, 27th of July, 6.30 p.m.<br/>‣ The place: Щастя Хаб (Kyiv, Pankivska st. 14А)<br/>‣ The first talk: Paxos, Raft, and PBFT by Ruslan Shevchenko (~ 40 min)<br/>‣ The second talk: CRDTs and their application to JSON by Max Klymyshyn (~30 min)</p> <p>Details:<br/>‣ Paxos, Raft, and PBFT by Ruslan Shevchenko<br/>• <a href=\"https://lamport.azurewebsites.net/pubs/paxos-simple.pdf\" class=\"linkified\">https://lamport.azurewebsites.net/pubs/paxos-simple.pdf</a> and many others<br/>• Ruslan will give a talk on the history of Paxos, how it is related to Raft and what similarities it bears to the solution of Practical Byzantine Fault Tolerance.<br/>• Bio: Ruslan worked as a researcher in Institue of Software Systems, then founded an Internet Provider (NBI), and a software development company (GradSoft). After that, he worked in various projects in telecom and advertising industry. He is also a founder of .UA Scala user group, has over 10 publications in peer-reviewed journals, an active dou.ua columnist.</p> <p>‣ CRDTs and their application to JSON by Max Klymyshyn<br/>• <a href=\"https://arxiv.org/abs/1608.03960\" class=\"linkified\">https://arxiv.org/abs/1608.03960</a><br/>• Max will guide you through the history of CRDTs, why JSON is different from others from this perspective, and how to use it in distributed systems so that no input will be lost.<br/>• Bio: Max is a full-stack software engineer for Clojure/Python based projects with 15+ years experience that covers both programming and team leadership. Max is interested in distributed systems, data replication and consistency algorithms, information science and functional PLs.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/4/b/2/4/600_473299236.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/4/b/2/6/600_473299238.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/4/b/2/9/600_473299241.jpeg","height":null,"width":null}],"venue":{"lat":50.43939208984375,"address1":"Pankivska Street 14","address2":null,"name":"Schastie hub","postalCode":null,"lon":30.502965927124023,"country":"ua","city":"Kyiv"},"utcOffset":10800000,"time":1532705400000,"title":"Papers We Love Kyiv, Summer 2018"}}