{"225753033":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/225753033/","description":"<p>This month Sam will present \"<a href=\"http://research.google.com/pubs/pub41892.html\">Macaroons: Cookies with Contextual Caveats for Decentralized Authorization in the Cloud</a>\" by Arnar Birgisson and Joe Gibbs Politz and Úlfar Erlingsson and Ankur Taly and Michael Vrable and Mark Lentczner.</p> <p>\n\n\nCookies are the ubiquitous method of authorization on the Web, but they’re not without shortcomings. Subject to theft &amp; forgery, cookies are essentially unsharable.</p> <p>Sam will talk about macaroons as a way to safely share &amp; delegate authorization between sites and services. Using very simple cryptographic methods, we can efficiently create and verify tokens allowing access under specified conditions.</p> <p>The effects of this range from logging in to websites, increasing privacy on social media, and even more secure banking.</p> <p>--<br/>Sam is a sr software engineer at Yahoo where he builds the apps that play the videos that people want to watch. @cateches on twitter.</p> <p>--</p> <p>Huge thanks to the LMU CS Dept. for hosting us this month.</p> ","photos":[],"venue":{"lat":33.966880798339844,"address1":"1 Loyola Marymount University Dr","address2":null,"name":"LMU-Pereira 109","postalCode":"","lon":-118.4224624633789,"country":"us","city":"Los Angeles"},"utcOffset":-25200000,"time":1446084000000,"title":"Sam L’ecuyer on  Macaroons: Cookies with Contextual Caveats"},"223494462":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/223494462/","description":"<p>This month, Bill Berry will present <a href=\"http://research.microsoft.com/en-us/um/people/blampson/33-Hints/Acrobat.pdf\">Hints for Computer System Design</a> by Butler Lampson.</p> <p>--</p> <p>While technologies, methodologies and abstractions have waxed and waned over the years, Butler Lampson’s ‘Hints for Computer Systems Design’ remains relevant to the current challenges faced in software and hardware systems engineering.  Drawing against the backdrop of current development practices, we will discuss how Lampson’s hints can still be used, some thirty years later, to implement functionally accurate, high-performing fault-tolerant software systems.</p> <p>-- </p> <p>In a previous life Bill (<a href=\"https://twitter.com/williamberryiii\">@williamberryiii</a>) crafted scenery for Broadway, a la Pirates of Penzance, but now crafts software for the enterprise, a la Pirates of Silicon Valley.  In his roles as Technical Lead and Application Architect for The Retail Equation, Bill has lead service integrations with Fortune 500 retailers, curated DevOps initiatives and always enjoys building high performance, multi-tenant distributed data APIs.  As a deeply curious engineer, he enjoys pairing complex problems with simple and elegant solutions. Striving for meaningful change, Bill believes that cultural and technical progress is best made through evolution and not revolution.</p> <p><br/>--</p> <p>Thanks again to Brainium for generously hosting and providing food and drinks!</p> ","photos":[],"venue":{"lat":0.0,"address1":"225 Arizona #PH/400","address2":null,"name":"Brainium","postalCode":"","lon":0.0,"country":"us","city":"Santa Monica"},"utcOffset":-25200000,"time":1438221600000,"title":"Bill Berry on Hints for Computer System Design"},"228619562":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/228619562/","description":"<p>This month we have Paul Snively presenting \"<a href=\"http://homepages.inf.ed.ac.uk/wadler/topics/history.html#propositions-as-types\">Propositions as Types</a>\" at Yahoo's brand new Playa Vista campus.  Food and drink will be provided.</p> <p>--</p> <p>Philip Wadler may be the most important computer scientist you’ve never heard of. However, as principal designer of the Haskell programming language, co-designer of generics in Java with Scala designer Martin Odersky, co-designer of XQuery for the W3C, and prolific (and humorous, cf. ’Threesomes, with and without blame’ from POPL 2010) writer and speaker, there is little doubt he has influenced you if you write software. His recent (March 2014) paper, ‘<a href=\"http://homepages.inf.ed.ac.uk/wadler/topics/history.html#propositions-as-types\">Propositions as Types</a>,’ is his survey of the relationship between propositions, as in mathematical logic, and types, as in statically-typed programming language. Together, we’ll explore how and why this relationship is broad, deep, and mysterious; how it may shape new and future programming languages and possibly affect STEM education; and maybe even shed a little light (and hopefully a little less heat) on why some users of statically-typed languages are so adamant about it.</p> <p>\n\n\n\nPaul Snively is an architect for Verizon OnCue, working in Scala in a purely functional fashion. He loves both building things other people use and thinking about how and why the things he builds work, and like many other people, has discovered that the best way to learn is to try to teach, so he led a workshop on formal logic at the Scala World conference in 2015, which he later re-recorded as a <a href=\"https://www.youtube.com/watch?v=1KWcuhX-QTg\">screencast</a>; he discussed <a href=\"https://www.youtube.com/watch?v=SWTWkYbcWU0\">Type Systems: The Good, The Bad, and The Ugly</a> at the Strange Loop conference in 2014 with Amanda Laucher; and he discussed <a href=\"http://www.infoq.com/presentations/Types-Tests\">Types vs. Tests: An Epic Battle?</a> at the Strange Loop conference in 2012, also with Amanda Laucher.</p> <p><br/>--</p> <p>Thank you to Yahoo for hosting us!</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/b/3/8/6/600_447225958.jpeg","height":null,"width":null}],"venue":{"lat":33.9838752746582,"address1":"11985 Bluff Creek Dr","address2":null,"name":"Yahoo Playa Vista","postalCode":"","lon":-118.40103149414062,"country":"us","city":"Los Angeles"},"utcOffset":-28800000,"time":1456369200000,"title":"Paul Snively on Propositions as Types"},"234268294":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/234268294/","description":"<p>This month, we'll hear from Jim Benvenuto on his research into <a href=\"http://files.meetup.com/18381002/EPITAXIS%20ASystemForSyntacticAndSemanticSoftwareQueriesUsingDeduc.pdf\">EPITAXIS: A System for Syntactic and Semantic Software Queries using Deductive Retrieval and Symbolic Execution</a>.  If you've not seen Jim speak before, it's a real treat.</p> <p><i>---</i></p> <p><i>EPITAXIS: </i>A System for Syntactic and Semantic Software Queries using Deductive Retrieval and Symbolic Execution</p> <p>The stubborn persistence of Moore's law has enabled dramatic increases in the size and complexity of software. In addition, the information content of a program is spread over several different layers of abstraction. Superficially (and in our typical mode of interaction with an editor) a program is a sequence of characters, where its syntactic, semantic, pragmatic, and apobetic layers lay latent under deeper layers of abstraction.</p> <p><i>Epitaxis </i>is a language independent system designed to reify these layers of abstraction so they can be queried and reasoned over to allow software to be dealt with at the appropriate level of abstraction. In an analogous way that programs are used to model other systems, <i>Epitaxis </i>models software to allow access to its lexical, syntactic, and semantic layers, exposing execution state space to search and automated reasoning. In addition to funding bugs and aiding in understanding complex software this platform can be used to do machine learning over execution state space, and possibly a virtual environment for a machine agent to learn and explore software.</p> <p>---</p> <p>Food and drink will be provided by Yahoo.</p> ","photos":[],"venue":{"lat":33.9838752746582,"address1":"11985 Bluff Creek Dr","address2":null,"name":"Yahoo Playa Vista","postalCode":"","lon":-118.40103149414062,"country":"us","city":"Los Angeles"},"utcOffset":-25200000,"time":1475114400000,"title":"Jim Benvenuto on EPITAXIS"},"231756544":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/231756544/","description":"<p>This month, Mike will present \"<a href=\"https://www.cs.umd.edu/class/spring2003/cmsc838p/Design/criteria.pdf\">On Criteria To Be Used in Decomposing Systems into Modules</a>\" by DL Parnas.</p> <p>---</p> <p>Most people would agree that writing modular programs is better than the alternative, but there is disagreement on how to structure modules within a system. In this presentation we are going to do some time travelin' to the 60s and 70s to see how these discussions got started, and explore two different ways of writing a modular system. In doing this we will explore some of the pros and cons of the different systems and determine if one structure is better for most cases.</p> <p><a href=\"https://gist.github.com/samlecuyer\">&lt;/a&gt; Michael Matuzak works at GoGuardian and in his spare time compiles JS to his Nintendo.  You can follow him on twitter at &lt;a href=\"https://twitter.com/@mmatuzak\"&gt;@mmatuzak</a></p> ","photos":[],"venue":{"lat":33.9838752746582,"address1":"11985 Bluff Creek Dr","address2":null,"name":"Yahoo Playa Vista","postalCode":"","lon":-118.40103149414062,"country":"us","city":"Los Angeles"},"utcOffset":-25200000,"time":1467252000000,"title":"Mike Matuzak on On Criteria To Be Used in Decomposing Systems into Modules"},"224423506":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/224423506/","description":"<p>This month Eric Scrivner (<a href=\"https://twitter.com/etscrivner\">@etscrivner</a>) will present <a href=\"https://bitcoin.org/bitcoin.pdf\">Bitcoin: A Peer-to-Peer Electronic Cash System</a></p> <p>---</p> <p>Bitcoin is many things - a critique, a currency, a protocol, and perhaps even acontemporary industrial revolution. More immediately, however, bitcoin and theoriginal paper that spawned it are of interest to the working programmer as astudy in the design of fault-tolerant, decentralized systems. Beginning fromthe crtique of trusted third parties we will see how bitcoin provides novelstarting points for system architecture in the age of increasingly cheap andubiquitous computing power, as well as speculate about what all this mightentail for the future.</p> <p><br/>Additional Reading / Context For The Paper:</p> <p><br/>* Shelling Out -- The Origin of Money (Nick Szabo)</p> <p><a href=\"http://szabo.best.vwh.net/shell.html\"><a href=\"http://szabo.best.vwh.net/shell.html\" class=\"linkified\">http://szabo.best.vwh.net/shell.html</a></a></p> <p>* Trusted Third Parties Are Security Holes (Nick Szabo)</p> <p><a href=\"http://szabo.best.vwh.net/ttps.html\"><a href=\"http://szabo.best.vwh.net/ttps.html\" class=\"linkified\">http://szabo.best.vwh.net/ttps.html</a></a></p> <p>* Bitcoin isn't money, it's the internet of money (Eli Dourado) </p> <p><a href=\"https://theumlaut.com/2014/01/08/bitcoin-internet-of-money/\"><a href=\"https://theumlaut.com/2014/01/08/bitcoin-internet-of-money/\" class=\"linkified\">https://theumlaut.com/2014/01/08/bitcoin-internet-of-money/</a></a></p> <p>* The Byzantine General's Problem (Lamport, Shostak, and Pease) </p> <p><a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf\"><a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf\" class=\"linkified\">http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf</a></a></p> <p>* bmoney</p> <p><a href=\"http://www.weidai.com/bmoney.txt\"><a href=\"http://www.weidai.com/bmoney.txt\" class=\"linkified\">http://www.weidai.com/bmoney.txt</a></a></p> <p>\n\n\n---</p> <p>Huge thanks to <a href=\"https://www.dollarshaveclub.com/\">Dollar Shave Club</a> for sponsoring us this month.</p> <p><br/>Dinner and drinks will be provided.</p> ","photos":[],"venue":{"lat":33.98813247680664,"address1":"13335 Maxella Ave","address2":null,"name":"Dollar Shave Club HQ","postalCode":"","lon":-118.43904876708984,"country":"us","city":"Marina del Rey"},"utcOffset":-25200000,"time":1440640800000,"title":"Eric Scrivner on Bitcoin: A Peer-to-Peer Electronic Cash System"},"220325190":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/220325190/","description":"<p>Sam L'ecuyer will present <a href=\"http://research.microsoft.com/en-us/um/people/fournet/papers/join-tutorial.pdf\">The Join Calculus: a Language for Distributed Mobile Programming</a>, by Cedric Fournet and Georges Gonthier.</p> <p>\n\n--</p> <p>Do semaphores and mutexes, distributed locks and clocks confound you? Does concurrency as an afterthought frustrate and bewilder you? In this paper, Fournet and Gonthier present the join calculus, a modeling language for clean, asynchronous distributed computing. This language builds upon well established techniques of pattern matching, static typing, and local variable declaration to lay the foundation for synchronizing data across multiple machines, code mobility, and failure detection.</p> <p>--</p> <p>Sam L'ecuyer (<a href=\"https://twitter.com/cateches\">@cateches</a>) is a front-end engineer at Yahoo.  You can find a lot of the code he writes at <a href=\"https://screen.yahoo.com\">screen.yahoo.com</a>. He enjoys static typing, text editors from the 1970s, and making his own cocktail bitters.</p> ","photos":[],"venue":{"lat":34.03025436401367,"address1":"2400 Broadway","address2":"Building D, 1st Floor","name":"Yahoo Center","postalCode":"90404","lon":-118.47484588623047,"country":"us","city":"Santa Monica"},"utcOffset":-28800000,"time":1424919600000,"title":"Sam L'ecuyer on The Join Calculus: a Language for Distributed Mobile Programming"},"233476568":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/233476568/","description":"<p>This month we're trying something a little bit different: lightning talks!  The idea of lightning talks is that everyone can present a paper they love in 5 minutes.  No slides, no pressure. Remember to tell us who wrote it and why you like it! As time allows, you can present more than one. If you're not sure where to find a paper to read, reach out to me and I can point you in the right direction.  Feel free to comment on the event if you're concerned others might cover the same paper.</p> <p>We're still going to have food and drinks and the usual timeline.</p> ","photos":[],"venue":{"lat":33.9838752746582,"address1":"11985 Bluff Creek Dr","address2":null,"name":"Yahoo Playa Vista","postalCode":"","lon":-118.40103149414062,"country":"us","city":"Los Angeles"},"utcOffset":-25200000,"time":1472695200000,"title":"Lightning Talks"},"241748877":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/241748877/","description":"<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Cantor_set_binary_tree.svg/400px-Cantor_set_binary_tree.svg.png\" /></p> <p>From the intersection of data structures/algorithms, computability, type-level programming, and the high-generality branch of geometry called Topology comes a surprising theorem. The author applies the topological mantra that a compact set is a set that \"behaves like\" a finite set to the setting of programming, constructing a class of infinite data structures that have finite-time exhaustive search algorithms.</p> <p>We seek to present all topics thoroughly while assuming as little background as possible. In particular, no prior knowledge of Topology is needed.</p> <p>Paper: <a href=\"https://www.cs.bham.ac.uk/~mhe/papers/exhaustive.pdf\"><a href=\"https://www.cs.bham.ac.uk/~mhe/papers/exhaustive.pdf\" class=\"linkified\">https://www.cs.bham.ac.uk/~mhe/papers/exhaustive.pdf</a></a></p> ","photos":[],"venue":{"lat":0.0,"address1":"225 Arizona #PH/400","address2":null,"name":"Brainium","postalCode":"","lon":0.0,"country":"us","city":"Santa Monica"},"utcOffset":-25200000,"time":1504836000000,"title":"Daniel Brice - Infinite sets that admit fast exhaustive search"},"229489391":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/229489391/","description":"<p>This month Gonzalo Maldonado will present John Hughes' <a href=\"http://worrydream.com/refs/Hughes-WhyFunctionalProgrammingMatters.pdf\">Why Functional Programming Matters</a> at Yahoo's Playa Vista campus.  Food &amp; drink will be provided.</p> <p>--</p> <p>Immutable Data, Data-Driven apps and Reactive UIs, these technologies are the latest industry buzzwords. All of them are based on functional programming principles, yet some of their users are not aware of that influence.<br/>John Huges back in the 90s presented the idea that since modularity is the key to successful programming, functional programming matters because it enables well structured and easy to debug software.<br/>This presentation will revisit his paper and compare how these principles are being applied in the new \"Reactive technologies\" and why Functional Programming Matters.</p> <p>\n\n--</p> <p>Since the days where computers had green screens, Gonzalo has been hacking any turing-complete device he has stumbled upon, from Apple IIs to Mesos Clusters in AWS. Gonzalo is currently Lead Engineer at Must Win, a consultancy specialized on helping all sorts of companies build and maintain scalable systems.</p> <p><br/>--</p> <p>A big Thank You to Yahoo for hosting again.</p> ","photos":[],"venue":{"lat":33.9838752746582,"address1":"11985 Bluff Creek Dr","address2":null,"name":"Yahoo Playa Vista","postalCode":"","lon":-118.40103149414062,"country":"us","city":"Los Angeles"},"utcOffset":-25200000,"time":1459389600000,"title":"Gonzalo Maldonado on Why Functional Programming Matters"},"222365009":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/222365009/","description":"<p>At this Papers We Love LA we will have Mark Masse presenting \"<a href=\"http://www.ics.uci.edu/~fielding/pubs/dissertation/top.htm\">Architectural Styles and the Design of Network-based Software Architectures</a>\" by Roy Fielding. This presentation will focus primarily on Chapter 5, which introduces the Representational State Transfer (REST) architectural style for distributed hypermedia systems. REST API design topics will also be covered in the presentation.</p> <p>Dinner will be provided.</p> <p>Thanks to Riot Games for hosting this event!</p> <p>Bio:</p> <p>Mark Masse spent his early career with Disney, architecting and developing the content management system (CMS) that powers ESPN.com, ABC.com and Disney.com. In 2011, Mark architected the API management system used by Walt Disney Theme Parks and Resorts and authored the \"REST API Design Rulebook\" for O'Reilly. In 2014, Mark joined Riot Games as an Engineering Manager supporting a team that is dedicated to leveling up other internal teams with apps, tools, and automation.</p> <p><a href=\"https://www.linkedin.com/in/markmasse\"><a href=\"https://www.linkedin.com/in/markmasse\" class=\"linkified\">https://www.linkedin.com/in/markmasse</a></a></p> ","photos":[],"venue":{"lat":34.032875061035156,"address1":"12333 W Olympic Blvd","address2":null,"name":"Riot Games Campus","postalCode":"90064","lon":-118.4577407836914,"country":"us","city":"Los Angeles"},"utcOffset":-25200000,"time":1432778400000,"title":"Mark Masse on Architectural Styles and the Design of Network-based Software"},"237906391":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/237906391/","description":"<p><img src=\"http://photos1.meetupstatic.com/photos/event/2/7/0/d/600_458709997.jpeg\" /></p> <p>Matthew Colborn in Pluralism and the Mind (2011) wrote:</p> <p>“The major dilemma for Western science – and those who follow it – is how to fit subjective experiences in to a larger world-view that at least appears to preclude them.</p> <p>As the philosopher John Searle put it:</p> <p>“How can we square [the] self-conception of ourselves as mindful, meaning-creating, free, rational, etc. agents with a universe that consists of entirely mindless, meaningless, unfree, nonrational, brute physical particles?”.</p> <p>Searle is claiming that the background assumptions of Western science conflict in some fundamental way with our everyday view of ourselves.”</p> <p>As expressed by Colborn (and Searle), there is a discordance between the science we use to understand the world and how we view and understand ourselves as living beings. Can this be resolved by improving (and expanding) what science can express without resorting to vitalism or mysticism?</p> <p>Not many people have heard of Robert Rosen. He was a theoretical biologist who spent his entire career trying to understand life. His research was to answer the question: “What is it about certain material systems that confers upon them the characteristics of life, which makes them living beings?” In order to approach an answer, Rosen was forced to investigate how it is that science answers questions. This lead him to a deep study of the Newtonian Paradigm and what can and cannot be understood in its terms. Rosen formulated a language based on Category Theory that reaches beyond Newtonian mechanics to answer the question “How is an organism different from a machine?” His work spans numerous books, book chapters, and many scientific papers.</p> <p>Donald Mikulecky’s paper “Robert Rosen: The Well-Posed Question and its Answer – Why Are Organisms Different from Machines?” is one of the best overviews of Rosen’s work.</p> <p>This talk will take a journey through this fascinating and controversial territory.</p> <p><a href=\"http://www.people.vcu.edu/~mikuleck/PPRISS3.html\" class=\"linkified\">http://www.people.vcu.edu/~mikuleck/PPRISS3.html</a> (<a href=\"http://www.people.vcu.edu/~mikuleck/PPRISS3.html\" class=\"linkified\">http://www.people.vcu.edu/~mikuleck/PPRISS3.html</a>)</p> ","photos":[],"venue":{"lat":0.0,"address1":"225 Arizona #PH/400","address2":null,"name":"Brainium","postalCode":"","lon":0.0,"country":"us","city":"Santa Monica"},"utcOffset":-25200000,"time":1493258400000,"title":"Jim Benvenuto - Why Are Organisms Different from Machines"},"221186662":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/221186662/","description":"<p>Hey Everyone,</p> <p>I couldn't find a speaker available this month &amp; then we lost our room booking.  But let's not let that get us down.  I've got a couple speakers on the docket for April &amp; May.</p> <p>Let's meet at the Daily Pint, enjoy drinks we love, and geek out about computer science.</p> <p>\n\n\nSee you there!</p> <p>Ps. It's buy-your-own-drinks in case that was ambiguous.</p> ","photos":[],"venue":{"lat":34.021121978759766,"address1":"2310 Pico Blvd","address2":null,"name":"Daily Pint","postalCode":null,"lon":-118.46615600585938,"country":"US","city":"Santa Monica"},"utcOffset":-25200000,"time":1427331600000,"title":"Drinks We Love @ Daily Pint"},"236998470":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/236998470/","description":"<p><img src=\"http://photos3.meetupstatic.com/photos/event/d/1/a/6/600_457613670.jpeg\" /></p> <p>Daniel Brice will present \"On the likelihood that one unknown probability exceeds another in view of the evidence of two samples\" by William Thompson. It gives a solution to the multi-armed bandit problem that gives O(log(n)) regret that is today used in machine learning applications and goes by the name \"Thompson Sampling\" in this author's honor. Contrast this to A/B Testing, another multi-armed bandit algorithm that gives much worse O(n) regret.</p> <p><br/><a href=\"https://www.dropbox.com/s/yhn9prnr5bz0156/1933-thompson.pdf\"><a href=\"https://www.dropbox.com/s/yhn9prnr5bz0156/1933-thompson.pdf\" class=\"linkified\">https://www.dropbox.com/s/yhn9prnr5bz0156/1933-thompson.pdf</a></a></p> ","photos":[],"venue":{"lat":0.0,"address1":"225 Arizona #PH/400","address2":null,"name":"Brainium","postalCode":"","lon":0.0,"country":"us","city":"Santa Monica"},"utcOffset":-28800000,"time":1487818800000,"title":"Daniel Brice - Thompson Sampling"},"232650720":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/232650720/","description":"<p>This month I'm presenting Edsger Dijkstra's classic <a href=\"https://www.cs.utexas.edu/users/EWD/ewd02xx/EWD215.PDF\">GOTO Considered Harmful</a> and the response &lt;a&gt;\"GOTO Considered Harmful\" Considered Harmful&lt;/a&gt;.  We will be hosted by Yahoo again.</p> <p>--</p> <p>Despite all of his other contributions to computing science, Dijkstra's most well known paper continues to be GOTO Considered Harmful.  Cited by thousands of other papers and articles, it spawned numerous copycat papers and responses.  It is loved, loathed, and misunderstood.</p> <p>But more than just the technical merits, the paper deserves a second look for how we discuss software and computing.  How does the way we convey our ideas affect our legacy?</p> <p>--</p> <p>Sam is a senior engineer in Yahoo's video org.  He enjoys plenty of things and vague bio-blurbs. He tweets at @cateches.</p> ","photos":[],"venue":{"lat":33.9838752746582,"address1":"11985 Bluff Creek Dr","address2":null,"name":"Yahoo Playa Vista","postalCode":"","lon":-118.40103149414062,"country":"us","city":"Los Angeles"},"utcOffset":-25200000,"time":1469671200000,"title":"Sam Lecuyer on GOTO (Considered Harmful)+"},"231208234":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/231208234/","description":"<p>This month, we have Dr Toal presenting C.A.R. Hoare's classic <a href=\"http://spinroot.com/courses/summer/Papers/hoare_1978.pdf\">Communicating Sequential Processes</a>.</p> <p>--</p> <p>This paper suggests that input and output are basic primitives of programming and that parallel composition of communicating sequential processes is a fundamental program structuring method. When combined with a development of Dijkstra's guarded command, these concepts are surprisingly versatile. Their use is illustrated by sample solutions of a variety of familiar programming exercises.</p> <p><br/>--</p> <p>We'll be back at Yahoo's Playa Vista campus, where food and drink will be provided.  The parking lot between Bluff Creek and Artisan's will be complimentary.</p> ","photos":[],"venue":{"lat":33.9838752746582,"address1":"11985 Bluff Creek Dr","address2":null,"name":"Yahoo Playa Vista","postalCode":"","lon":-118.40103149414062,"country":"us","city":"Los Angeles"},"utcOffset":-25200000,"time":1464228000000,"title":"Dr Ray Toal on Communicating Sequential Processes"},"223161204":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/223161204/","description":"<p>This month, Phil Freeman will present\"<a href=\"http://web.cs.wpi.edu/~cs4536/c12/milner-damas_principal_types.pdf\">Principal type-schemes for functional programs</a>\" by Damas and Milner.  </p> <p><br/>The Damas-Hindley-Milner type system is a classical system for the first-order polymorphic lambda calculus, and the ML family of programming languages. This paper introduces Algorithm W, a simple algorithm for type reconstruction in the DHM type system. I'll walk through the main results of the paper, and compare the DHM type system with other more modern systems.</p> <p><br/>Phil Freeman (<a href=\"https://twitter.com/paf31\">@paf31</a>) is an engineer at DicomGrid.  He is the original developer of the PureScript compiler, author of <a href=\"http://t.co/go0muLMN1n\"> </a><a href=\"http://leanpub.com/purescript\">PureScript by Example</a>, a Haskeller &amp; PLT enthusiast.</p> <p>A huge thank-you to <a href=\"http://www.brainiumstudios.com/\">Brainium</a> for hosting us this month!</p> <p>Please do note that because of space constraints, this month's attendance is capped at 20.</p> ","photos":[],"venue":{"lat":0.0,"address1":"225 Arizona #PH/400","address2":null,"name":"Brainium","postalCode":"","lon":0.0,"country":"us","city":"Santa Monica"},"utcOffset":-25200000,"time":1435197600000,"title":"Phil Freeman on Principal type-schemes for functional programs"},"227508276":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/227508276/","description":"<p>This month Bill will present \"No Silver Bullet\" by Fred Brooks. <a href=\"http://worrydream.com/refs/Brooks-NoSilverBullet.pdf\">link</a></p> <p>Abstract:</p> <p><br/>Some thirty years after Turing Award winner Fred Brooks’ seminal work 'No Silver Bullet' was published, the industry has paved over his enthusiastic skepticism, with an air of pessimism and apathy.  After tearing down the failed software development methodologies of our predecessors, I will leverage Brooks’ work to frame a critique of current industry themes such as DevOps, Microservices, and Cloud Computing.  Lest however, you be consumed by an unshakable hopelessness that, as an industry, we are bound to Santayana’s Sisyphean prophesy (‘those who don’t learn from history are bound to repeat it’), I will show that Brooks’ theories are alive, well and in fact thriving in niche communities paving our way forward.</p> <p>\n\n\n\nAbout Bill:</p> <p>In a previous life, Bill (<a href=\"https://twitter.com/williamberryiii\">@williamberryiii</a>) crafted scenery for Broadway, a la Pirates of Penzance, but now crafts software for the enterprise, a la Pirates of Silicon Valley. In his roles as Technical Lead and Application Architect for The Retail Equation, Bill has lead service integrations with Fortune 500 retailers, curated DevOps initiatives and always enjoys building high performance, multi-tenant distributed data APIs. As a deeply curious engineer, he enjoys pairing complex problems with simple and elegant solutions. Striving for meaningful change, Bill believes that cultural and technical progress is best made through evolution and not revolution.</p> <p><br/>---</p> <p>Food and drinks will be provided by DSC.</p> <p>A huge thank you to <a href=\"https://www.dollarshaveclub.com/\">Dollar Shave Club</a> for sponsoring this month's meetup!</p> ","photos":[],"venue":{"lat":33.98813247680664,"address1":"13335 Maxella Ave","address2":null,"name":"Dollar Shave Club HQ","postalCode":"","lon":-118.43904876708984,"country":"us","city":"Marina del Rey"},"utcOffset":-28800000,"time":1453950000000,"title":"Bill Berry on No Silver Bullet"},"237567684":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/237567684/","description":"<p><img src=\"http://photos1.meetupstatic.com/photos/event/b/3/d/4/600_458206036.jpeg\" /></p> <p>Vacuum instability is one of the most fascinating (and terrifying) topics of cosmology and particle physics. This paper asks and answers some of the early questions of vacuum decay and inflationary theory. The discussion ranges in tone from sanitized mathematical descriptions of field equations to humorous rhetorical musings on the fate of the universe in different scenarios. Despite its brevity and age, Coleman and Luccia's work continues to serve as a reference and inspiration for work in gravitation and cosmology today.  </p> <p><a href=\"https://www.sns.ias.edu/pitp2/2011files/PhysRevD.21.3305.pdf\"><a href=\"https://www.sns.ias.edu/pitp2/2011files/PhysRevD.21.3305.pdf\" class=\"linkified\">https://www.sns.ias.edu/pitp2/2011files/PhysRevD.21.3305.pdf</a></a></p> ","photos":[],"venue":{"lat":0.0,"address1":"225 Arizona #PH/400","address2":null,"name":"Brainium","postalCode":"","lon":0.0,"country":"us","city":"Santa Monica"},"utcOffset":-25200000,"time":1490839200000,"title":"Elwin Martin - Gravitational effects on and of vacuum decay"},"225395217":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/225395217/","description":"<p>This month Jim will present <a href=\"http://cseweb.ucsd.edu/~vahdat/papers/mop.pdf\">\"Metaobject Protocols: Why We Want Them And What Else They Can Do\"</a> by Kiczales, Ashley, Rodriguez, Vahdat &amp; Bobrow.</p> <p>Abstraction is one of the pillars of computer science. Software has traditionally been constructed according to the principle that a module should expose its functionality but hide its implementation. This principle, informally known as black-box abstraction, is a basic tenet of software design, underlying our approaches to portability, reuse,and many other important issues in computing. However, in some cases black-box abstraction causes the very problems it is supposed to eliminate.</p> <p>As a programming languages becomes higher and higher level, its implementation in terms of the underlying machines involves more and more trade-offs on the part of the implementer, about what cases to optimize at the expense of other cases. This leaves a programmer victim to inefficiencies driving them to break language abstractions and \"code between the lines\" making code more complex and less portable.</p> <p>Meta-object protocols are a principled way of getting the most out of abstraction. It is a way to allow the end-programmer to go back and remake design tradeoffs to better suite their needs. In addition Meta-object protocols are an extremely fascinating and elegant formalism.</p> <p>---</p> <p>Thanks again to Brainium for being such a wonderful sponsor of our meetup </p> ","photos":[],"venue":{"lat":0.0,"address1":"225 Arizona #PH/400","address2":null,"name":"Brainium","postalCode":"","lon":0.0,"country":"us","city":"Santa Monica"},"utcOffset":-25200000,"time":1443664800000,"title":"Jim Benvenuto on Metaobject Protocols Why We Want Them And What Else They Can Do"},"221989188":{"url":"https://www.meetup.com/Papers-We-Love-LA/events/221989188/","description":"<p>Ryan Nichols will present <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/comp_sci_fundamentals_and_history/axiomatic-basis-computer-programming.pdf?raw=true\">An Axiomatic Basis for Computer Programming</a> by C.A.R Hoare.</p> <p>A brilliant paper written in 1969, which introduced some of the most influential components of programming which we all rely on today. We'll be discussing automatic verification of program properties, Hoare logic, and more.</p> <p>Ryan Nichols (<a href=\"https://twitter.com/rynodivino\">@rynodivino</a>) is a front-end engineer at Yahoo. He enjoys &lt;cool hobby&gt; and &lt;funny interest&gt; (and making terrible jokes)!</p> ","photos":[],"venue":{"lat":34.03025436401367,"address1":"2400 Broadway","address2":"Building D, 1st Floor","name":"Yahoo Center","postalCode":"90404","lon":-118.47484588623047,"country":"us","city":"Santa Monica"},"utcOffset":-25200000,"time":1430359200000,"title":"Ryan Nichols on An Axiomatic Basis for Computer Programming"}}