{"227661230":{"url":"https://www.meetup.com/Papers-We-Love-London/events/227661230/","description":"<p><i>Remember to <a href=\"https://skillsmatter.com/meetups/7746-a-history-and-evaluation-of-system-r\">sign up on Skills Matter too</a>, so they know you're coming!</i></p> <p>The speaker:</p> <p><br/>Tom Crayford is a database wrangler.</p> <p>The paper:</p> <p><a href=\"http://www.cs.berkeley.edu/~brewer/cs262/SystemR-comments.pdf\">An History and Evaluation of System R</a></p> <p>Chamberlin, Astrahan, Blagsen, Gray, King, Lindsay, Lorie, Mehl, Price, Putzolo, Selinger, Schkolnick, Slutz, Traiger, Wade, Yost</p> <p>Relational Database technology is one of the largest successes of computology over the past 46 years. Most useful non-blob data written to disk is probably in an RDBMS somewhere. But in 1970, all relational meant was \"somebody had written a weird paper\". System R was the research project that took that paper and made it of huge practical importance. On the way, the team discovered dozens of new research areas, techniques for database implementation, and ultimately made relational databases into the success they are today. Thousands of papers, and billions of dollars of investment are based off this one project, done by a team of 15 people. Many of the techniques invented are now taken for granted, just \"normal\" for line-of-business programmers.</p> <p>This is a survey, of a survey paper, of a large and long running research project. System R produced dozens of interesting papers, and we'll touch on the important topics, and reflect a bit on where we stand, 35 years after this paper was published.</p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":0,"time":1453314600000,"title":"Tom Crayford on 'An History and Evaluation of System R'"},"245556437":{"url":"https://www.meetup.com/Papers-We-Love-London/events/245556437/","description":"<p>Gareth Morgan (<a href=\"https://twitter.com/axumgraphics\" class=\"linkified\">https://twitter.com/axumgraphics</a>) presents a talk about the paper \"Physically-Based Shading at Disney Animation\" (downloadable at <a href=\"https://disney-animation.s3.amazonaws.com/library/s2012_pbs_disney_brdf_notes_v2.pdf\" class=\"linkified\">https://disney-animation.s3.amazonaws.com/library/s2012_pbs_disney_brdf_notes_v2.pdf</a>) by Brent Burley at Walt Disney Animation Studios.</p> <p>Abstract</p> <p>Brent's paper is an overview of how Disney Animation Studios pioneered physically based shading. This talk will summarize the paper and serve as an introduction to the field of physically based shading and BRDF theory generally. If you are interested in learning more about physically based rendering and the science of computer animation join us for this technical discussion.</p> <p>The meetup</p> <p>PapersWeLove (<a href=\"http://paperswelove.org\" class=\"linkified\">http://paperswelove.org</a>) London proudly brings to you the best papers every month! Please join us to read and discuss the most amazing ideas in computer science. We meet at ZPG (<a href=\"https://www.uswitch.com/about-us/contact-us/\" class=\"linkified\">https://www.uswitch.com/about-us/contact-us/</a>) offices near Tower Bridge (<a href=\"https://goo.gl/maps/qJXZek4fMNU2\" class=\"linkified\">https://goo.gl/maps/qJXZek4fMNU2</a>) with the following schedule:</p> <p>• 6.30pm: networking, pizza and drinks.<br/>• 7:00pm: presentation starts</p> <p>The Speaker</p> <p>Gareth Morgan has been involved in games and 3D graphics since 1999, starting at Silicon Graphics, followed by several games companies; including Activision and BAM Studios. For many years he researched sophisticated rendering techniques using Imagination Technologies' ray tracing GPUs. He is currently CEO of Axum Graphics (<a href=\"http://axumgfx.com\" class=\"linkified\">http://axumgfx.com</a>), a ground breaking 3D content creation tool startup based in San Francisco. In 2014 and '15, he presented at GDC, and presented on rendering theory at Papers We Love London and San Francisco. His chapter on ray tracing was published in the book GPU Pro 6.</p> ","photos":[],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":0,"time":1513708200000,"title":"Gareth Morgan on \"Physically-Based Shading at Disney Animation\""},"221535320":{"url":"https://www.meetup.com/Papers-We-Love-London/events/221535320/","description":"<p>Andy Bennett on \"Scalable Atomic Visibility with RAMP Transactions\"</p> <p> </p> <p>Bailis et al formalise \"Read Atomic\" isolation which is a database isolation level sufficient for many applications which make use of large,distributed databases in real world applications. They then show how to design a database system which provides this isolation level whilst allowing read, write and read/write transactions on data across multiple partitions: partitions which do not need to communicate with each other.This method is both performant and fairly portable to existing architectures and allows database authors to implement much stronger guarantees than are currently available from systems in use at companies such as Facebook, LinkedIn, Yahoo or Amazon.</p> <p> </p> <p>In this talk we will explore the contributions of this paper and how they can be used solve some of the anomolies encountered in today's multi-node, distributed, database systems and accompanying applications.</p> <p> </p> ","photos":[],"venue":{"lat":51.50611877441406,"address1":"Notcutt House, 36 Southwark Bridge Road","address2":"SE1 9EU","name":"uSwitch","postalCode":null,"lon":-0.09585899859666824,"country":"gb","city":"London"},"utcOffset":3600000,"time":1429120800000,"title":"Andy Bennett on \"Scalable Atomic Visibility with RAMP Transactions\""},"223602194":{"url":"https://www.meetup.com/Papers-We-Love-London/events/223602194/","description":"<p>Hagit Attiya and Jennifer L Welch: “Sequential Consistency versus Linearizability,” ACM Transactions on Computer Systems (TOCS), volume 12, number 2, pages 91–122, May 1994.</p> <p><br/><a href=\"http://courses.csail.mit.edu/6.852/01/papers/p91-attiya.pdf\"><a href=\"http://courses.csail.mit.edu/6.852/01/papers/p91-attiya.pdf\" class=\"linkified\">http://courses.csail.mit.edu/6.852/01/papers/p91-attiya.pdf</a></a><br/><a href=\"http://dx.doi.org/10.1145/176575.176576\"><a href=\"http://dx.doi.org/10.1145/176575.176576\" class=\"linkified\">http://dx.doi.org/10.1145/176575.176576</a></a></p> <p>An often-cited constraint on distributed database design is the CAP theorem, an impossibility result in distributed systems. It states that in a linearizable database, if the network is interrupted, some nodes cannot respond to requests. Although being able to tolerate network faults is important, the performance and response times of a database are often even more important, and CAP says nothing about those. It's also a pretty boring theorem.</p> <p>Attiya and Welch's paper, which we'll discuss in this session, is vastly more interesting. It also proves an impossibility result, but it's about response times: on a network where the uncertainty of packet delay is u, there is no algorithm that implements linearizability with read requests faster than u/4 and write requests faster than u/2. On a network where packet delay is highly variable (like many computer networks), a linearizable database is therefore inevitably going to be slow.</p> <p>The paper then goes on to compare linearizability to sequential consistency (a weaker consistency guarantee), and shows that sequential consistency can be significantly faster.</p> <p>This is a theoretical paper, but its applications to practical systems are very real. Its proofs are elegant and not too difficult to follow. It was almost a decade ahead of the CAP theorem. And moreover, it has no male co-authors. What's not to love about it?</p> <p>\n\nThe presenter:</p> <p>Martin Kleppmann is author of the O'Reilly book Designing Data-Intensive Applications (<a href=\"http://dataintensive.net/\"><a href=\"http://dataintensive.net\" class=\"linkified\">http://dataintensive.net</a></a>), which analyses the data infrastructure and architecture used by internet companies. He previously co-founded a startup, Rapportive, that was acquired by LinkedIn in 2012. His technical blog is at <a href=\"http://martin.kleppmann.com/\"><a href=\"http://martin.kleppmann.com\" class=\"linkified\">http://martin.kleppmann.com</a></a> and he's <a href=\"https://twitter.com/martinkl\">@martinkl</a> on Twitter.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/c/5/f/6/600_439550678.jpeg","height":null,"width":null}],"venue":{"lat":51.53070831298828,"address1":"338-346 Goswell Road","address2":"EC1V 7LQ","name":"GoCardless","postalCode":null,"lon":-0.10384400188922882,"country":"gb","city":"London"},"utcOffset":3600000,"time":1436378400000,"title":"Martin Kleppmann on “Sequential Consistency versus Linearizability”"},"242355199":{"url":"https://www.meetup.com/Papers-We-Love-London/events/242355199/","description":"<p>When a paper gets really large it transforms into a book! <a href=\"http://fsharpworks.com\">Tomas Petricek</a> (<a href=\"https://twitter.com/tomaspetricek?lang=en\">@tomaspetricek</a>) is presenting \"<b><a href=\"https://en.m.wikipedia.org/wiki/Where_Mathematics_Comes_From\">Where Mathematics Comes From</a></b>\" by G. Lakoff and R. E. Núñez. A paper related to this book is \"Lakoff, Nunez [1997] The Metaphorical Structure of Mathematics\" available at <a href=\"http://escholarship.org/uc/item/5qq7q51z\">this link</a>.</p> <p>• 6.30pm: networking, pizza and drinks.</p> <p>• 7:00pm: presentation starts</p> <p><b>Abstract</b></p> <p><i>This book by cognitive linguist George Lakoff and a psychologist Rafael Nunez seeks to found a cognitive science of mathematics. The key idea is that mathematics is born from our interactions with the world (it is embodied) through cognitive metaphors (that construct more complex mathematical structures as metaphors of simpler ones). The book uses the framework to explain a number of mathematical constructs including arithmetic, theory of sets and continuous functions.</i></p> <p><i>In this talk, I will give an overview of the key ideas from the book and their consequences for computer science. For example, could cognitive science of mathematics and cognitive metaphors explain theoretical computer science objects such as the lambda calculus?</i></p> <p><i>As this is a talk about a book rather than a paper, we do not expect everyone to read the book before the meetup, but you are more then welcome to get a copy and get started. You can see the talk more as a teaser for the book!</i></p> <p><b>The Speaker</b></p> <p><i>Tomas is a computer scientist and open-source developer. He is a Visiting Researcher at the Alan Turing Institute working on tools for open data-driven storytelling. He wrote a popular book called \"Real-World Functional Programming\" and is a lead developer of several F# open-source libraries. He is a partner at fsharpWorks (<a href=\"http://fsharpworks.com/\"><a href=\"http://fsharpworks.com\" class=\"linkified\">http://fsharpworks.com</a></a>) where he provides trainings and consulting services. Tomas recently submitted his PhD thesis at the University of Cambridge focused on context-aware programming, but his most recent writings also includes two essays try to understand programming through the perspective of philosophy of science.</i></p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/c/3/9/3/600_463790067.jpeg","height":null,"width":null}],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":3600000,"time":1502991000000,"title":"Tomas Petricek with \"Where Mathematics Comes From\" by G. Lakoff and R. Nunez"},"220542230":{"url":"https://www.meetup.com/Papers-We-Love-London/events/220542230/","description":"<p>Relational programming, or logic programming, is a programming paradigm that exhibits remarkable and powerful properties, to the extent that its implementation seems frightfully daunting to the layman. µKanren is a minimal relational language that seeks to strip the paradigm down to its core, leaving us with a succinct, elegant and above all <i>simple</i> set of primitives on top of which we can rebuild even the most powerful relational constructs.</p> <p>In this talk, we will explore the µKanren language by implementing it from first principles in a simple functional programming language, going on to demonstrate how you can assemble these simple building blocks into a semblance of its richer parent, miniKanren, and maybe solve a logic puzzle or two to make sure it’s working as advertised.</p> <p>The µKanren paper, and the original µKanren implementation, were authored by Jason Hemann and Daniel P. Friedman. The paper is available at <a href=\"http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf\"><a href=\"http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf\" class=\"linkified\">http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf</a></a>, and the Scheme implementation at <a href=\"https://github.com/jasonhemann/microKanren\"><a href=\"https://github.com/jasonhemann/microKanren\" class=\"linkified\">https://github.com/jasonhemann/microKanren</a></a>.</p> <p>About Bodil:<br/>A compulsive conference speaker in the fields of functional programming and internets technologies, and a co-organiser of multiple developer conferences in Scandinavia and the UK, mostly because she’s still learning how to stop.</p> ","photos":[],"venue":{"lat":51.50611877441406,"address1":"Notcutt House, 36 Southwark Bridge Road","address2":"SE1 9EU","name":"uSwitch","postalCode":null,"lon":-0.09585899859666824,"country":"gb","city":"London"},"utcOffset":0,"time":1424286000000,"title":"Bodil Stokke on µKanren: A Minimal Functional Core for Relational Programming"},"230301525":{"url":"https://www.meetup.com/Papers-We-Love-London/events/230301525/","description":"<p>We have EuroSys in town so a few peeps attending that are doing a CRDT themed social meet in <a href=\"http://www.taylor-walker.co.uk/pub/hoop-and-toy-kensington/c3067/\">Hoop and Toy</a> near South Kensington.</p> <p>\"Are you curious about CRDT research? Are you looking into this and related technologyto tackle scalability and latency reduction in a new system? </p> <p>If you are interested on an informal exchange of ideas about current trends on research and industry uses of Conflict-Free Replicated Data-Types (CRDTs), we are organizing a Get-together in central London on April 19th, starting around 17h00. Several of the initial researchers and early developers will attend, and will be open for chatting on new ideas or just help explain why a semi-lattice is cool. </p> ","photos":[],"venue":{"lat":51.49484634399414,"address1":"34 Thurloe Place","address2":"South Kensington","name":"Hoop and Toy","postalCode":null,"lon":-0.17426900565624237,"country":"gb","city":"London"},"utcOffset":3600000,"time":1461081600000,"title":"Conflict Free Synchronization Get-together"},"225291417":{"url":"https://www.meetup.com/Papers-We-Love-London/events/225291417/","description":"<p>The paper, by Melissa O’Neill, is available <a href=\"https://www.cs.hmc.edu/~oneill/papers/Sieve-JFP.pdf\">here</a>.</p> <p>I like it because I first read it not knowing Haskell very well and I read through the paper a few times and had a wonderful <i>a-ha</i> moment with a sentence or two that made the idea click and  was able to implement it in Python. I have since re-done it in Clojure so you will see it done 3 ways (and hopeful I will share an <i>a-ha</i> moment with you)</p> <p>\"\"\"A much beloved and widely used example showing the elegance and simplicity of lazy functional programming represents itself as \"The Sieve of Eratosthenes.\" The paper shows that this example is not the sieve and presents an implementation that actually is.\"\"\"</p> <p>Starting with the classic one-liner sieve </p> <p>sieve (p : xs) = p : sieve [x | x &lt;− xs, x ‘mod‘ p &gt; 0]</p> <p>primes = sieve [2..] </p> <p>O'Neill proceeds to show why this standard rendition of the Sieve of Eratosthenes does not in fact \"cross-off\" the multiples of each prime in the same way the \"real\" Sieve does.</p> <p><br/>She notes that <i>\"Some readers may feel that despite all of these concerns, the earlier algorithm is somehow <b>morally</b> the Sieve of Eratosthenes. I would argue, however, that they are confusing a mathematical abstraction drawn from the Sieve of Eratosthenes with the actual algorithm. The algorithmic details, such as how you remove all the multiples of 17, matter.\"</i></p> <p>As this is at Skills Matter please also <a href=\"https://skillsmatter.com/meetups/7328-papers-we-love-september-meet-up\">sign up there</a> </p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":3600000,"time":1442424600000,"title":"Tom Hall on 'The Genuine Sieve of Eratosthenes'"},"232484664":{"url":"https://www.meetup.com/Papers-We-Love-London/events/232484664/","description":"<p>As always, please <a href=\"https://skillsmatter.com/meetups/8284-papers-we-love-meetup\">sign up</a> at Skills Matter and thanks to them for hosting us!</p> <p><b>Tom Hall on Plank's \"A Tutorial on Reed-Solomon Coding for<br/>Fault-Tolerance in RAID-like Systems\"<br/></b></p> <p><br/>In what will be my last Papers We Love before taking a long overdue sabbatical and leaving the UK for a while I want to explain how RAID works, why we need it and why existing strategies may become less useful at protecting us from data loss.</p> <p>The paper [1] is for systems programmers, is quite accessible (modulo an error corrected in a follow-up 7 years later [2]) and explains a strategy to survive any number of disk failures by maintaining checksums using Galois Fields (which it also explains)</p> <p>You may find it useful to also look at 'The mathematics of RAID-6' [3] explaining what the linux kernels RAID6 implementation does.</p> <p>\n\n[1]: <a href=\"http://web.eecs.utk.edu/~plank/plank/papers/SPE-9-97.html\"><a href=\"http://web.eecs.utk.edu/~plank/plank/papers/SPE-9-97.html\" class=\"linkified\">http://web.eecs.utk.edu/~plank/plank/papers/SPE-9-97.html</a></a></p> <p>[2]: <a href=\"http://web.eecs.utk.edu/~plank/plank/papers/CS-03-504.html\"><a href=\"http://web.eecs.utk.edu/~plank/plank/papers/CS-03-504.html\" class=\"linkified\">http://web.eecs.utk.edu/~plank/plank/papers/CS-03-504.html</a></a></p> <p>[3]: <a href=\"https://www.kernel.org/pub/linux/kernel/people/hpa/raid6.pdf\"><a href=\"https://www.kernel.org/pub/linux/kernel/people/hpa/raid6.pdf\" class=\"linkified\">https://www.kernel.org/pub/linux/kernel/people/hpa/raid6.pdf</a></a></p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":3600000,"time":1469640600000,"title":"Tom Hall on Plank's \"A Tutorial on Reed-Solomon Coding for Fault-Tolerance...\""},"241268026":{"url":"https://www.meetup.com/Papers-We-Love-London/events/241268026/","description":"<p>Chris Ford (@ctford) is presenting the paper \"<b>Analysis by Compression</b>\" by David Meredith. <a href=\"http://www.titanmusic.com/papers/public/MeredithMEC2013ProceedingsPaper.pdf\">Please have a look at the paper here before the meeting</a>.</p> <p>• 6.30pm: pizza and drinks</p> <p>• 7:00pm: presentation starts</p> <p><b>Abstract</b></p> <p><i>In his paper 'Analysis by Compression', David Meredith wonders how are we supposed to decide which is “better”</i><i> if we are given two analyses of the same musical work.</i> His fascinating answer is to turn to complexity theory. Kolmogorov complexity analysis suggests that we can measure how well we understand a piece of music by the concision of a program that produces it. We can then compare programmatic 'explanations' of the same piece of music via their length.<i>Meredith also sketches a way to apply his insight to psychological coding theory of perceptual organisation. If you accept his argument, it shows that complexity theory is not something we impose upon music, but is fundamental to the act of musical appreciation.</i></p> <p><b>The Speaker</b></p> <p><i>Chris is a certified BABE (Bachelor of Arts, Bachelor of Engineering), and consequentially an idiophile and technophobe. He regards computers with fascination in theory and suspicion in practice. Chris began to make music with code to compensate for his poor piano technique. It was only later that he realised that programming offers deep insight into musical structure and theory. When he works, he works for ThoughtWorks, though that isn’t all the time.</i></p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/7/f/5/4/600_462812596.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/7/f/6/1/600_462812609.jpeg","height":null,"width":null}],"venue":{"lat":51.50333023071289,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07512100040912628,"country":"gb","city":"London"},"utcOffset":3600000,"time":1499967000000,"title":"Chris Ford with \"Analysis by Compression\" by David Meredith"},"183217332":{"url":"https://www.meetup.com/Papers-We-Love-London/events/183217332/","description":"<p>Ryan Kennedy from Yammer Engineering will presenting Dapper, a Large-Scale Distributed Systems Tracing Infrastructure paper by  Benjamin H. Sigelman, Luiz André Barroso, Mike Burrows, Pat Stephenson, Manoj Plakal, Donald Beaver, Saul Jaspan and Chandan Shanbhag.</p> <p>Doors open at 6:30 pm; the presentation will begin at 7:00 pm</p> <p>We hope that you'll read <a href=\"https://raw.githubusercontent.com/papers-we-love/papers-we-love/master/distributed_systems/dapper-a-large-scale-distributed-tracing-infrastructure.pdf\">the paper</a> before the Meetup (and if you don't, no worries).  </p> <p>\n\n\n\n<b>Ryan's Bio:</b><br/>Ryan Kennedy is an Infrastructure Engineer at Yammer in way over his head. When he's not busy cobbling together databases from the odds and ends he finds in Maven Central he can often be found scouring the world for inedible nachos.</p> ","photos":[],"venue":{"lat":51.50611877441406,"address1":"Notcutt House, 36 Southwark Bridge Road","address2":"SE1 9EU","name":"uSwitch","postalCode":null,"lon":-0.09585899859666824,"country":"gb","city":"London"},"utcOffset":3600000,"time":1402507800000,"title":"#2 Ryan Kennedy - Dapper, a Distributed Systems Tracing Infrastructure"},"247609472":{"url":"https://www.meetup.com/Papers-We-Love-London/events/247609472/","description":"<p>Bodil Stokke (<a href=\"https://bodil.lol\" class=\"linkified\">https://bodil.lol</a> and <a href=\"https://twitter.com/bodil\" class=\"linkified\">https://twitter.com/bodil</a>) presents the paper \"Basic Polymorphic Type Checking\" by Luca Cardelli. The paper is available here: <a href=\"http://lucacardelli.name/Papers/BasicTypechecking.pdf\" class=\"linkified\">http://lucacardelli.name/Papers/BasicTypechecking.pdf</a></p> <p>Abstract</p> <p>Cardelli's 1987 paper \"Basic Polymorphic Type Checking\" was, according to the author, the first attempt to explain the Hindley-Milner-Damas type system in a way that would be accessible to people who weren't either Hindley, Milner or Damas. It served as my first gentle introduction to the mysteries of type checking, back when I was obsessed with the conceit that the world needed another Lisp with a type system and I was going to have to build it (it would be called BODOL, because obviously).</p> <p>It was my first significant journey into the mysteries of type checking, to a large extent because it delivers what it promises on the tin: it's an explanation of a method for type checking and inference with parametric polymorphism that's accessible to the average programmer, as opposed to the average logician, and so I'd like to share that journey by walking through and implementing the described type checker with you, but maybe in a language more accessible to modern programmers than the Modula-2 of Cardelli's implementation.</p> <p>The Speaker</p> <p>Born into an aristocratic Russian-German family, Bodil (<a href=\"https://bodil.lol\" class=\"linkified\">https://bodil.lol</a> <a href=\"https://twitter.com/bodil\" class=\"linkified\">https://twitter.com/bodil</a>) traveled widely around the Soviet Union as a child. Largely self-educated, she developed an interest in computer science during her teenage years. According to her later claims, in 1989 she embarked on a series of world travels, visiting Europe, the Americas, and India. She alleged that during this period she encountered a group of mathematical adepts, the “Haskell Language and Library Committee,” who sent her to Glasgow, Scotland, where they trained her to develop her powers of category theory. Both contemporary critics and later biographers have argued that some or all of these foreign visits were fictitious, and that she spent this period writing JavaScript.</p> <p>Bodil was a controversial figure during her lifetime, championed by supporters as an enlightened guru and derided as a fraudulent charlatan by critics. Her doctrines influenced the spread of Homotopy Type Theory in the West as well as the development of Western computer science currents like dependent types, blockchains and isomorphic JavaScript.</p> <p>The meetup</p> <p>PapersWeLove (<a href=\"http://paperswelove.org\" class=\"linkified\">http://paperswelove.org</a>) London proudly brings to you the best papers every month! Please join us to read and discuss the most amazing ideas in computer science. We meet at ZPG (<a href=\"https://www.uswitch.com/about-us/contact-us/\" class=\"linkified\">https://www.uswitch.com/about-us/contact-us/</a>) offices near Tower Bridge (<a href=\"https://goo.gl/maps/qJXZek4fMNU2\" class=\"linkified\">https://goo.gl/maps/qJXZek4fMNU2</a>) with the following schedule:</p> <p>• 6.30pm: networking, pizza and drinks.<br/>• 7:00pm: presentation starts</p> ","photos":[],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":0,"time":1518721200000,"title":"Bodil Stokke on \"Basic Polymorphic Type Checking\" by Luca Cardelli"},"222094026":{"url":"https://www.meetup.com/Papers-We-Love-London/events/222094026/","description":"<p>Oliver Charles presents <a href=\"https://personal.cis.strath.ac.uk/conor.mcbride/Kleisli.pdf\">Conor McBride's \"Kleisli Arrows of Outrageous Fortune\"</a>. </p> <p><br/>For a long time, it wasn't clear how to get purely functional programs to actually \"do\" anything. Finally, a breakthrough came by sharing ideas from category theory to bring monads into functional programming, as a way to model and manage side effects. However, little has been done to ensure that entire interaction sequences <i>make sense</i>. For example, many functional programming languages will allow you to open a file handle, close it, and then try and read from it - clearly a nonsensical sequence of operations! In \"Kleisli Arrows of Outrageous Fortune\", Conor McBride shows us how we can borrow more ideas from the literature, introducing a new formulation of <i>indexed monads</i> - a structure with close connections to slice categories. Given these new tools, he demonstrates that these monads can correspond to enforcing logical properties - following in the tradition of propositions-as-types, we now have the ability to begin to encode Hoare logic pre- and post-conditions on our programs.</p> <p><br/>About Oliver:</p> <p>Ollie has always had an interest in functional programming and correctness from a very early age - puzzled by how easy it seemed to make things go wrong, even by accident! Currently, he's the lead Haskell developer at the London startup Fynder, and spends the rest of his free time either working on open-source Haskell libraries, or exploring the latest functional programming research. One day, he hope's write software he can truly believe in, but there's a long way to go...</p> ","photos":[],"venue":{"lat":51.50611877441406,"address1":"Notcutt House, 36 Southwark Bridge Road","address2":"SE1 9EU","name":"uSwitch","postalCode":null,"lon":-0.09585899859666824,"country":"gb","city":"London"},"utcOffset":3600000,"time":1432144800000,"title":"Oliver Charles on \"Kleisli Arrows of Outrageous Fortune\""},"228749056":{"url":"https://www.meetup.com/Papers-We-Love-London/events/228749056/","description":"<p>Phil Potter on Dolstra's \"The Purely Functional Software Deployment Model\"</p> <p>Don't forget to RSVP to Skillsmatter too: <a href=\"https://skillsmatter.com/meetups/7857-dolstra-s-the-purely-functional-software-deployment-model-p\"><a href=\"https://skillsmatter.com/meetups/7857-dolstra-s-the-purely-functional-software-deployment-model-p\" class=\"linkified\">https://skillsmatter.com/meetups/7857-dolstra-s-the-purely-functional-software-deployment-model-p</a></a></p> <p>This PhD thesis is about software deployment. Deployment is not often seen as an academic topic, but the reason I like this thesis is because it takes an academic approach of defining the problem carefully and choosing the correct abstractions, and in doing so enables the application of knowledge from other areas such as memory management and memoization to the seemingly unrelated field of deployment.</p> <p>The thesis collects the theoretical ideas together into a practical tool called nix, a package manager which is still in use today. </p> <p>You don't need to read the whole thesis for this talk!  It would be more than enough to read just Part 1 (ie chapters 1 and 2). Chapter 1 states the problem and reviews previous work, including other package managers. Chapter 2 gives a brief overview of the whole nix system.</p> <p><br/>Eelco Dolstra. The Purely Functional Software Deployment Model. PhD thesis, Faculty of Science, Utrecht, The Netherlands. January 2006. <br/>ISBN[masked]-3.</p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":0,"time":1455733800000,"title":"Phil Potter on Dolstra's \"The Purely Functional Software Deployment Model\""},"231247776":{"url":"https://www.meetup.com/Papers-We-Love-London/events/231247776/","description":"<p><i>As always, please sign up <a href=\"https://skillsmatter.com/meetups/8148-papers-we-love\">on Skills Matter</a> too.</i></p> <p><br/>Sorry for the short notice. As Tom mentioned at the end of our meetup on Tuesday, we've got a bonus speaker for May!</p> <p>At this meetup, Gareth Morgan will presenting on <a href=\"http://www.cs.rpi.edu/~cutler/classes/advancedgraphics/S08/lectures/kajiya.pdf\">The Rendering Equation</a>.  This paper is one of the most important 3D graphics papers in the subject's history. The rendering equation put forth by James Kajiya is the foundation of many of the rendering techniques used in modern graphics. Anytime a computer generates physically accurate image it is actually attempting to solve the rendering equation.</p> <p><a href=\"https://twitter.com/griffin1977\">Gareth</a> has been involved in games and 3D graphics since 1999, starting at Silicon Graphics followed by several games companies. He spent eight years at Imagination Technologies researching sophisticated GPU rendering techniques using their ray tracing technology. Currently he is co-founder and CEO at Axum Graphics, developing 3D content creation tools for VR filmmakers.</p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":3600000,"time":1464197400000,"title":"Gareth Morgan on \"The Rendering Equation\" by James Kajiya"},"246639398":{"url":"https://www.meetup.com/Papers-We-Love-London/events/246639398/","description":"<p>Neil Brown (<a href=\"https://academiccomputing.wordpress.com\" class=\"linkified\">https://academiccomputing.wordpress.com</a>) presents a talk about the paper \"An Empirical Investigation into Programming Language Syntax\" by Stefik and Siebert (<a href=\"https://dl.acm.org/citation.cfm?id=2534973&amp;CFID=849175684&amp;CFTOKEN=92613695\" class=\"linkified\">https://dl.acm.org/citation.cfm?id=2534973&amp;CFID=849175684&amp;CFTOKEN=92613695</a>).</p> <p>Abstract</p> <p>Program code has a dual aspect: it is understandable both by computers and by humans. Ever since computing moved on from directly entering numerical opcodes, we have had increasingly free rein to design for the humans more than the machines. However, this has been done in an evidence-free manner: designers choose keywords and notations without scientifically testing any aspects of their usability. This paper, \"An Empirical Investigation into Programming Language Syntax\" by Stefik and Siebert, aims to address this issue by scientifically comparing programming language syntax usability for novices.</p> <p>In this talk, I will summarise the methods and key results of the paper -- but just as interesting are the broader questions raised by the paper. Are all programming languages less usable than they could be? Should programming language and tool design become more scientific? What role should evidence have in design?</p> <p>This talk should be of interest to anyone who has ever done a little programming, and will be especially thought-provoking for those who have ever tried to teach programming to friends, relatives, colleagues, or students.</p> <p>The meetup</p> <p>PapersWeLove (<a href=\"http://paperswelove.org\" class=\"linkified\">http://paperswelove.org</a>) London proudly brings to you the best papers every month! Please join us to read and discuss the most amazing ideas in computer science. We meet at ZPG (<a href=\"https://www.uswitch.com/about-us/contact-us/\" class=\"linkified\">https://www.uswitch.com/about-us/contact-us/</a>) offices near Tower Bridge (<a href=\"https://goo.gl/maps/qJXZek4fMNU2\" class=\"linkified\">https://goo.gl/maps/qJXZek4fMNU2</a>) with the following schedule:</p> <p>• 6.30pm: networking, pizza and drinks.<br/>• 7:00pm: presentation starts</p> <p>The Speaker</p> <p>Neil (<a href=\"http://www.twistedsquare.com\" class=\"linkified\">http://www.twistedsquare.com</a>) works as a computing education researcher at King's College London; his role combines software development and writing research papers. He works as part of a team which develops two IDEs aimed at novice programmers: BlueJ (<a href=\"https://www.bluej.org\" class=\"linkified\">https://www.bluej.org</a>) and Greenfoot (<a href=\"https://www.greenfoot.org/door\" class=\"linkified\">https://www.greenfoot.org/door</a>). He also helps to maintain a large-scale repository of data on novice programmer activity, collected from BlueJ, which contains details of activity from over a million users.</p> ","photos":[],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":0,"time":1516300200000,"title":"Programming Language Design: The Missing Evidence"},"246935780":{"url":"https://www.meetup.com/Papers-We-Love-London/events/246935780/","description":"<p>Chas Emerick (<a href=\"http://cemerick.com\" class=\"linkified\">http://cemerick.com</a> &amp; <a href=\"http://twitter.com/cemerick\" class=\"linkified\">http://twitter.com/cemerick</a>) presents a survey of metric and spatial data structures, guided by the book 'Foundations of Multidimensional and Metric Data Structures' by Hanan Samet, with particular details on two data structures and their papers:</p> <p>* 'Corner Stitching: A Data-Structuring Technique for VLSI Layout Tools' by Ousterhout, (<a href=\"https://www2.eecs.berkeley.edu/Pubs/TechRpts/1983/CSD-83-114.pdf\" class=\"linkified\">https://www2.eecs.berkeley.edu/Pubs/TechRpts/1983/CSD-83-114.pdf</a>)<br/>* 'R-trees: A Dynamic Index Structure for Spatial Searching' by Guttman,(<a href=\"https://klevas.mif.vu.lt/~algis/DSA/guttman.pdf\" class=\"linkified\">https://klevas.mif.vu.lt/~algis/DSA/guttman.pdf</a>)</p> <p>Abstract</p> <p>Most of us are familiar with the notion of indexes thanks to databases, but that exposure belies the rich kaleidoscope of techniques available to provide efficient representations of how objects and entities relate to each other or to the space that they occupy. Disciplines as varied as computer graphics, GIS, gaming, bioinformatics, and document analysis and layout have their own unique demands and data modeling requirements which have driven the development of hundreds of different ways to \"index\" their respective data. This presentation will touch on a dozen different such approaches, sketching out their strengths and tradeoffs and common applications, all Samet's encyclopedic survey of the field. We'll also do deeper dives into a couple of the papers it cites that describe data structures you indirectly rely upon every day via mapping services and digital circuit design and fabrication.</p> <p>The meetup</p> <p>PapersWeLove (<a href=\"http://paperswelove.org\" class=\"linkified\">http://paperswelove.org</a>) London proudly brings to you the best papers every month! Please join us to read and discuss the most amazing ideas in computer science. We meet at ZPG (<a href=\"https://www.uswitch.com/about-us/contact-us/\" class=\"linkified\">https://www.uswitch.com/about-us/contact-us/</a>) offices near Tower Bridge (<a href=\"https://goo.gl/maps/qJXZek4fMNU2\" class=\"linkified\">https://goo.gl/maps/qJXZek4fMNU2</a>) with the following schedule:</p> <p>• 6.30pm: networking, pizza and drinks.<br/>• 7:00pm: presentation starts</p> <p>The Speaker</p> <p>Chas Emerick (<a href=\"http://cemerick.com\" class=\"linkified\">http://cemerick.com</a> &amp; <a href=\"http://twitter.com/cemerick\" class=\"linkified\">http://twitter.com/cemerick</a>) is a software engineer who has been building systems to analyze and consume PDF documents for 15 years, now with PDFDATA.io<br/>(<a href=\"https://www.PDFDATA.io\" class=\"linkified\">https://www.PDFDATA.io</a>). His other interests include compilers, programming language theory, distributed systems, database implementation, future computing of all sorts, circuit design via FPGAs,<br/>ethics in technology, and radical politics.</p> ","photos":[],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":0,"time":1517337000000,"title":"A survey of spatial data structures and their applications"},"243275402":{"url":"https://www.meetup.com/Papers-We-Love-London/events/243275402/","description":"<p><b><a href=\"http://lukechurchnet.appspot.com/\">Luke Church</a> presents: \"<a href=\"https://liveprogramming.github.io/2013/papers/liveness.pdf\">A perspective on the evolution of live programming</a>\", a paper by S.L. Tanimoto</b></p> <p>PapersWeLove London proudly brings to you the best papers every month! Please join us to read and discuss the most amazing ideas in computer science. We are meeting at the <a href=\"https://www.google.co.uk/maps/place/uSwitch/@51.5035192,-0.0775132,17z/data=!3m1!4b1!4m5!3m4!1s0x487604a8407ed955:0xffe5a6fc4b8acff3!8m2!3d51.5035192!4d-0.0753192?hl=en\">uSwtich offices</a> near Tower Bridge with the following schedule:</p> <p>• 6.30pm: networking, pizza and drinks.</p> <p>• 7:00pm: presentation starts</p> <p>Abstract</p> <p>Live programming, or the art and science of changing programs as they're running, is a subject of increasing interest to a wide audience, including musicians, scientists, compiler engineers and UI designers.<br/>In this paper, Steven Tanimoto considers the strengths and challenges of live programming and extends his original taxonomy of the 'levels of liveness' to include predictive systems.<br/>In the talk, I'll outline what live programming is, discuss the taxonomy and give demos of systems at the various levels of liveness. I'll conclude with a consideration of how the higher levels of liveness might be a productive avenue by which to explore a unification of machine learning and programming.</p> <p>The Speaker</p> <p><a href=\"http://www.lukechurch.net/\">Luke</a> is a researcher at the University of Cambridge and Google. He studies cognitive, social and philosophical issues that affect the usability of programming. Luke is primarily interested in broadening the availability of programming by building systems that let people change their mind.</p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":null,"postalCode":null,"lon":null,"country":false,"city":false},"utcOffset":3600000,"time":1506015000000,"title":"Luke Church with \"A perspective on the evolution of live programming\""},"226303374":{"url":"https://www.meetup.com/Papers-We-Love-London/events/226303374/","description":"<p>This is at Skills Matter so you will need to sign up there too <a href=\"https://skillsmatter.com/meetups/7466-camilla-montonen-support-vector-machines-and-kernels-for-computational-biology\" class=\"linkified\">https://skillsmatter.com/meetups/7466-camilla-montonen-support-vector-machines-and-kernels-for-computational-biology</a> Thanks!</p> <p>Ben­Hur A, Ong CS, Sonnenburg S, Schölkopf B, Rätsch G (2008) Support Vector Machines and Kernels for Computational Biology.</p> <p><a href=\"http://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1000173\" class=\"linkified\">http://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1000173</a></p> <p>The widespread adoption of high­throughput sequencing machinery has produced an unprecedented amount of genomic data for biologists to analyse. To fully leverage the potential patterns hidden in the petabytes of DNA and RNA sequence information requires the use of machine learning algorithms and specialised kernels, which can capture the valuable domain knowledge provided by biological scientists. A common problem in computational biology is that of binary classification. Support vector machines (SVMs) have achieved good results in this domain and have thus been eagerly adopted by computational biology researchers. Ben­Hur et al provide a gentle introduction to support vector machines and kernels in the context of binary biological prediction problems.</p> <p>To explain the concepts of large margin separation and kernel functions, Ben­Hur et al use a computational biology problem known as splice­site recognition. In eukaryotic organisms, the process of gene expression involves transcribing a sequence of DNA into a molecule known as premature mRNA. Premature mRNA contains two types of regions: coding regions known as exons and 'junk' regions known as introns. The boundary of these two sites is often recognized by the presence of specific dimers GT and AG at these sites. However, only 0.1%–1% of occurrences of these dimers in the genome represent true locations of splice sites, which leads to an interesting question: Can we use support vector machines to help classify sites as splice sites and non­splice sites?</p> <p>Ben­Hur et al explain the principles of maximum margin separation, kernel functions and classifier performance by exploring various aspects of this question. The paper is a great and gentle introduction into the world of support vector machines and also gives insight into some cool applications of machine learning technology. Moreover all of the data and code used in the paper is open­source. In six words: this is a paper to love!</p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":0,"time":1447871400000,"title":"Camilla Montonen-Support Vector Machines and Kernels for Computational Biology."},"229221711":{"url":"https://www.meetup.com/Papers-We-Love-London/events/229221711/","description":"<p><b>Fouad Mardini on \"Worst-case analysis of a new heuristic for the traveling salesman problem\" by Nicos Christofides</b></p> <p>The Traveling Salesman Problem might very well be the most studied problem in combinatorial optimization. Much of this interest comes from the fact that the TSP is an NP hard problem, yet the TSP is studied on its own merits as it has applications in many fields.</p> <p>We will use the paper of Christofides as a starting point to discuss the NP complexity class and approximation algorithms to intractable problems. Christofides algorithm is simple and elegant, yet gives the best known approximation ratio for the symmetric TSP.</p> <p>Along the way we will detour into graph matchings and other interesting tidbits such as Aurora's Euclidean TSP approximation scheme and the Held-Karp LP relaxation.</p> <p>If you are coming, please sign up at Skills Matter also <a href=\"https://skillsmatter.com/meetups/7906-worst-case-analysis-of-a-new-heuristic-for-the-traveling-salesman-problem-by-nicos-christofides\" class=\"linkified\">https://skillsmatter.com/meetups/7906-worst-case-analysis-of-a-new-heuristic-for-the-traveling-salesman-problem-by-nicos-christofides</a>  </p> <p>\n\n\n<b>Fouad Mardini</b> currently works as a software engineer in London. He recently finished studying for a Masters in CS at Bonn, where he developed his interest in combinatorial optimization.</p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":0,"time":1458153000000,"title":"Fouad Mardini on Christofides on The Travelling Salesman"},"240577437":{"url":"https://www.meetup.com/Papers-We-Love-London/events/240577437/","description":"<p>Thomas Depierre (@DianaOlympos) will be presenting the paper \"<b>Programming with Abstract Data Types</b>\" by B. Liskov and S. Zilles 1974\", available here for reading before the meetup:</p> <p><a href=\"http://web.cs.iastate.edu/~hridesh/teaching/362/07/01/papers/p50-liskov.pdf\"><a href=\"http://web.cs.iastate.edu/~hridesh/teaching/362/07/01/papers/p50-liskov.pdf\" class=\"linkified\">http://web.cs.iastate.edu/~hridesh/teaching/362/07/01/papers/p50-liskov.pdf</a></a></p> <p>Along the course of the past 50 years, programming centred mainly around abstraction, being for control flow, operations to execute or data objects and structure. In this foundational paper, B. Liskov and S. Zilles described a concept that is now so deeply embedded into our programming ecosystem that we forget why it was even invented. Come join us to explore what Abstract Data Types still have to teach us.</p> <p><b>About Thomas</b>:</p> <p>Coming from a background of maths and EE, Thomas ended up as a Maker at Ascential because he wants to make systems works. Which should tells you how much he loves the mess the field of computing is in. He could dissert on Linear Algebra as much as on the state of magic in Science Fiction, but you would have to offer him a tea to get him that far. Or you can ask him about System Safety and Human Factors and lose a couple hours to a rant on how bad our software is. Up to you.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/4/9/d/8/600_461958904.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/7/a/1/2/600_461971250.jpeg","height":null,"width":null}],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":3600000,"time":1497547800000,"title":"Thomas Depierre with \"Programming with Abstract Data Type\" by Barbara Liskov"},"243775403":{"url":"https://www.meetup.com/Papers-We-Love-London/events/243775403/","description":"<p><a href=\"https://www.microsoft.com/en-us/research/people/simonpj/\">Simon Peyton Jones</a> presents: \"<b>Getting from A to B: fast route-finding using slow computers</b>\", a talk inspired by \"<a href=\"https://www.microsoft.com/en-us/research/wp-content/uploads/2004/07/tr-2004-24.pdf\">Computing the shortest path: A* search meets graph theory</a>\" paper (Andrew V Goldberg and Chris Harrelson).</p> <p><b>[WARNING]</b> Unfortunately, because of building and safety regulations<b>, we are forced to a max number of 100 people in the room. </b>Please be aware that we will be <b>forced to leave people out</b> if we reach that number<b>. </b>I'm really sorry for this drastic decision but there is no way to predict how many people will show up.</p> <p><b>Abstract</b></p> <p>We all now take it for granted that online maps will rapidly display a fast route from A to B. But these maps are gigantic: a map of Europe has 20 million intersections and 40 million road segments. How can a computer find the shortest path in such a large map, without examining all those intersections and roads?</p> <p><br/>This is a classic graph problem, known as the Shortest Path problem, with solutions that date back to 1960. But in the last couple of decades there has been significant progress that dramatically speeds up the solution.</p> <p><br/>In this talk I'll explain both the old solutions and the new cool ideas. I hope you'll go away with a clear example of how some clever computer science can take a problem that previously required a big, fast computer, and make it fast enough to run on a slow, mobile device.</p> <p><b>Meetup</b></p> <p><a href=\"http://paperswelove.org\">PapersWeLove</a> London proudly brings to you the best papers every month! Please join us to read and discuss the most amazing ideas in computer science. We are meeting at <a href=\"https://www.uswitch.com/about-us/contact-us/\">uSwitch - ZPG</a> offices <a href=\"https://goo.gl/maps/qJXZek4fMNU2\">near Tower Bridge</a> with the following schedule:</p> <p><br/>• <b>6.30pm</b>: networking, pizza and drinks.</p> <p>• <b>7:00pm</b>: presentation starts</p> <p>\n\n\n<b>The Speaker</b></p> <p><a href=\"https://en.wikipedia.org/wiki/Simon_Peyton_Jones\">Simon Peyton Jones</a>, MA, MBCS, CEng, graduated from Trinity College Cambridge in 1980. Simon was a key contributor to the design of the now-standard functional language Haskell, and is the lead designer of the widely-used Glasgow Haskell Compiler (GHC). He has written two textbooks about the implementation of functional languages.</p> <p><br/>After two years in industry, he spent seven years as a lecturer at University College London, and nine years as a professor at Glasgow University before moving to Microsoft Research (Cambridge) in 1998.</p> <p><br/>His main research interest is in functional programming languages, their implementation, and their application. He has led a succession of research projects focused around the design and implementation of production-quality functional-language systems for both uniprocessors and parallel machines.</p> <p><br/>More generally, he is interested in language design, rich type systems, software component architectures, compiler technology, code generation, runtime systems, virtual machines, and garbage collection. He is particularly motivated by direct use of principled theory to practical language design and implementation -- that's one reason he loves functional programming so much.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/9/0/2/7/600_465456903.jpeg","height":null,"width":null}],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":3600000,"time":1508434200000,"title":"Simon Peyton Jones: \"Getting from A to B: fast route-finding on slow computers\""},"248467200":{"url":"https://www.meetup.com/Papers-We-Love-London/events/248467200/","description":"<p>Nicola Mometto (<a href=\"https://twitter.com/Bronsa_\" class=\"linkified\">https://twitter.com/Bronsa_</a>) presents a talk on \"The Kanren family of languages, a deep dive in μKanren\" inspired by the paper \"μKanren: A Minimal Functional Core for Relational Programming\" by J. Hemann and D. P. Friedman. The paper is available here: <a href=\"http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf\" class=\"linkified\">http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf</a></p> <p>Abstract</p> <p>Kanren is a family of logic and relational programming language, the most known and used dialect is miniKanren, but several others exist.<br/>In this talk we'll go over the history of the Kanren family and we'll dive into the elegant and beautiful implementation of μKanren, an intentionally minimal and compact kernel for Kanren dialects, implementing complete relational semantics in just over 50 lines of code.</p> <p>The Speaker</p> <p>Nicola Mometto is a software developer with interests in functional programming, languages (particularly LISPs) and compiler design. He has developed and maintained several widely used static analysis libraries for Clojure, and is a frequent contributor to the Clojure language. Currently he works at <a href=\"https://www.imandra.ai/\" class=\"linkified\">https://www.imandra.ai/</a> as a R&amp;D engineer working mostly in OCaml at formally verifying financial algorithms.</p> <p>The meetup</p> <p>PapersWeLove (<a href=\"http://paperswelove.org\" class=\"linkified\">http://paperswelove.org</a>) London proudly brings to you the best papers every month! Please join us to read and discuss the most amazing ideas in computer science. We meet at ZPG (<a href=\"https://www.uswitch.com/about-us/contact-us/\" class=\"linkified\">https://www.uswitch.com/about-us/contact-us/</a>) offices near Tower Bridge (<a href=\"https://goo.gl/maps/qJXZek4fMNU2\" class=\"linkified\">https://goo.gl/maps/qJXZek4fMNU2</a>) with the following schedule:</p> <p>• 6.30pm: networking, pizza and drinks.<br/>• 7:00pm: presentation starts</p> ","photos":[],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":0,"time":1521138600000,"title":"Nicola Mometto on \"The Kanren family of languages, a deep dive in μKanren\""},"231387541":{"url":"https://www.meetup.com/Papers-We-Love-London/events/231387541/","description":"<p>Please sign up at <a href=\"https://skillsmatter.com/meetups/8146-papers-we-love-meetup\">Skills Matter</a> also</p> <p>\n\n\nCertain papers change your life. McCarthy’s ‘Recursive Functions of Symbolic Expressions and their Computation by Machine (Part I)’ (1960) changed mine, and so did Landin’s ‘The Next 700 Programming Languages’ (1966). And I remember the moment, halfway through my graduate career, when Guy Steele handed me Reynolds’s ‘Definitional Interpreters for Higher-Order Programming Languages’ (1972).</p> <p>It is now common to explicate the structure of a programming language by presenting an interpreter for that language. If the language interpreted is the same as the language doing the interpreting, the interpreter is called <i>meta-circular</i>. </p> <p>Interpreters may be written at differing levels of detail, to explicate different implementation strategies. For instance, the interpreter may be written in a <i>continuation-passing style</i>; or some of the higher-order functions may be represented explicitly using data-structures, via <i>defunctionalisation</i>. </p> <p>More elaborate interpreters may be derived from simpler versions, thus providing a methodology for discovering an implementation strategy and showing it correct. Each of these techniques has become a mainstay of the study of programming languages, and all of them were introduced in this single paper by Reynolds.</p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":3600000,"time":1465320600000,"title":"Philip Wadler - Definitional Interpreters for Higher-Order Programming Languages"},"218580993":{"url":"https://www.meetup.com/Papers-We-Love-London/events/218580993/","description":"<p>Ricardo Monti from Imperial College London will presenting Distributed Optimization and Statistical Learning via the Alternating Direction Method of Multipliers by Stephen Boyd, Neal Parikh, Eric Chu, Borja Peleato and Jonathan Eckstein.</p> <p><br/>Doors open at 6:30 pm; the presentation will begin at 7:00 pm.</p> <p>We hope that you'll take a look at <a href=\"http://stanford.edu/~boyd/papers/pdf/admm_distr_stats.pdf\">the paper</a> before the Meetup (and if you don't, no worries).</p> <p>\n\n\n\nMany modern statistics and machine learning problems can be recast as optimization problems where we look to minimize a convex objective function.</p> <p>The resulting objective function enforces a set of desirable properties which we wish our answer to possess: a popular example would be sparsity (i.e., we wish to obtain a sparse answer for reasons of interpretability or for other reasons).</p> <p>However, it is often the case that minimizing such objective functions is difficult. While there have been many solutions proposed in the literature, each of these tends to focus on a specific problem.</p> <p>The proposed paper describes a powerful optimization algorithm called the Alternating Directions Method of Multipliers (ADMM) - a conceptually simple method with which to solve a wide range of convex optimization problems  in an \"off-the-shelf\" manner.</p> <p>The ADMM algorithm works by exploiting the separable structure of many objective functions. By splitting the objective into a likelihood term and a penalization term, it is able to iteratively minimize the objective function with respect to each. As it turns out, each of these optimization steps is usually much simpler than the original problem (and in many cases has a closed form solution!). As a result, complex, high-dimensional problems can be broken down into a series of simple, 1-dimensional problems.</p> ","photos":[],"venue":{"lat":51.50611877441406,"address1":"Notcutt House, 36 Southwark Bridge Road","address2":"SE1 9EU","name":"uSwitch","postalCode":null,"lon":-0.09585899859666824,"country":"gb","city":"London"},"utcOffset":0,"time":1421865000000,"title":"#3 Ricardo Monti - Distributed Optimization and Statistical Learning"},"230572344":{"url":"https://www.meetup.com/Papers-We-Love-London/events/230572344/","description":"<p>As ever, please <a href=\"https://skillsmatter.com/meetups/8110-end-to-end-arguments-in-system-design-by-saltzer-reed-and-clark\">sign up</a> at Skills Matter too.</p> <p>In \"End-to-End Arguments In System Design\", Saltzer, Reed, and Clark argue that building a robust and scalable system comes from pushing work to the edges of a system. or if you like: why bittorrent worked and multicast continues to fail.</p> <p><a href=\"https://t.co/2WZcNCsLWK\"><a href=\"http://web.mit.edu/Saltzer/www/publications/endtoend/endtoend.pdf\" class=\"linkified\">http://web.mit.edu/Saltzer/www/publications/endtoend/endtoend.pdf</a> …</a></p> <p>tef will also be arguing the same thing, but saying things out loud rather than writing things down.</p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":3600000,"time":1463506200000,"title":"tef on \"End-to-End Arguments In System Design\" by Saltzer, Reed, and Clark"},"225736762":{"url":"https://www.meetup.com/Papers-We-Love-London/events/225736762/","description":"<p><b>The speaker:</b></p> <p>Emily was until recently a Backend Engineer in SoundCloud's Data Team. Before that she was a Haskell developer for a Swedish e-signing startup, and before that she was a developer for a variety of financial institutions. She lives in London, and likes gardening and hanging out with her cat Albertina.</p> <p><b>The Paper:</b></p> <p>Leslie Lamport. 1998. The Part Time Parliament</p> <p><br/><a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/lamport-paxos.pdf\"><a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/lamport-paxos.pdf\" class=\"linkified\">http://research.microsoft.com/en-us/um/people/lamport/pubs/lamport-paxos.pdf</a></a></p> <p><br/>The Paxos algorithm is a consensus algorithm that’s considered one of the most important in distributed computing. Cassandra uses it for <a href=\"http://www.datastax.com/dev/blog/lightweight-transactions-in-cassandra-2-0\">transactions</a>, <a href=\"https://cwiki.apache.org/confluence/display/ZOOKEEPER/Zab+vs.+Paxos\">zookeeper</a>'s Zab is based on it. This was the original paper that introduced it.</p> <p>The Part Time Parliament paper is utterly charming and very funny (when you’re in on the joke). It’s written in the style of an archeologist uncovering the workings of the parliament of the ancient civilisation of the island of Paxos. The implications for computer science are left until the end of the paper.</p> <p>The paper had a bumpy road to recognition, originally written in 1989, it was initially quite misunderstood - we’re going to look a bit more at its history.</p> <p>We will be discussing the nature of the parliament of ancient Paxos, and how this relates to distributed systems. We’ll then look at second section of the paper that discusses how the ancient Paxos synod worked. The synod algorithm sits at the heart of the Paxos algorithm, so understanding this is a key piece of understanding the whole thing.</p> <p>We won’t be looking at the rest of the paper, and Paxos algorithm, because it’s very long and complicated, and honestly I don’t understand it (yet) - Paxos is notoriously hard to understand and implement. But hopefully everyone will enjoy finding out about this creative and fun paper, and will come out with a solid understanding at least part of the algorithm.</p> <p>As it is at Skills Matter, please sign up with them also <a href=\"https://skillsmatter.com/meetups/7399-emily-green-on-the-part-time-parliament-paxos\"><a href=\"https://skillsmatter.com/meetups/7399-emily-green-on-the-part-time-parliament-paxos\" class=\"linkified\">https://skillsmatter.com/meetups/7399-emily-green-on-the-part-time-parliament-paxos</a></a></p> ","photos":[],"venue":{"lat":51.518890380859375,"address1":"10 South Place","address2":null,"name":"Skills Matter at CodeNode","postalCode":null,"lon":-0.08656299859285355,"country":"gb","city":"London"},"utcOffset":3600000,"time":1445450400000,"title":"Emily Green on The Part-Time Parliament (Paxos)"},"170910742":{"url":"https://www.meetup.com/Papers-We-Love-London/events/170910742/","description":"<p><b>Equal Rights for Functional Objects, or, The More Things Change, the More they Stay the Same</b></p> <p>There are many ways of defining equality, particularly in a language which has both object-oriented and functional aspects. There's reference equality, numerical equality, shallow list equality, deep list equality, string equality, and even \"fuzzy\" floating-point equality. Which is the right to choose in any given situation? Which should i use for my equals() method on my custom object?</p> <p>This paper answers all of these questions, by taking a seemingly complex problem and revealing an underlying simplicity. It does this by defining one equality operation that works in any situation.</p> <p>The paper makes use of lisp syntax, but the ideas are applicable to most modern languages.</p> <p>\n\n\n\n\n\n\nCan anyone sponsor pizza and drinks? Makes it much easier for me to host more things at uSwitch if someone else covers the food.</p> ","photos":[],"venue":{"lat":51.50611877441406,"address1":"Notcutt House, 36 Southwark Bridge Road","address2":"SE1 9EU","name":"uSwitch","postalCode":null,"lon":-0.09585899859666824,"country":"gb","city":"London"},"utcOffset":3600000,"time":1400088600000,"title":"#1 Philip Potter - Equal Rights for Functional Objects"},"239664173":{"url":"https://www.meetup.com/Papers-We-Love-London/events/239664173/","description":"<p>What happened in the basements of the AI lab at MIT in the late '50 is truly inspiring and this paper is telling us that story. Herbert Stoyan spent many years researching those early days and even McCarthy is pointing at his work in his papers!</p> <p><br/>Lisp is one of the oldest languages out there. When I started learning about functional programming, I got interested in why Lisp languages are what they are today, what's the relationship with AI, what lambda calculus has to do with this, or why I kept hearing things like \"Lisp has failed\".</p> <p>Surprisingly, many concepts that we give for granted in functional programming today were there almost 60 years ago! </p> <p>The paper is quite accessible and a good start for the new season of PWL. Some Lisp sources will be presented but there is no need to have a deep knowledge of the language. An html version of the paper is available at </p> <p>&lt;a&gt;<a href=\"https://web.archive.org/web/20050405213907/http://www8.informatik.uni-erlangen.de/html/lisp/histlit1.html&lt;/a&gt\" class=\"linkified\">https://web.archive.org/web/20050405213907/http://www8.informatik.uni-erlangen.de/html/lisp/histlit1.html&lt;/a&gt</a>; </p> <p>uSwitch is providing pizza and beverages. Please remember to RSVP.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/d/3/2/600_460983378.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/9/4/f/0/600_461078128.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/9/b/d/2/600_461079890.jpeg","height":null,"width":null}],"venue":{"lat":51.50352096557617,"address1":"The Cooperage, 5 Copper Row, London, SE1 2LH ","address2":null,"name":"uSwitch","postalCode":null,"lon":-0.07531899958848953,"country":"gb","city":"London"},"utcOffset":3600000,"time":1495128600000,"title":"Renzo Borgatti on \"Early Lisp History (1956 - 1959)\" by Herbert Stoyan"},"220691457":{"url":"https://www.meetup.com/Papers-We-Love-London/events/220691457/","description":"<p>In ‘the real world’, nothing is simple and failure is unavoidable. “How Complex Systems Fail” was discovered by Adam when he followed a reference in a database book. It expanded his mind on the similarities between hospitals, nuclear weapons, and databases, and now he’d like to share these with you.</p> <p><br/>The paper is available at <a href=\"http://webyrd.net/scheme-2013/papers/HemannMuKanren2013.pdf\">&lt;/a&gt;&lt;a href=\"http://web.mit.edu/2.75/resources/random/How%20Complex%20Systems%20Fail.pdf\"&gt;<a href=\"http://web.mit.edu/2.75/resources/random/How%20Complex%20Systems%20Fail.pdf\" class=\"linkified\">http://web.mit.edu/2.75/resources/random/How%20Complex%20Systems%20Fail.pdf</a></a> . Its subtitle, \"Being a Short Treatise on the Nature of Failure;<br/>How Failure is Evaluated; How Failure is Attributed to Proximate<br/>Cause; and the Resulting New Understanding of Patient Safety\", serves as a brief abstract.</p> <p><br/>About Adam:</p> <p>Having started programming at the age of 8, Adam has nearly got the hang of running a website. Please don't invent anything that makes this harder for him.</p> ","photos":[],"venue":{"lat":51.50611877441406,"address1":"Notcutt House, 36 Southwark Bridge Road","address2":"SE1 9EU","name":"uSwitch","postalCode":null,"lon":-0.09585899859666824,"country":"gb","city":"London"},"utcOffset":0,"time":1426705200000,"title":"Adam Johnson on How Complex Systems Fail"}}