{"236147759":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/236147759/","description":"<p>Rupert Brooks will present \"<a href=\"http://bigwww.epfl.ch/publications/unser9502.pdf\">Convolution-Based Interpolation for Fast, High-Quality Rotation of Images</a>\", by Unser et al.  This paper considers a long line of methods for performing image rotation by factoring the rotation into two or more 1D transformations, and addresses the question of how to perform those 1D translations in the highest quality way.</p> <p>While several authors have proposed these types of decompositions for image rotation, the paper by Paeth (<a href=\"http://www.cipprs.org/papers/VI/VI1986/pp077-081-Paeth-1986.pdf\">A Fast Algorithm for General Raster Rotation</a>) is one of the most commonly applied.  (Also revised and updated as article III.6 in the original Graphics Gems.)  It may be helpful to read that paper in preparation for this one.</p> <p>The presentation will include digging into some open source packages to see what they actually do.</p> ","photos":[],"venue":{"lat":45.50035095214844,"address1":"460 McGill, Suite 200","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.55908966064453,"country":"ca","city":"Montréal"},"utcOffset":-18000000,"time":1485385200000,"title":"Convolution-Based Interpolation for Fast, High-Quality Rotation of Images"},"232100387":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/232100387/","description":"<p>Soufiane Khiat will present papers on the state of the art in material description: <a href=\"https://eheitzresearch.wordpress.com/240-2/\"><a href=\"https://eheitzresearch.wordpress.com/240-2/\" class=\"linkified\">https://eheitzresearch.wordpress.com/240-2/</a></a> and possibly also <a href=\"https://drive.google.com/file/d/0BzvWIdpUpRx_dXJIMk9rdEdrd00/view\"><a href=\"https://drive.google.com/file/d/0BzvWIdpUpRx_dXJIMk9rdEdrd00/view\" class=\"linkified\">https://drive.google.com/file/d/0BzvWIdpUpRx_dXJIMk9rdEdrd00/view</a></a></p> <p>\n\nThis should be a good follow-up to Jeff's talk on Metropolis Light Transport.  Those interested in graphics, physics, or probabilistic methods should certainly attend!  I'm sure there will be interesting implementation details, too.</p> <p>\n\n\nIf you aren't sure where to start with these papers, try sections 4 (Insight and Overview) and 7 (Random Walk on the Microsurface) of the first paper.</p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1469052000000,"title":"Multiple-Scattering Microfacet BSDFs with the Smith Model"},"243920859":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/243920859/","description":"<p>Hanneli Tavante will present <i>Ideal Theory in Rings by Emily Noether<br/></i></p> <p>[Translated by D. Berlyne] </p> <p><a href=\"https://arxiv.org/pdf/1401.2577.pdf\"><a href=\"https://arxiv.org/pdf/1401.2577.pdf\" class=\"linkified\">https://arxiv.org/pdf/1401.2577.pdf</a></a></p> <p>Mixing concepts from mathematics, history and programming, this presentation will sum up some of the main ideas of 'Ideal Theory in Rings', written in 1921, and propose a different approach for thinking in abstractions when writing code.</p> <p>Emmy Noether played an important role in the formalization and definitions of abstract algebraic structures. Programming is closely related to abstraction and we can use some of the ideas in this field to write better programs. This paper will bring some concepts of modern algebra categorized by Noether, such as many types of rings, groups and others. After a set of definitions, we will see an example of an application in code (in Python, Ruby, Haskell or Scala).</p> ","photos":[],"venue":{"lat":45.49710464477539,"address1":"50 rue Queen #301  H3C 2N5","address2":null,"name":"Unity Technologies ","postalCode":"","lon":-73.55416870117188,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1508450400000,"title":"Ideal Theory in Rings"},"228906777":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/228906777/","description":"<p>Jeff Timanus will present Veach and Guibas's <a href=\"https://graphics.stanford.edu/papers/metro/metro.pdf\">Metropolis Light Transport</a>.  This is a very elegant probabilistic <a href=\"https://en.wikipedia.org/wiki/Global_illumination\">global illumination</a> technique that builds on the <a href=\"https://en.wikipedia.org/wiki/Metropolis%E2%80%93Hastings_algorithm\">Metropolis-Hastings algorithm</a>.</p> <p><br/>You might find that <a href=\"https://graphics.stanford.edu/papers/veach_thesis/\">Veach's thesis</a> covers more background and has more details.</p> <p>If you are interested in ray tracing, computer graphics, sampling, or probabilistic methods at all, you should definitely attend!</p> <p>\n\n\n\nI'll end with a tantalizing quote from Veach's thesis, the section \"Why Light Transport is Important\":</p> <p><i>  One of the main goals of light transport algorithms is to increase human efficiency in the modeling of realistic virtual environments.  [...]  The main problem is that the algorithms used for production work ... do not have the ability to simulate indirect lighting.  [...] If we could find robust light transport algorithms, then the indirect lighting could be computed automatically, which would make the lighting task far easier.</i></p> <p><i>  Another important application of light transport is predictive modeling, where we wish to predict the appearance of objects before they are built.  This idea has obvious uses in architecture and product design.  [...]</i></p> <p><i>  Finally, better techniques for light transport in graphics may lead to better methods in physics and engineering, because light transport has a structure that is similar to radiation and particle transport problems.</i></p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1458858600000,"title":"Metropolis Light Transport"},"229838204":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/229838204/","description":"<p>Elena Vlasenko will present Farsiniamarj and Haarslev's <a href=\"http://users.encs.concordia.ca/~haarslev/publications/AICom2010.pdf\">Practical Reasoning with Qualified Number Restrictions: A Hybrid Abox Calculus for the Description Logic SHQ</a>.</p> <p>A lot of the terminology here is specific to Description Logics, and I found this paper, <a href=\"http://arxiv.org/pdf/1201.4089.pdf\">A Description Logic Primer</a>, to be useful in getting a handle on what was actually happening in the featured paper.  Also, as the paper is rather long, one might consider skipping to section 5 after reading the introduction on one's first pass through it.</p> <p><br/>Elena indicates that she has used this paper heavily in her own work, so I will leave it to her presentation to explain and justify it.</p> <p>This should be of particular interest to those with an interest in the semantic web, logic and automated reasoning, or applications of integer linear programming.</p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1461191400000,"title":"Practical Reasoning with Qualified Number Restrictions"},"244906577":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/244906577/","description":"<p>Rupert Brooks will present Dual Contouring of Hermite Data by Tao Ju, Frank Losasso, Scott Schaefer, Joe Warren.</p> <p><br/><a href=\"http://www.frankpetterson.com/publications/dualcontour/dualcontour.pdf\"><a href=\"http://www.frankpetterson.com/publications/dualcontour/dualcontour.pdf\" class=\"linkified\">http://www.frankpetterson.com/publications/dualcontour/dualcontour.pdf</a></a></p> <p><br/>I'm going to remind everyone to review the PWL social rules (which are the Recurse Center's social rules) before the next meet-up so we can end the year on a high note.  We also use their code of conduct.</p> <p><br/><a href=\"https://www.recurse.com/manual#sub-sec-social-rules\"><a href=\"https://www.recurse.com/manual#sub-sec-social-rules\" class=\"linkified\">https://www.recurse.com/manual#sub-sec-social-rules</a></a></p> ","photos":[],"venue":{"lat":45.49710464477539,"address1":"50 rue Queen #301  H3C 2N5","address2":null,"name":"Unity Technologies ","postalCode":"","lon":-73.55416870117188,"country":"ca","city":"Montréal"},"utcOffset":-18000000,"time":1511996400000,"title":"Dual Contouring of Hermite Data"},"230513727":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/230513727/","description":"<p>Jordi Gutiérrez Hermoso has kindly offered to present Brys, Hubert, and Struyf's <a href=\"https://wis.kuleuven.be/stat/robust/papers/2004/medcouple.pdf\">A robust measure of skewness</a>, also known as the <a href=\"https://en.wikipedia.org/wiki/Medcouple\">medcouple</a>, with a focus on the algorithm for its computation.</p> <p>If you can, it's worth tracking down the cited article by Johnson and Mizoguchi that describes a selection algorithm used in the medcouple algorithm.  Unfortunately it does not appear to be freely available on the web.  However, the <a href=\"https://en.wikipedia.org/wiki/Medcouple#Fast_algorithm\">wikipedia article for the medcouple</a> has an excellent exposition which includes a good description of Johnson + Mizoguchi, which is elided from the paper.</p> <p>\n\n\nJordi has provided the following description for the talk:</p> <p><br/><i>Identifying outliers is a delicate but common statistical problem. One of the most basic definitions of an outlier is given by familiar box and whisker plots, as defined by Tukey: an outlier is anything outside of the boxplot's whiskers. A problem with this simple definition is that it tends to give too many outliers for data that is very heavily skewed towards one side or the other.</p> <p>A convenient, non-parametric way to handle skew data is the so-called adjusted boxplot, as defined by Hubert and Vandervieren [1], which adjusts the whisker lengths of the box plot according to the skewness of the distribution. This adjustment requires a nonparametric measurement of skewness that is robust to outliers. The statistic that Hubert and Vandervieren recommend is the medcouple, introduced by Brys, Hubert, and Struyf [2].</p> <p>While the medcouple has many interesting statistical properties, it comes with a price: a naïve medcouple algorithm for a sample of size n is in the O(n^2) complexity class. Using Johnson and Mizoguchi's method for finding the median of a matrix with sorted rows and sorted columns [3], we can improve upon the naïve algorithm with a fast O(n log n) medcouple algorithm.</p> <p>This talk will briefly touch upon these three papers and how they work together as a method for defining outliers for skew distributions. The presentation should appeal to those with a knowledge of basic statistics. The discussion of finding the median of a sorted matrix is interesting in its own right to anyone who cares about classical problems in computer science.</p> <p>---</p> <p>[1] M. Hubert; E. Vandervieren (2008). \"An adjusted boxplot for skewed distributions\". Computational Statistics and Data Analysis 52 (12): 5186–5201. doi:[masked]/j.csda.2007.11.008.</p> <p>[2] G. Brys; M. Hubert; A. Struyf (November 2004). \"A Robust Measure of Skewness\". Journal of Computational and Graphical Statistics 13 (4): 996–1017. doi:[masked]/[masked]X12632.</p> <p>[3] Donald B. Johnson; Tetsuo Mizoguchi (May 1978). \"Selecting The Kth Element In X + Y And X1 + X2 +...+ Xm\". SIAM Journal of Computing 7 (2): 147–153. doi:[masked]/0207013.</i></p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1463608800000,"title":"The medcouple — a robust measure of skewness"},"239940871":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/239940871/","description":"<p>Marianne Corvellec will present <a href=\"https://pdfs.semanticscholar.org/6aa1/c88b810825ee80b8ed4c27d6577429b5d3b2.pdf\">Evaluating Collaborative Filtering Recommender Systems</a> by Jonathan L. Herlocker, Joseph A. Konstan, Loren G. Terveen, and John T. Riedl.</p> <p>What's better than a survey paper?  Perhaps this paper that proposes a methodology for evaluating many different approaches, and then gives some empirical evaluations while giving us, also, a bit of a tour of the literature on recommender systems.</p> <p>Added to that, our speaker used this paper in an implementation, so it's two of my favorite kinds of paper situations in one!</p> ","photos":[],"venue":{"lat":45.52912521362305,"address1":"5795 Avenue de Gaspé #100","address2":null,"name":"Hopper","postalCode":"","lon":-73.60010528564453,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1495749600000,"title":"Evaluating Collaborative Filtering Recommender Systems"},"209208922":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/209208922/","description":"<p>Peter Zion will present the paper <a href=\"http://www.icg.tugraz.at/Members/steinber/scatteralloc-1\">ScatterAlloc: Massively Parallel Dynamic Memory Allocation for the GPU.</a></p> <p>Autodesk have kindly permitted us to use their space for this meetup.</p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-14400000,"time":1414105200000,"title":"ScatterAlloc: Massively Parallel Dynamic Memory Allocation for the GPU"},"235100825":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/235100825/","description":"<p>I will present <a href=\"http://www.cs.columbia.edu/~nahum/w6998/papers/sosp87-timing-wheels.pdf\">Hashed and Hierarchical Timing Wheels</a> by Varghese and Lauck.  This is the basis for pretty much every operating system's timer facility, and has an important role in distributed systems.  (As usual, <a href=\"https://blog.acolyer.org/2015/11/23/hashed-and-hierarchical-timing-wheels/\">Adrian Colyer's writeup of this paper</a> is great; see also <a href=\"https://blog.acolyer.org/2015/11/24/gd-wheel/\">the subsequent discussion of GD-Wheels</a>.)</p> <p><br/>I'll talk about some specific implementations of this idea, in <a href=\"https://github.com/erlang/otp/blob/maint/erts/emulator/beam/time.c\">Erlang's runtime system</a>, in <a href=\"https://github.com/torvalds/linux/blob/master/kernel/time/timer.c\">Linux</a> (see also <a href=\"https://lwn.net/Articles/646950/\">this lwn article</a>), as well as Juho Snellman's <a href=\"https://www.snellman.net/blog/archive/2016-07-27-ratas-hierarchical-timer-wheel/\">Ratas</a> and possibly some others.  (The article on &lt;a&gt;Kafka's use of timing wheels&lt;/a&gt; is easy to understand.)</p> <p>\n\nThe front door for AdGear's new office is not finished, so please enter via the alleyway behind the building (rue de Longueuil between Notre-Dame and Saint-Maurice), per the map.  There will be a sign on the door.</p> ","photos":[],"venue":{"lat":45.5003662109375,"address1":"460 McGill, Suite 200","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.55908203125,"country":"ca","city":"Montréal"},"utcOffset":-18000000,"time":1479943800000,"title":"Hashed and Hierarchical Timing Wheels"},"233830736":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/233830736/","description":"<p>Rishi will discuss dynamic time warping, covering several papers, including <a href=\"http://cs.fit.edu/%7Epkc/papers/tdm04.pdf\">\"FastDTW: Toward Accurate Dynamic TimeWarping in Linear Time and Space\"</a> and<br/>&lt;a&gt;\"Computing and Visualizing Dynamic Time Warping Alignments in R : The dtw Package\"&lt;/a&gt;.  Rishi also indicates a significant part of presentation will come from Chapter 4 of Rabiner L, Juang BH (1993). Fundamentals of Speech Recognition. Prentice-Hall, Upper Saddle River, NJ, USA.  See also <a href=\"https://www.irit.fr/~Julien.Pinquier/Docs/TP_MABS/res/dtw-sakoe-chiba78.pdf\">Sakoe and Chiba</a>, which started it all.</p> <p><br/>For some motivation, check out the excellent presentation linked in the conversation below!</p> <p>Please note that Keatext have kindly offered to host us this month.</p> <p>\n\n\nAlso, this is the two year anniversary of PWLMTL!</p> ","photos":[],"venue":{"lat":45.52830505371094,"address1":"5605 avenue de Gaspé, suite 108","address2":null,"name":"Keatext","postalCode":"","lon":-73.5980453491211,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1474495200000,"title":"Dynamic Time Warping"},"240169912":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/240169912/","description":"<p>Thomas Peters will present <a href=\"http://homes.soic.indiana.edu/donbyrd/INFO590Spring06/Wang-ISMIR03IndStrength-Txt.pdf\">\"An industrial-strength audio search algorithm\"</a> by Avery Li-chun Wang. This algorithm was the basis for the Shazam music recognition service and remains an important part of the music IR landscape.</p> <p>Hopper kindly continue to provide our venue.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/e/4/7/b/600_463198491.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/e/4/7/c/600_463198492.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/e/4/7/e/600_463198494.jpeg","height":null,"width":null}],"venue":{"lat":45.52912521362305,"address1":"5795 Avenue de Gaspé #100","address2":null,"name":"Hopper","postalCode":"","lon":-73.60010528564453,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1501106400000,"title":"\"An industrial-strength audio search algorithm\""},"223605623":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/223605623/","description":"<p>Maxime Chevalier-Boisvert will present Soman and Krintz's paper, \"<a href=\"https://www.cs.ucsb.edu/~ckrintz/papers/osr.pdf\">Efficient and General On-Stack Replacement for Aggressive Program Specialization</a>\".  Maxime had the following to say about the paper:</p> <p><br/>\"On-stack replacement is a technique used in almost every modern JIT. Java JITs, JavaScript JITs, etc. It's still very relevant to JIT compiler design, but it's something you may not learn about in a compiler class. The technique was pioneered in Self, but I thought this paper is best, because the Self paper introducing it also introduces a half-dozen other optimizations, which would just confuse the discussion.\"</p> <p>I am very excited about having an interesting compiler paper presented at PWLMTL, and I'm sure all you compiler design afficionados will enjoy this one.  For those who don't think they're interested in compilers, consider how insight into JIT optimizations can help you reason about the performance of all that JavaScript, JVM, and .NET code you interact with all the time!</p> <p>If you have had any trouble getting to the meetups in the past, please let me know if there is something I can do to make it easier.  Also, we will try to have food this time as I know that was popular at some of the past meetups.</p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-14400000,"time":1437606000000,"title":"Efficient and General On-Stack Replacement for Aggressive Program Specialization"},"231254622":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/231254622/","description":"<p>Raimi Rufai will present <a href=\"http://www.cccg.ca/proceedings/2015/50.pdf\">A Streaming Algorithm for the Convex Hull</a>.  Although this is his own work, it is an elegant algorithm with a clean, concise paper.</p> <p>Unfortunately I haven't gotten the chance to finish my own implementation of it, but I invite everyone to read the paper, as it's short, and I expect the discussion tonight will be very interesting.  Whether you're already a big fan of computational geometry, or you're wondering \"what is a convex hull?\", or you're wondering \"is there any use for a convex hull outside graphics?\", you should come to this one.</p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1466632800000,"title":"A Streaming Algorithm for the Convex Hull"},"219134793":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/219134793/","description":"<p>Christian Lavoie will present <a href=\"http://www.cs.cornell.edu/courses/CS7412/2011sp/paxos.pdf\">\"Paxos Made Moderately Complex\"</a> by <a href=\"http://www.cs.cornell.edu/home/rvr/\">Robbert van Renesse</a>.  This will be a great opportunity to hear the real details of implementing a notoriously-thorny protocol!</p> <p><br/>Christian organizes the <a href=\"http://www.meetup.com/Haskellers-Montreal-Meetup/\">Haskellers Montréal meetup</a> which is well worth checking out!</p> <p><br/>(This is a tentative date; feel free to let me know if another date would be better. )</p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-18000000,"time":1421884800000,"title":"\"Paxos Made Moderately Complex\" by van Renesse"},"221545922":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/221545922/","description":"<p>Peter Zion will present two great papers on deep learning; first, Yann LeCun’s seminal 1998 paper, \"<a href=\"http://yann.lecun.com/exdb/publis/pdf/lecun-01a.pdf\">Gradiant-Based Learning Applied to Document Recognition</a>\", which will give some background and context for Krizhevsky, Sutskever, and Hinton's 2012 paper, \"<a href=\"http://www.cs.toronto.edu/~fritz/absps/imagenet.pdf\">ImageNet Classification with Deep Convolutional Neural Networks</a>\", in which (to quote Peter), \"they [...] create a GPU-based DNN that is better at image recognition than any human\".</p> <p>\n\n\nGiven the length of the first paper, I recommend reading Krizhevsky's paper in detail, and skimming LeCun's paper as needed for background.</p> <p>\n\n\nEveryone interested in machine learning, image processing and recognition, or GPU computing should come!</p> <p>\n\n\nThis event is part of <a href=\"http://mtldata.com/bdw\">Big Data Week</a>.  Be sure to check out the rest of the schedule!</p> <p>\n\n\nFinally, a huge thanks to the folks at Radialpoint for hosting us again.</p> ","photos":[],"venue":{"lat":45.507530212402344,"address1":"2050 Bleury, Suite 300","address2":null,"name":"Radialpoint","postalCode":"","lon":-73.56996154785156,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1429740000000,"title":"A Deep Learning Double Bill"},"222043241":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/222043241/","description":"<p>Rishikesh will present <a href=\"http://www.cs.cmu.edu/~anupamg/papers/jl.pdf\">An Elementary Proof of a Theorem of Johnson and Lindenstrauss</a> by Dasgupta and Gupta, with additional material from Ailon and Chazelle's <a href=\"https://www.cs.princeton.edu/~chazelle/pubs/FJLT-sicomp09.pdf\">The Fast Johnson-Lindenstrauss Transform and Approximate Nearest Neighbors</a>.</p> <p>\n\n\nThe <a href=\"http://en.wikipedia.org/wiki/Johnson%E2%80%93Lindenstrauss_lemma\">Johnson-Lindenstrauss Lemma</a> is pretty awesome, and with the advent of the <a href=\"https://www.cs.princeton.edu/~chazelle/pubs/FJLT-sicomp09.pdf\">Fast Johnson-Lindenstrauss Transform</a> this has become a practical tool for dimensionality reduction, approximate nearest neighbors, collision detection, among other things.  There are applications for everyone who's dealing with the <a href=\"http://en.wikipedia.org/wiki/Curse_of_dimensionality\">curse of dimensionality</a>, from machine learning to realtime videogames.</p> <p>\n\nNote that this talk will be hosted at Autodesk and will begin at 7pm.</p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-14400000,"time":1432594800000,"title":"Johnson-Lindenstrauss Lemma"},"225270663":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/225270663/","description":"<p>Chris Diggins will present<a href=\"http://research.microsoft.com/en-us/um/people/simonpj/Papers/deforestation-short-cut.pdf\"> A Short Cut to Deforestation (1993)</a> by Andrew Gill, John Launchbury, Simon L Peyton Jones.</p> <p><i>\"Lists are often used as \"glue\" to connect separate parts of a program together. We propose an automatic technique for improving the efficiency of such programs, by removing many of these intermediate lists, based on a single, simple, local transformation. We have implemented the method in the Glasgow Haskell compiler.\"</i></p> <p><br/>Christopher Diggins is a Principal Developer at Autodesk and designed the MCG visual programming languge in 3ds Max 2016.  He has an unhealthy obsession with programming languages.</p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-14400000,"time":1445554800000,"title":"\"A Short Cut to Deforestation\" by Gill, Launchbury, Peyton Jones"},"220181743":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/220181743/","description":"<p>Guy Dumais will present <a href=\"http://www.xuanhui.me/pub/wsdm427-kang.pdf\">\"Learning to Rank with Multi-Aspect Relevance for Vertical Search\" by Kang et al.</a>, which presents machine learning approaches to ranking the results of a query based on an aggregate of metrics whose combined weight is not well-defined.</p> <p>\n\n\n\nWhile the relevance of this to people involved in machine learning or targeted search is clear, I would imagine there will be interesting discussion for anyone who has to deal with problems where heuristics are hard to come up with ahead of time.</p> <p>\n\nRadialpoint have kindly offered to host the meetup this time.</p> ","photos":[],"venue":{"lat":45.507530212402344,"address1":"2050 Bleury, Suite 300","address2":null,"name":"Radialpoint","postalCode":"","lon":-73.56996154785156,"country":"ca","city":"Montréal"},"utcOffset":-18000000,"time":1424304000000,"title":"\"Learning to Rank with Multi-Aspect Relevance for Vertical Search\" by Kang et al"},"220974427":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/220974427/","description":"<p>Pablo Duboue will present \"<a href=\"http://www.cs.nyu.edu/~mohri/pub/zero.pdf\">Structural Zeros versus Sampling Zeros</a>\" by Mohri and Roark; this looks like a fascinating paper with applicability to improving all kinds of probabilistic models.  He will also be talking about the specific application of this idea to probabilistic context-free grammar (PCFG) parsing as discussed in another Mohri and Roark paper, \"<a href=\"http://www.cs.nyu.edu/~mohri/pub/spcfg.pdf\">Probabilistic Context-Free Grammar Induction Based on Structural Zeros</a>\".  Anyone interested in machine learning, natural language processing, parsing in general, even automated test generation and model checking, or all kinds of other topics should definitely attend!</p> <p>\n\n\n\nI apologize for the delay in announcing this meetup.  I was in Toronto checking out their PWL chapter to hopefully borrow some ideas (and speakers!) and lost track of time.</p> <p>\n\n\nNote that since Radialpoint have kindly offered to host again, and their building closes early, we're going to try to start this meetup at 6:30, by which I mean you should come sometime around 6:00 to enjoy a libation and conversation before the talk starts at 6:30.  (Times subject to change, of course; be sure to check the meetup page on the day of the event.)</p> ","photos":[],"venue":{"lat":45.507530212402344,"address1":"2050 Bleury, Suite 300","address2":null,"name":"Radialpoint","postalCode":"","lon":-73.56996154785156,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1427322600000,"title":"Structural Zeros versus Sampling Zeros by Mohri and Roark"},"237070014":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/237070014/","description":"<p>Mathieu Petitpas will present <a href=\"https://arxiv.org/abs/1203.1895\">Classic Nintendo Games are (Computationally) Hard</a> by Aloupis et al., which is an entertaining look at the computational complexity of constructs available in classic NES games.</p> ","photos":[],"venue":{"lat":0.0,"address1":"460 McGill, Suite 200","address2":null,"name":"AdGear Technologies","postalCode":"","lon":0.0,"country":"ca","city":"Montréal"},"utcOffset":-18000000,"time":1488409200000,"title":"Classic Nintendo Games are (Computationally) Hard"},"225581672":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/225581672/","description":"<p>I will present Browne et al.'s \"<a href=\"http://citeseerx.ist.psu.edu/viewdoc/download;jsessionid=B7BB1338BDE1F287ECFC52AD86AFD055?doi=10.1.1.297.3086&amp;rep=rep1&amp;type=pdf\">A Survey of Monte Carlo Tree Search Methods</a>\" along with some discussion of the application of MCTS to fuzzing, test generation, and procedural content generation.  Some of these aspects can be seen as a followup or tangent to <a href=\"http://www.meetup.com/Papers-We-Love-Montreal/events/217560332/\">my presentation last year</a> on shape grammars and procedural modeling of buildings.</p> <p>MCTS has been enjoying a lot of interest for its success in playing Go, but it generally has a lot of applicability in search problems where coming up with good heuristics in advance is tricky.</p> <p><br/>The paper, being a survey paper, is pretty long; if you just want to get the general idea, read sections 2 and 3, which introduce MCTS, UCT, and the ideas leading up to them.  (Including the minimization of regret; and who doesn't want to minimze regret?)</p> <p>Be sure to check out <a href=\"http://mcts.ai\">mcts.ai</a> for more MCTS reading.</p> <p><br/>AdGear have kindly offered to provide space this time.  It's right next to metro Square Victoria.  Note that the start time is a little earlier than usual; you can come at 6, and I'll try to speak starting around 6:30.  As usual, we'll probably move to Pub Vic or a similar venue after the main discussion.</p> <p><br/>There will be code, beer, and pizza.  As usual, if you get here early, you can browse some papers that I think are interesting.  Feel free to bring your own collection to share!</p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-18000000,"time":1448494200000,"title":"\"A Survey of Monte Carlo Tree Search Methods\""},"240169865":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/240169865/","description":"<p>Suchakra Sharma will present McCanne and Jacobson's <a href=\"https://www.usenix.org/legacy/publications/library/proceedings/sd93/mccanne.pdf\">\"The BSD Packet Filter: A New Architecture for User-level Packet Capture\"</a>. This is very exciting not only because of the applications of the original BPF, but also the more recently developed eBPF which has become a crucial part of modern Linux kernels.</p> <p>Incidentally, aside from the paper, and all the recent interesting work on eBPF (check out <a href=\"http://www.brendangregg.com/ebpf.html\">Brendan Gregg's page on eBPF</a>, <a href=\"https://qmonnet.github.io/whirl-offload/2016/09/01/dive-into-bpf/\">Quentin Monnet's page</a>), I recommend reading the code for <a href=\"https://github.com/the-tcpdump-group/libpcap/blob/master/optimize.c\">the BPF optimizer from libpcap</a> (optimize.c) — to me, it's a great, simple example of some classic compiler optimizations, that's easy to understand because of how simple the VM is.</p> <p><br/>Hopper have offered to host again, so I hope you all can find your way out there; I think it made for a good space last time.</p> ","photos":[],"venue":{"lat":45.52912521362305,"address1":"5795 Avenue de Gaspé #100","address2":null,"name":"Hopper","postalCode":"","lon":-73.60010528564453,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1498687200000,"title":"\"The BSD Packet Filter: A New Architecture for User-level Packet Capture\""},"228174489":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/228174489/","description":"<p>Jeremie Lasalle Ratelle will present <a href=\"http://www.di.ens.fr/~cousot/COUSOTpapers/publications.www/CousotCousot-POPL-77-ACM-p238--252-1977.pdf\">Abstract Interpretation</a> by Cousot and Cousot, one of the most cited papers in compilation (and one of the <a href=\"https://github.com/nuprl/10PL\">10 papers that all PhD students in programming languages ought to know</a>).</p> <p>This is the classic paper that unified previously ad hoc techniques in compilers and gave birth to modern concepts of static analysis.  (It's worth comparing it with one of its major predecessors, <a href=\"https://static.aminer.org/pdf/PDF/000/546/451/a_unified_approach_to_global_program_optimization.pdf\">Gary Kildall's earlier work</a>.)  The focus will be more on the concepts and their practical implications than on the details of lattice theory.</p> <p><br/>Jeremie will also talk about how static analysis evolved since this paper, and the use of these techniques in practice.  Originally he was going to present <a href=\"http://www.ccs.neu.edu/home/shivers/papers/pldi88.pdf\">Shivers's Control Flow in Scheme</a> (or maybe part of Shivers's thesis, I can't remember), so you can be sure that will get a mention.</p> <p><br/>Everyone interested in the practical aspects of compiler design should come, as we will have lots of discussion of static analysis and optimization.</p> <p>\n\n\n\nAdGear are graciously providing the venue as usual, and there will be pizza and beer.</p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-18000000,"time":1456356600000,"title":"Abstract Interpretation by Cousot and Cousot"},"232761949":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/232761949/","description":"<p>Richard Kallos will present <a href=\"http://www.cs.indiana.edu/~dyb/pubs/nano-jfp.pdf\">A Nanopass Framework for Compiler Education</a>, touching also on <a href=\"http://andykeep.com/pubs/np-preprint.pdf\">A Nanopass Compiler for Commercial Compiler Development</a>, with reference to the recently open sourced <a href=\"https://github.com/cisco/ChezScheme\">Chez Scheme</a>.</p> <p>I'm excited about this presentation because we will actually spend some time in the guts of Chez Scheme, which is a high-quality production compiler.</p> <p><br/>Aside from the compiler aspects, I think there's also an interesting software engineering case study here, as this describes a drastic refactoring of a large commercial software product.</p> <p>Lovers of Lisp and those curious about compiler implementation should certainly attend.</p> <p>Please note that since AdGear is moving offices soon, the venue is slightly uncertain.  I will make an announcement if the venue changes.</p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1472162400000,"title":"Nanopass Compiler Framework"},"222772596":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/222772596/","description":"<p>Julia Evans will present &lt;a&gt;Machine Learning: The High-Interest Credit Card of Technical Debt&lt;/a&gt;.  After a number of talks about the wonders of machine learning, it's going to be nice to have a paper about the caveats, particularly the maintainability of such systems in production.  I'm sure there will be lively discussion of this one, so bring out your best anecdotes!</p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-14400000,"time":1435273200000,"title":"Machine Learning: The High-Interest Credit Card of Technical Debt"},"243307433":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/243307433/","description":"<p>Julian Squires will present \"Simple Fast Algorithms for the Editing Distance Between Trees and Related Problems\" by Zhang and Shasha, which he once used for implementing a structured version control system in XML documents.</p> <p><br/><a href=\"http://www.grantjenks.com/wiki/_media/ideas%3Asimple_fast_algorithms_for_the_editing_distance_between_tree_and_related_problems.pdf\"><a href=\"http://www.grantjenks.com/wiki/_media/ideas%3Asimple_fast_algorithms_for_the_editing_distance_between_tree_and_related_problems.pdf\" class=\"linkified\">http://www.grantjenks.com/wiki/_media/ideas%3Asimple_fast_algorithms_for_the_editing_distance_between_tree_and_related_problems.pdf</a></a></p> <p>He'll also discuss later work on tree edit distance and alternative approaches to structured version control.</p> ","photos":[],"venue":{"lat":45.512481689453125,"address1":"700 rue St-Antoine Est","address2":null,"name":"Lightspeed Retail","postalCode":"","lon":-73.55320739746094,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1506031200000,"title":"Simple Fast Algorithms for the Editing Distance between Trees & Related Problems"},"205915052":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/205915052/","description":"<p>(Sorry, this got munged by meetup.com the first time around)</p> <p>I will present a paper I love (exactly which one is still pending; I will announce it and send out a copy shortly), and we can discuss papers we'd love to see presented and what the future of this meetup will be.</p> <p>The venue for this meetup is <a href=\"http://tangosocialclub.ca/\" class=\"linkified\">http://tangosocialclub.ca/</a></p> ","photos":[],"venue":{"lat":45.53763961791992,"address1":"7755 St-Laurent, suite 200B","address2":null,"name":"Tango Social Club","postalCode":"","lon":-73.62615203857422,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1411081200000,"title":"Inaugural meetup"},"227424625":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/227424625/","description":"<p>I'm a huge fan of Daniel Lemire's work on compressed bitmaps, sorted sequences of integers, and other data structures.  I'd say half the papers I have on my desk at work right now have his name on them.  I've invited him to speak at PWLMTL on his own work, rather than on a paper he loved, because <b>I</b> love his papers: I find them to be practical and accessible to the working developer in a way that few academic works manage to be.</p> <p><br/>He's going to speak about compressed bitmaps, in particular the Roaring bitmap approach he first published <a href=\"http://r-libre.teluq.ca/602/1/RoaringBitmap.pdf\">in this paper</a> (cited below).</p> <p><br/>The bitmap, especially in compressed form, is a very versatile data structure despite its apparent simplicity, and I invite all developers to consider it for many purposes.</p> <p>Just recently, I used compressed bitmaps in an application which needed to represent large sets of IP addresses efficiently.  In the last few years, I've used them in the implementation of a database system, an IMAP server, and a pubsub messaging system.  (Not to mention their ubiquity, uncompressed, in allocators of all sorts.)</p> <p>AdGear will be hosting us again for this meetup, and beer and pizza will be provided; feel free to come around 6 to eat and chat before the talk!</p> <p>\n\nAn abstract for the talk follows:</p> <p>\n\n\n<b> Better bitmap performance with Roaring bitmaps</b></p> <p><br/>Bitmaps are used to implement fast set operations in software. They are frequently found in databases and search engines.</p> <p>Without compression, bitmaps scale poorly, so they are often compressed. Many bitmap compression techniques have been proposed, almost all relying primarily on run-length encoding (RLE). For example, Oracle relies on BBC bitmap compression while the version control system Git and Apache Hive rely on EWAH compression.</p> <p>We can get superior performance with a hybrid compression technique that uses both uncompressed bitmaps and packed arrays inside a two-level tree. An instance of this technique, Roaring, has been adopted by several production platforms (e.g., Apache Lucene/Solr/Elastic, Apache Spark, eBay's Apache Kylin and Metamarkets' Druid).</p> <p>Overall, our implementation of Roaring can be several times faster (up to two orders of magnitude) than the implementations of traditional RLE-based alternatives (WAH, Concise, EWAH) while compressing better. We review the design choices and optimizations that make these good results possible.</p> <p>One interesting feature of this work is that it has been out in the open from the start. Roaring bitmaps is the result of a far ranging collaborative effort. We believed that it played a role in its success.</p> <p>If time allows, ongoing and future development efforts will be discussed.</p> <p>\n\n\n\n<b>About the speaker</b></p> <p><br/>Daniel Lemire is a computer science professor at the Université du Québec. He has also been a research officer at the National Research Council of Canada and an entrepreneur. He has written over 45 peer-reviewed publications, including more than 25 journal articles. He has held competitive research grants for the last 15 years. He has been an expert on several committees with funding agencies (NSERC and FQRNT). He has served as program committee member on leading computer science conferences (e.g., ACM CIKM, ACM WSDM, ACM SIGIR, ACM RecSys). His research interests include databases, information retrieval and high-performance programming. He blogs regularly on computer science at<a href=\"http://lemire.me/blog/.\"> <a href=\"http://lemire.me/blog/\" class=\"linkified\">http://lemire.me/blog/</a>.</a></p> <p>\n\n\n\n<b>References</b></p> <p><br/>Samy Chambi, Daniel Lemire, Owen Kaser, Robert Godin, Better bitmap performance with Roaring bitmaps, Software: Practice and Experience (to appear) <a href=\"http://onlinelibrary.wiley.com/doi/10.1002/spe.2325/abstract\"><a href=\"http://onlinelibrary.wiley.com/doi/10.1002/spe.2325/abstract\" class=\"linkified\">http://onlinelibrary.wiley.com/doi/10.1002/spe.2325/abstract</a></a> (available from the publisher under open access)</p> <p>Daniel Lemire, Gregory Ssi-Yan-Kai, Owen Kaser, Consistently faster and smaller compressed bitmaps with Roaring (working paper)</p> <p>\n\n\n<b>Source code</b></p> <p><br/><a href=\"http://roaringbitmap.org/\"><a href=\"http://roaringbitmap.org/\" class=\"linkified\">http://roaringbitmap.org/</a></a></p> <p><a href=\"https://github.com/lemire/RoaringBitmap\"><a href=\"https://github.com/lemire/RoaringBitmap\" class=\"linkified\">https://github.com/lemire/RoaringBitmap</a></a></p> ","photos":[],"venue":{"lat":45.50249099731445,"address1":"481 Avenue Viger West, suite 103","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.56314849853516,"country":"ca","city":"Montréal"},"utcOffset":-18000000,"time":1453332600000,"title":"Better Bitmap Performance with Roaring Bitmaps"},"234294300":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/234294300/","description":"<p>Remi Attab will be presenting McKenney and Slingwine's<a href=\"http://www.rdrop.com/users/paulmck/scalability/paper/rclockpdcsproof.pdf\"> Read-Copy Update: using execution history to solve concurrency problems</a> (RCU), and Desnoyers et al.'s <a href=\"http://www.dorsal.polymtl.ca/sites/www.dorsal.polymtl.ca/files/publications/desnoyers-ieee-urcu-submitted.pdf\">User-Level Implementations of Read-Copy Update</a>.</p> <p>Everyone interested in concurrency or systems programming should certainly attend!  Be sure to check out <a href=\"https://lwn.net/Articles/262464/\">McKenney's series of articles on RCU on lwn.net</a>.</p> <p><br/>Please note this meetup is at the new AdGear offices and that building is still under construction, so finding the temporary entrance is a little tricky.  I've updated the Google Map marker to indicate the back entrance (on rue de Longueuil between Notre-Dame and Saint-Maurice), whereafter one can follow the signs up to the office.</p> ","photos":[],"venue":{"lat":45.50038146972656,"address1":"460 McGill, Suite 200","address2":null,"name":"AdGear Technologies","postalCode":"","lon":-73.55907440185547,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1477519200000,"title":"RCU"},"224474113":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/224474113/","description":"<p>Bahar Sateli will present \"<a href=\"http://www.aejournal.net/content/2/1/1\">Towards Robot Scientists for autonomous scientific discovery</a>\" by Sparkes et al. (<a href=\"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2813846/pdf/1759-4499-2-1.pdf\">PDF</a>), which looks fascinating.  Anyone interesting in planning, AI, even proof systems, should certainly attend.  As per the last meetup, we will have pizza (I am open to alternative food suggestions; hopefully we will have the food before the talk, this time).</p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-14400000,"time":1440630000000,"title":"Towards Robot Scientists for autonomous scientific discovery"},"240892572":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/240892572/","description":"<p>Mathieu Guay-Paquet will present Kiveris et al's <a href=\"http://delivery.acm.org/10.1145/2680000/2670997/18-kiveris.pdf\">Connected Components in MapReduce and Beyond</a>.  As I understand it, there'll be a bit of a war story here, about improving the efficiency of a Spark job that computes connected components, originally with GraphX.  Correspondingly, Mathieu will talk about Spark and RDDs, starting with what I think is the original RDD paper, then GraphX, and then some actual distributed connected components approaches.</p> <p>I think anyone interested in how Spark works, or doing computations on large graphs, will find something of interest here.</p> <p>\n\n\nHe wrote me a nice list of the papers and comments which I will reproduce exactly (modulo meetup.com's strange formatting):</p> <p><br/>1. This one is a very nice overview of the way Spark and its main data structure, RDDs, are meant to be used, with enough implementation details to understand what's going on. It's probably a very good roadmap if you decide to dive into the Spark code itself.</p> <p>Resilient Distributed Datasets: A Fault-Tolerant Abstraction for In-Memory Cluster Computing</p> <p>Matei Zaharia, Mosharaf Chowdhury, Tathagata Das, Ankur Dave, Justin Ma, Murphy McCauley, Michael J. Franklin, Scott Schenker, Ion Stoica — NSDI 2012</p> <p>web: <a href=\"https://www.usenix.org/conference/nsdi12/technical-sessions/presentation/zaharia\"><a href=\"https://www.usenix.org/conference/nsdi12/technical-sessions/presentation/zaharia\" class=\"linkified\">https://www.usenix.org/conference/nsdi12/technical-sessions/presentation/zaharia</a></a> </p> <p>pdf: <a href=\"https://www.usenix.org/system/files/conference/nsdi12/nsdi12-final138.pdf\"><a href=\"https://www.usenix.org/system/files/conference/nsdi12/nsdi12-final138.pdf\" class=\"linkified\">https://www.usenix.org/system/files/conference/nsdi12/nsdi12-final138.pdf</a></a> </p> <p>\n\n2. Similarly, this is a nice overview of the intent and architecture of the Spark GraphX library, including a few benchmarks comparing it to other frameworks on a graph connected components task and a PageRank task. It contains all the ingredients to see why its approach is poorly suited to the connected components task, but doesn't actually reach this conclusion.</p> <p>GraphX: Unifying Data-Parallel and Graph-Parallel Analytics</p> <p>Reynold S. Xin, Daniel Crankshaw, Ankur Dave, Joseph E. Gonzalez, Michael J. Franklin, Ion Stoica — OSDI 2014</p> <p>web: <a href=\"https://www.usenix.org/conference/osdi14/technical-sessions/presentation/gonzalez\"><a href=\"https://www.usenix.org/conference/osdi14/technical-sessions/presentation/gonzalez\" class=\"linkified\">https://www.usenix.org/conference/osdi14/technical-sessions/presentation/gonzalez</a></a> </p> <p>pdf: <a href=\"https://arxiv.org/pdf/1402.2394.pdf\"><a href=\"https://arxiv.org/pdf/1402.2394.pdf\" class=\"linkified\">https://arxiv.org/pdf/1402.2394.pdf</a></a></p> <p>\n\n3. This is the paper that found that you can really reduce the number of rounds of map-reduce you can do to compute connected components if you are willing to update your graph structure at each iteration. </p> <p><br/>Finding Connected Components in Map-Reduce in Logarithmic Rounds</p> <p>Vibhor Rastogi, Ashwin Machanavajjhala, Laukik Chitnis, Anish Das Sarma — ICDE 2013</p> <p>web: <a href=\"http://ieeexplore.ieee.org/document/6544813/pdf:\"><a href=\"http://ieeexplore.ieee.org/document/6544813/\" class=\"linkified\">http://ieeexplore.ieee.org/document/6544813/</a></a></p> <p><a href=\"http://ieeexplore.ieee.org/document/6544813/pdf:\">pdf:</a> <a href=\"https://arxiv.org/pdf/1203.5387.pdf\"><a href=\"https://arxiv.org/pdf/1203.5387.pdf\" class=\"linkified\">https://arxiv.org/pdf/1203.5387.pdf</a></a></p> <p>\n\n\n\n4. This paper fixes the problem with the previous paper where your number of edges can roughly double at each iteration if you're not careful, by choosing either the small-star operation or the large-star operation at each iteration.</p> <p><br/>Connected Components in MapReduce and Beyond</p> <p>Raimondas Kiveris, Silvio Lattanzi, Vahab Mirrokni, Vibhor Rastogi, Sergei Vassilvitskii — SOCC 2014</p> <p>pdf: <a href=\"https://doi.org/10.1145/2670979.2670997\"><a href=\"https://doi.org/10.1145/2670979.2670997\" class=\"linkified\">https://doi.org/10.1145/2670979.2670997</a></a></p> ","photos":[],"venue":{"lat":45.47942352294922,"address1":"Suite 33B, 999 du Collège","address2":null,"name":"Foulab","postalCode":"","lon":-73.5894775390625,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1504130400000,"title":"Connected Components in MapReduce and Beyond"},"217560332":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/217560332/","description":"<p>I'm going to talk about shape grammars (split grammars, place grammars), in particular their application to procedural 3D content generation as presented in the paper \"Procedural Modeling of Buildings\" by Müller, Wonka, et al.  This was a landmark paper (along with the 2003 \"Instant Architecture\") that is still the state of the art in some ways.  There might be some digression into general grammar-driven generation, especially for automatic test generation, since it's a broad and interesting topic.</p> <p>\n\n\n\nThe primary paper I'll be discussing is available at</p> <p><a href=\"http://peterwonka.net/Publications/pdfs/2006.SG.Mueller.ProceduralModelingOfBuildings.final.pdf\">  <a href=\"http://peterwonka.net/Publications/pdfs/2006.SG.Mueller.ProceduralModelingOfBuildings.final.pdf\" class=\"linkified\">http://peterwonka.net/Publications/pdfs/2006.SG.Mueller.ProceduralModelingOfBuildings.final.pdf</a></a></p> <p>The author's site,</p> <p>  <a href=\"http://peterwonka.net/Publications/publications.html\"><a href=\"http://peterwonka.net/Publications/publications.html\" class=\"linkified\">http://peterwonka.net/Publications/publications.html</a></a></p> <p>is a great resource for papers related specifically to building and facade modelling, including a paper, \"On-the-fly Generation and Rendering of Infinite Cities on the GPU\", which refers to the paper Peter Zion presented last month on dynamic GPU memory allocation.  Of special interest, too, is Inverse Procedural Modeling, on which much work has been done in the last few years and which builds upon the use of shape grammars.</p> <p><br/>I also considered presenting Stiny's original paper, which is available along with a bibliography of more general shape grammar papers (some of which I'll be mentioning) at</p> <p>  <a href=\"http://shapegrammar.org/\"><a href=\"http://shapegrammar.org/\" class=\"linkified\">http://shapegrammar.org/</a></a></p> <p>\n\n\n\nFinally, for some motivating examples, here is a 64k demo (i.e., the program which produces this output is only 64 kilobytes, and does it in realtime!) that has some characteristic shape grammar effects:</p> <p>  <a href=\"https://www.youtube.com/watch?v=mZdlSWLqumw\"><a href=\"https://www.youtube.com/watch?v=mZdlSWLqumw\" class=\"embedded\">https://www.youtube.com/watch?v=mZdlSWLqumw</a></a></p> <p>And here are some examples from someone's work-in-progress game involving procedurally-generated sprawl:</p> <p>  <a href=\"http://delacian.tumblr.com/\"><a href=\"http://delacian.tumblr.com/\" class=\"linkified\">http://delacian.tumblr.com/</a></a></p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-18000000,"time":1417132800000,"title":"\"Procedural Modeling of Buildings\" by Müller, Wonka, et al."},"225183206":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/225183206/","description":"<p>David Rowley will present Claude Shannon's<a href=\"http://worrydream.com/refs/Shannon%20-%20A%20Mathematical%20Theory%20of%20Communication.pdf\"> \"A Mathematical Theory of Communication\"</a> (later renamed<i> The</i> Mathematical Theory of Communication once its importance was recognized).  This is a pretty hefty paper (anywhere between 49 and 55 pages depending on the printing), but so foundational in our field.  David says:</p> <p>  <i>My big interest is the discovery process by which Claude Shannon managed to \"synthétiser / put it all together coherently and sequentially.\" Shannon took a lot of what was known in tidbits here and there and put it into a \"one paper is all you need to read\" kind of document. </i></p> <p>I think that's a good reason to love this paper in particular.  I hope that in the discussion we can hear all your perspectives on how Shannon's work continues to directly affect our work and many other areas.</p> <p><br/>I'll have some comments on this in relation to my own recent work with succinct data structures, and it would be nice to hear, not just about compression and entropy which are the areas I think of when I think of this paper, but maybe even queuing theory, distributed systems, and other places this work touches.</p> <p>\n\n\nThere will be pizza and beer so you can think out loud on a full stomach.  (Suggestions for alternative refreshments or any other aspect of the event's organization are always welcome.)</p> ","photos":[],"venue":{"lat":45.49528121948242,"address1":"10 Rue Duke ","address2":null,"name":"Autodesk Canada","postalCode":"H3C 2L7","lon":-73.55343627929688,"country":"ca","city":"Montreal"},"utcOffset":-14400000,"time":1443049200000,"title":"Shannon's \"A Mathematical Theory of Communication\""},"238644504":{"url":"https://www.meetup.com/Papers-We-Love-Montreal/events/238644504/","description":"<p>Brendan Cordy will present Bos et al.'s <a href=\"https://eprint.iacr.org/2013/734.pdf\">\"Elliptic Curve Cryptography in Practice\"</a>.  Aside from the already interesting contents of this paper (which discusses Bitcoin, SSH, TLS, and the PS3's famous security failure, among other things), he will show some code to demonstrate elliptic code arithmetic, ECDSA, and querying the blockchain.</p> ","photos":[],"venue":{"lat":0.0,"address1":"460 McGill, Suite 200","address2":null,"name":"AdGear Technologies","postalCode":"","lon":0.0,"country":"ca","city":"Montréal"},"utcOffset":-14400000,"time":1493332200000,"title":"Elliptic Curve Cryptography in Practice"}}