{"163406212":{"description":"<p>This our inaugural Meetup, and we're excited to have <a href=\"http://michaelrbernste.in/\">Michael Bernstein</a> presenting the paper <a href=\"http://www.cs.virginia.edu/~cs415/reading/bacon-garbage.pdf\">A Uniﬁed Theory of Garbage Collection</a> by David F. Bacon, Perry Cheng, and V.T. Rajan. </p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer and pizza.   </p> <p>After Michael presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the Meetup (and if you don't, no worries, be happy now!), and if you have any questions, thoughts, or related information, please visit our *github-thread* on the matter: <a href=\"https://github.com/papers-we-love/papers-we-love/issues/1\"><a href=\"https://github.com/papers-we-love/papers-we-love/issues/1\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/issues/1</a></a>.</p> <p>Additionally, if you have any papers you want to add to the repository above, please send us a pull request. </p> <p><b>Michael's Bio: </b></p> <p>Mike Bernstein is obsessed. Not with anything in particular, just in general. He's a Brooklyn, NYC based software developer and amateur Computer Scientist who writes at <a href=\"http://michaelrbernste.in/\"><a href=\"http://michaelrbernste.in\" class=\"linkified\">http://michaelrbernste.in</a></a> and tweets (too much) at <a href=\"https://twitter.com/mrb_bk\">@mrb_bk</a>. He's given talks on Garbage Collection and Distributed Systems in the past and is very excited to hang and chat with fellow NYC obsessives.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/2/7/2/600_337525202.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/2/9/0/600_337525232.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/3/2/6/600_337525382.jpeg","width":null}],"time":1393286400000,"title":"Papers We Love #1 => Michael Bernstein on A Uniﬁed Theory of Garbage Collection","url":"https://www.meetup.com/papers-we-love/events/163406212/","utcOffset":-18000000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.658634185791016,"lon":-73.97522735595703,"name":"Viggle Inc","postalCode":null}},"168722902":{"description":"<p>For our second meetup, we're excited to have <a href=\"https://twitter.com/BrandonBloom\">Brandon Bloom</a> presenting the paper <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/plt/programming-with-algebraic-effects-and-handlers.pdf?raw=true\">Programming with Algebraic Effects and Handlers</a> by Andrej Bauer and Matija Pretnar.</p> <p><b>Intro</b></p> <p>Some great papers embody insights, others package up those insights into digestible bites. \"Programing with Algebraic Effects and Handlers\" is the later sort of great paper. After two decades of fundamental research in to the nature of computation, a lot of mysterious ideas in computer science such as continuations and exception handling finally made sense to a number of mathematically inclined geniuses. Bauer and Pretnar's Eff programming language cuts right through the heart of the theory in a way that makes sense to anybody who has ever written a functional program. This paper uses the Eff language to explore a number of simple computational effects that were traditionally viewed as quite varied and complex.</p> <p><b>Brandon's Bio</b></p> <p>Brandon Bloom walks a fine line between laser focused pragmatism and broad academic interests. Most recently in his varied career, Brandon worked on Code.org's Hour Of Code campaign. In the past, he's founded and sold a startup, as well as worked on Microsoft Xbox and Google Translate. Now, he's indulging his inner scientist and exploring technology for his next venture. Find him on the web at &lt;<a href=\"http://www.brandonbloom.name/\"><a href=\"http://www.brandonbloom.name/\" class=\"linkified\">http://www.brandonbloom.name/</a></a>&gt;.</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer and pizza. </p> <p>After Brandon presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you never get around to it, and if you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/9\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above, please send us a pull request. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/e/8/2/600_343416482.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/e/9/6/600_343416502.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/e/a/0/600_343416512.jpeg","width":null}],"time":1395097200000,"title":"#2 => Brandon Bloom on Programming with Algebraic Effects and Handlers","url":"https://www.meetup.com/papers-we-love/events/168722902/","utcOffset":-14400000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.658634185791016,"lon":-73.97522735595703,"name":"Viggle Inc","postalCode":null}},"174731732":{"description":"<p>We're thrilled to have <a href=\"https://github.com/dgrnbrg\">David Greenberg</a> presenting <a href=\"http://people.csail.mit.edu/matei/papers/2013/sosp_sparrow.pdf\">Sparrow: Distributed, Low Latency Scheduling</a> by Kay Ousterhout, Patrick Wendell, Matei Zaharia and Ion Stoica. </p> <p><b>Intro</b></p> <p>When you need to execute code on a cluster of machines, deciding which machine should run that code becomes a complex problem, known as scheduling. We're all familiar with routing problems, such as the recent <a href=\"http://news.rapgenius.com/James-somers-herokus-ugly-secret-annotated\">RapGenius incident</a>. It turns out that simple improvements to randomized routing can dramatically improve the performance! Sparrow is a distributed scheduling algorithm for low latency, high throughput workloads. We'll review the Sparrow algorithm, and learn the tricks that they used. Then, we'll discuss other applications of Sparrow, besides the big-data map-reduce application it was created for. </p> <p><b>Bio</b></p> <p>David Greenberg loves learning. He currently works at Two Sigma, where he leads several efforts to build reliable, distributed cluster computing environments. He enjoys reading a good paper with glass of scotch on a cold winter night. Given this winter, there's been a lot of papers :)</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/1/b/8/c/600_348067052.jpeg\" /></p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer and pizza. </p> <p>After David presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you never get around to it, and if you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/89\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above, please send us a pull request. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/4/5/8/600_358182072.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/6/f/6/600_358182742.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/0/0/600_358182752.jpeg","width":null}],"time":1398726000000,"title":"#3 => David Greenberg on Sparrow: Distributed, Low Latency Scheduling","url":"https://www.meetup.com/papers-we-love/events/174731732/","utcOffset":-14400000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.73929214477539,"lon":-73.98936462402344,"name":"Viggle Inc","postalCode":null}},"175964662":{"description":"<p>We're ecstatic to have <b>Chas Emerick</b> presenting <a href=\"http://hal.upmc.fr/docs/00/55/55/88/PDF/techreport.pdf\">A comprehensive study of Convergent and Commutative Replicated Data Types</a> by Marc Shapiro, Nuno Preguiça, Carlos Baquero, and Marek Zawirski (2011). </p> <p><b>Intro</b></p> <p><a href=\"http://hal.upmc.fr/docs/00/55/55/88/PDF/techreport.pdf\">'A comprehensive study of Convergent and Commutative Replicated Data Types'</a> by Shapiro et al.</p> <p>Conflict-free Replicated Data Types (CRDTs) are a formalism for providing practical data and programming primitives for use in distributed systems applications without necessitating expensive (and sometimes impractical) consensus mechanisms.  Their key characteristic is that they provide conflict-free \"merging\" of distributed concurrent updates given only the weak guarantees of eventual consistency.</p> <p>While this paper did not coin the term 'CRDT', it was the first to provide a comprehensive treatment of their definition, semantics, and possible construction separate from and beyond previous implementations of distributable datatypes that happened to provide CRDT-like semantics.</p> <p>In the paper, the authors:</p> <p>• Construct a modern taxonomy of data types that can be characterized has having desirable conflict-resolution properties given multiple distributed, concurrent actors manipulating shared data without coordination or consensus (a.k.a. \"eventual consistency\").</p> <p>• Describe a set of formal properties necessary to implement these data types, defining both local programming interfaces and distributed replication semantics and requirements.</p> <p><i>Related topics: Eventual consistency, consensus, CAP theorem, (semi-)lattices, Bloom(L), operational transforms, data replication</i></p> <p><b>Bio</b></p> <p><a href=\"http://cemerick.com\">Chas Emerick</a> (<a href=\"http://twitter.com/cemerick\">@cemerick</a>) is a long-time contributor to the Clojure and ClojureScript languages and ecosystem, and is a coauthor of the <a href=\"http://clojurebook.com\">'Clojure Programming'</a> book from O’Reilly. His current mission is to help build <a href=\"http://quilt.org\">Quilt</a>.</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer and pizza. </p> <p>After Chas presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't get around to it. If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/96\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the <a href=\"https://github.com/papers-we-love/papers-we-love\">repository</a> above, please send us a pull request. We'd love any ideas/questions about this meetup or the Papers-We-Love org addressed with a GitHub issue. Thank you!</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/e/e/c/600_363972012.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/7/0/600_364021392.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/7/a/600_364021402.jpeg","width":null}],"time":1400194800000,"title":"#4 Chas Emerick - A comp study of Convergent & Commutative Replicated Data Types","url":"https://www.meetup.com/papers-we-love/events/175964662/","utcOffset":-14400000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.739418029785156,"lon":-73.98924255371094,"name":"Viggle Inc","postalCode":null}},"178049922":{"description":"<p>In June, we have the pleasure of hearing Aysylu Greenberg, Software Engineer at Google and maintainer of the Clojure library <a href=\"https://github.com/aysylu/loom\">Loom</a>, speaking on the paper \"One VM to Rule Them All\" by Thomas Wuerthinger, Christian Wimmer, et al.</p> <p><b>Paper</b></p> <p>You can find the paper in the <a href=\"https://github.com/papers-we-love/papers-we-love/blob/bc15cfbe998b9dbde6c76480f9264e968e19155d/virtual_machines/README.md\">PWL repository</a> and <a href=\"https://www.cs.purdue.edu/homes/gkrichar/papers/onward2013-wuerthinger-truffle.pdf\">here</a>.</p> <p><b>Intro</b></p> <p>The paper explains how you can write an interpreter and get an optimizing just-in-time (JIT) compiler for free. This enables language designers to focus on features without worrying about the complexities of compiler optimizations and code generation. This paper presents a Java Virtual Machine (JVM) that allows the application to control the JIT compiler behavior at runtime. We'll discuss how various programming languages can take advantage of this framework.</p> <p>To intrigue compiler aficionados, the authors show how combining AST node rewriting during interpretation, optimization, and deoptimization produces high performance code from the interpreter without a language-specific compiler. In addition, they present how features of a variety of programming languages, such as JavaScript, Ruby, Python, R and others, map on the framework.</p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/6/6/c/8/600_354266312.jpeg\" /></p> <p><b>Bio</b></p> <p>Aysylu Greenberg has many hobbies. By day, she works on search infrastructure at Google. For fun, she writes open-source libraries in Clojure, ponders the design of systems that deal with inaccuracies, paints and sculpts. Her curiosity for everything new and unexplored drives her to seek out cutting edge research papers. You can find <a href=\"https://twitter.com/aysylu22\">@aysylu22</a> on <a href=\"https://github.com/aysylu\">github.com/aysylu</a> and <a href=\"http://aysy.lu\" class=\"linkified\">http://aysy.lu</a>.</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer and pizza. </p> <p>After Aysylu presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you never get around to it, and if you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/102\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above, please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/f/a/4/600_377356292.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/f/c/2/600_377356322.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/f/d/6/600_377356342.jpeg","width":null}],"time":1403132400000,"title":"#5 => Aysylu Greenberg on One VM to Rule Them All","url":"https://www.meetup.com/papers-we-love/events/178049922/","utcOffset":-14400000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.739418029785156,"lon":-73.98924255371094,"name":"Viggle Inc","postalCode":null}},"182798272":{"description":"<p>We're happy to have <a href=\"https://source.opennews.org/en-US/articles/model-analysis/\">Erik Hinton</a>, developer at the New York Times, presenting on <a href=\"http://strictlypositive.org/diff.pdf\">The Derivative of a Regular Type is its Type of One-Hole Contexts</a> by Conor McBride.</p> <p><b>Intro</b></p> <p>Papers are generally loved for one of two reasons. Either the paper is foundational, siring a lineage of important research, or the paper is useful, guiding readers toward clever optimizations, fault-tolerant solutions, and non-intuitive hacks. \"The Derivative of a Regular Type is its Type of One-Hole Contexts\" is neither. Only a few papers build on McBride's work and the conclusions of the paper, though promising, haven't yet found any real employ.</p> <p>This paper is lovable, fun, and important because it is a radical thought experiment in the limits of abstraction. The paper poses the question: we call data types \"algebraic\", so can we \"do calculus\" on them? Surely, the nomenclature is just coincidental? What would it even mean to take the derivative of a data type? The paper stretches algebraic data types to what should be their breaking point and then demonstrates that it's not a breaking point ay all. By considering the paper's set-up and implications, we gain a deeper understanding of types and what they abstract. </p> <p>As it will turn out, you can take the derivative of data type and the result is meaningful. The derivative of an algebraic type is another data type, namely the type that can represent any specific context in the original type, any position in the original structure. This relationship is eerily similar to the relationship of functions to their derivatives (roughly, the contextual rate of change) that we all learned in high school. </p> <p>• No previous knowledge of calculus, algebraic data types, zippers, contexts or anything else is required.</p> <p>This talk will cover:</p> <p>- What is an algebraic data type? </p> <p>- What is a zipper and its sister structure, the one-hole context?</p> <p>- How can we derive a one-hole context from any given type? (How can we represent a specific location in an arbitrarily complex tree, type, etc)</p> <p>- What are the one-hole contexts of common types: the list, the binary tree, the ternary tree, and the rose tree?</p> <p>- Why would anyone care?</p> <p><b>Bio</b></p> <p>Erik Hinton (<a href=\"https://twitter.com/erikhinton\">@erikhinton</a>) is an interactive developer for The New York Times. His interests include building a platform for the digital humanities, subversively deploying Haskell applications when no one is watching, analytic philosophy, and the connections between medieval mystical Judaism and all of the above.</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer and pizza. </p> <p>After Erik presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/118\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/4/a/3/600_434597571.jpeg","width":null}],"time":1404946800000,"title":"#6 Erik Hinton on The Derivative of a Reg. Type is its Type of One-Hole Contexts","url":"https://www.meetup.com/papers-we-love/events/182798272/","utcOffset":-14400000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.739418029785156,"lon":-73.98924255371094,"name":"Viggle Inc","postalCode":null}},"184704082":{"description":"<p>We're elated to have <a href=\"http://leifwalsh.com/\">Leif Walsh</a>, engineer at <a href=\"http://www.tokutek.com/\">Tokutek</a>, presenting on <a href=\"http://www.ics.uci.edu/~eppstein/261/BenFar-LCA-00.pdf\">The LCA Problem Revisited</a> by Michael A. Bender and Martin Farach-Colton.</p> <p><b>Intro</b></p> <p>My favorite problems are always those with the highest ratio of difficulty in solving to difficulty in stating.  The <i>lowest common ancestor</i> problem exemplifies this.  It was first stated in <a href=\"http://dl.acm.org/citation.cfm?doid=800125.804056\">1973</a>, and can be described to anyone in two sentences, or with one sentence and a picture.  But it took 11 years before an optimal solution was discovered, and another 16 before an understandable and implementable solution with the same bounds was presented, in this paper, <i>The LCA Problem Revisited</i>.  This problem is furthermore satisfying because its bounds are so tight: pre-processing takes as long as just reading the input, and queries are constant time.</p> <p><i>The LCA Problem Revisited</i> is a wonderfully curated journey through a deceptively simple problem that comes together in the end in a beautiful way, and it uses techniques that are powerful in plenty of other places.  Plus, it solves another bonus problem along the way!</p> <p><b>Bio</b></p> <p>Leif Walsh (<a href=\"https://twitter.com/leifwalsh\">@leifwalsh</a>) is a professional cat wrangler. In his free time, he works at Tokutek on Fractal Tree indexing algorithms and implementation, and building stronger distributed systems algorithms into TokuMX, the high performance distribution of MongoDB.</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer and pizza. </p> <p>After Leif presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/123\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/1/4/6/600_404604902.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/1/6/e/600_404604942.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/1/9/6/600_404604982.jpeg","width":null}],"time":1408489200000,"title":"#7 => Leif Walsh on The LCA Problem Revisited","url":"https://www.meetup.com/papers-we-love/events/184704082/","utcOffset":-14400000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.73943328857422,"lon":-73.98924255371094,"name":"Viggle Inc","postalCode":null}},"203968372":{"description":"<p>We're excited to have Camille Fournier , CTO at <a href=\"https://www.renttherunway.com/rtr_home\">Rent the Runway</a>, presenting on <a href=\"http://static.googleusercontent.com/media/research.google.com/en/us/archive/chubby-osdi06.pdf\">The Chubby lock service for loosely-coupled distributed systems</a> by Mike Burrows.</p> <p><b>Intro</b></p> <p>Distributed consensus is often discussed in terms of algorithms: Paxos, ZAB, RAFT, etc. But while the algorithms may be more or less mind-bending, for me the more interesting aspect of distributed consensus is creating systems that support it for the general use case. This paper, on Google's Chubby lock service, is the story of happens when a system stops being a polite theory, and starts getting real-world use. </p> <p>To anyone who has worked in depth as a distributed systems engineer, Chubby is a beautiful paper. It is not a paper about algorithms and their limits, or a toy fringe system created by grad students to test a hypothesis. It is a paper that describes the real tradeoffs that real systems engineers make when designing something to solve a large set of problems well enough. This paper shows the key insights that the authors had as to how such a system might be used, and awareness of what it should do well, and what it should not try to do well. It details how Chubby was designed, but then goes further to describe how it ended up being used when released to the wild, and the surprises and consequences of these design decisions.</p> <p><b>Bio</b></p> <p>Camille Fournier (<a href=\"https://twitter.com/skamille\">@skamille</a>) is the CTO at Rent the Runway. In her limited spare time, she works on various open source projects including Apache ZooKeeper.</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer, water, and pizza. </p> <p>After Camille presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/169\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/e/3/8/600_424852792.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/e/4/c/600_424852812.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/e/6/a/600_424852842.jpeg","width":null}],"time":1413846000000,"title":"#9 Camille Fournier on The Chubby lock service for loosely-coupled dist. systems","url":"https://www.meetup.com/papers-we-love/events/203968372/","utcOffset":-14400000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.739322662353516,"lon":-73.98943328857422,"name":"Viggle Inc","postalCode":null}},"205977012":{"description":"<p>We're excited to have Peter Burka , member of the software research team at <a href=\"http://www.twosigma.com/\">Two Sigma</a>, presenting on <i><a href=\"http://dig.cs.illinois.edu/papers/lambdaRefactoring.pdf\">Crossing the Gap from Imperative to Functional Programming through Refactoring</a></i> by Alex Gyori, Lyle Franklin, Danny Dig, and Jan Lahoda.</p> <p><b>Intro</b></p> <p>The introduction of lambdas to Java 8 might be the most significant change to the Java language since Java 2 was released in 1998. Lambdas and the accompanying functional operations like map and filter promise to allow Java programmers to write clearer, simpler code, and to take better advantage of parallelism.</p> <p>While developers of new code will be able to start using the features immediately, what should we do with the billions of lines of code that have already been written? This paper proposes that we can automatically translate the existing body of Java code to make use of the new features.  This improves the readability of the old code, maintains consistency between new and old code, and potentially improves performance.</p> <p>This paper addresses technical debt, an area of software engineering which is only starting to be addressed in academic literature. The authors solve a practical and important problem with a powerful technical tool.</p> <p><b>Bio</b></p> <p>Peter Burka (<a href=\"https://twitter.com/pburka\">@pburka</a>) is a member of the software research lab at Two Sigma Investments. He’s interested in many areas of software development, and has recently been dividing his time between exploring programming for many-core devices and finding ways to address technical debt through automation. Previously, he helped develop IBM’s J9 Java virtual machine, where he built the balanced garbage collector and ported the JVM to Palm Pilot, among other achievements. Peter has a great fondness for Smalltalk and is pleased that, 35 years on, its influence can still be seen in so many languages and systems.</p> <p><b>Paper Abstract</b></p> <p>Java 8 introduces two functional features: lambda expressions and functional operations like map or filter that apply a lambda expression over the elements of a Collection. Refactoring existing code to use these new features enables explicit but unobtrusive parallelism and makes the code more succinct. However, refactoring is tedious: it requires changing many lines of code. It is also error-prone: the programmer must reason about the control-, data-flow, and side-effects. Fortunately, refactorings can be automated. We designed and implemented LambdaFicator, a tool which automates two refactorings. The first refactoring converts anonymous inner classes to lambda expressions. The second refactoring converts for loops that iterate over Collections to functional operations that use lambda expressions. Using 9 open-source projects, we have applied these two refactorings 1263 and 1709 times, respectively. The results show that LambdaFicator is useful: (i) it is widely applicable, (ii) it reduces the code bloat, (iii) it increases programmer productivity, and (iv) it is accurate.</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer, water, and pizza. </p> <p>After Peter presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/175\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/9/8/2/600_413534722.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/9/9/6/600_413534742.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/9/a/a/600_413534762.jpeg","width":null}],"time":1411513200000,"title":"#8 Peter Burka - Crossing the Gap from Imp. to Func. Prog. through Refactoring","url":"https://www.meetup.com/papers-we-love/events/205977012/","utcOffset":-14400000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.739322662353516,"lon":-73.98943328857422,"name":"Viggle Inc","postalCode":null}},"214029542":{"description":"<p>We're thrilled to have Jeff Larson, data editor Data Editor at ProPublica, presenting <a href=\"http://gatekeeper.dec.com/ftp/pub/dec/SRC/publications/broder/positano-final-wpnums.pdf\">On the resemblance and containment of documents</a> by Andrei Z. Broder.</p> <p><b>Intro</b></p> <p>Increasingly Journalists are dealing with ever larger document dumps, and in order to find interesting stories in these troves, they have to cluster the documents to separate the wheat from the chaff. The size of these dumps often means that traditional algorithms either are too complex and take too long, or they rely on apriori constants like the number of clusters to search for.</p> <p>Jeff Larson will present a novel algorithm called minhashing that was invented at AltaVista in order to loosely cluster similar documents. The paper \" On the resemblance and containment of documents\" relies on a hash collisions to create document fingerprints and shows that documents can be clustered in linear time without knowledge of the entire document corpus. This algorithm has been a key tool in some of ProPublica's biggest investigations, and has allowed reporters to shine light on topics such as political astroturfing and international money laundering.</p> <p><b>Bio</b></p> <p>Jeff Larson (<a href=\"https://twitter.com/thejefflarson\">@thejefflarson</a>) is ProPublica's data editor and winner of the 2011 Livingston Award for the series \"<a href=\"http://www.propublica.org/series/redistricting\">Redistricting: how Powerful Interests are Drawing You Out of a Vote</a>.\" He was on the team reporting on the Snowden files in 2013 with the Guardian and the New York times, and was the lead reporter behind the NSA stories \"<a href=\"http://www.propublica.org/article/the-nsas-secret-campaign-to-crack-undermine-internet-encryption\">The NSA’s Secret Campaign to Crack, Undermine Internet Security</a>\" and \"<a href=\"http://www.propublica.org/article/spy-agencies-probe-angry-birds-and-other-apps-for-personal-data\">Spy Agencies Probe Angry Birds and Other Apps for Personal Data</a>.\"</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer, water, and pizza. </p> <p>After Jeff presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/197\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>December's meetup is sponsored by <a href=\"http://kisspatent.com/\">KISSPatent</a> and </i> <a href=\"https://www.theladders.com/\">The Ladders</a> (<a href=\"https://twitter.com/theladdersdev\">@TheLaddersDev</a>)</p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/d/d/4/1/600_431876641.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/b/5/1/600_432563377.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/b/5/3/600_432563379.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/b/5/5/600_432563381.jpeg","width":null}],"time":1418774400000,"title":"#11 => Jeff Larson - On the resemblance and containment of documents","url":"https://www.meetup.com/papers-we-love/events/214029542/","utcOffset":-18000000,"venue":{"address1":"225 Broadway, 23rd Floor","address2":null,"city":"New York","country":"us","lat":40.71199417114258,"lon":-74.00867462158203,"name":"Refinery29","postalCode":""}},"214400572":{"description":"<p>We're thrilled to have <a href=\"http://jeanyang.com/\">Jean Yang</a>, PhD student at MIT, presenting on <a href=\"http://www.cs.cmu.edu/~crary/819-f09/Hoare69.pdf\">An Axiomatic Basis for Computer Programming</a> by C.A.R. Hoare. </p> <p><b>Intro</b></p> <p>Our lives now run on software. Bugs are becoming not just annoyances for software developers, but sources of potentially catastrophic failures. A careless programmer mistake could leak our social security numbers or crash our cars. While testing provides some assurance, it is difficult to test all possibilities in complex systems--and practically impossible in concurrent systems. For the critical systems in our lives, we should demand mathematical guarantees that the software behaves the way the programmer expected.</p> <p>A single paper influenced much of the work towards providing these mathematical guarantees. C.A.R. Hoare’s seminal 1969 paper “An Axiomatic Basis for Computer Programming” introduces a method of reasoning about program correctness now known as Hoare logic. In this paper, Hoare provides a technique that 1) allows programmers to express program properties and 2) allows these properties to be automatically checked. These ideas have influenced decades of research in automated reasoning about software correctness.</p> <p>In this talk, I will describe the main ideas in Hoare logic, as well as the impact of these ideas. I will talk about my personal experience using Hoare logic to verify memory guarantees in an operating system. I will also discuss takeaway lessons for working programmers.</p> <p><b>Bio</b></p> <p>Jean Yang (<a href=\"https://twitter.com/jeanqasaur\">@jeanqasaur</a>) is a final-year PhD student at MIT. For her PhD thesis she has created <a href=\"http://projects.csail.mit.edu/jeeves/\">Jeeves</a>, a programming language for automatically enforcing information flow policies for security and privacy. You may be more familiar with one of her other projects, <a href=\"http://haskellryangosling.tumblr.com/\">Haskell Ryan Gosling</a>.</p> <p><b>Details</b></p> <p>This event is sponsored by <a href=\"https://www.theladders.com/\">The Ladders</a> (<a href=\"https://twitter.com/theladdersdev\">@TheLaddersDev</a>)</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be beer, water, and pizza. </p> <p>After Jean presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/199\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/d/f/600_431862975.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/e/3/600_431862979.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/e/b/600_431862987.jpeg","width":null}],"time":1416355200000,"title":"#10 => Jean Yang on An Axiomatic Basis for Computer Programming","url":"https://www.meetup.com/papers-we-love/events/214400572/","utcOffset":-18000000,"venue":{"address1":"902 Broadway 11","address2":null,"city":"New York","country":"US","lat":40.658634185791016,"lon":-73.97522735595703,"name":"Viggle Inc","postalCode":null}},"220021234":{"description":"<p>We're extremely thrilled to host Sam Tobin-Hochstadt, Assistant Professor in the School of Informatics and Computing at Indiana University, presenting <b><a href=\"https://www.cs.utah.edu/plt/publications/macromod.pdf\">Composable and Compilable Macros</a> </b>by <a href=\"http://www.cs.utah.edu/~mflatt/\">Matthew Flatt</a> of the University of Utah.<i></i></p> <p><b>Intro</b></p> <p>\"<i>Composable and Compilable Macros</i>\" introduces the Racket module system, which addresses the following problem: When you have macros that run programs at compile-time, how does this interact with separate compilation and ahead-of-time compilation. The paper introduces \"phases\", which enable Racket to behave the same regardless of when and how you compile your program. It also introduces the idea of writing different modules in different languages, which is now used for systems like Typed Racket.</p> <p>A few related papers:</p> <p>- <a href=\"http://www.cs.indiana.edu/~dyb/pubs/LaSC-5-4-pp[masked].pdf\">Syntactic Abstraction in Scheme</a>, Dybvig Hieb &amp; Bruggeman, Lisp andSymbolic Computation 1993</p> <p>- <a href=\"http://www.cs.utah.edu/plt/publications/jfp12-draft-fcdf.pdf\">Macros that Work Together</a>, Flatt, Findler, Culpepper, &amp; Darais, JFP 2012- Submodules in Racket, Flatt GPCE 2013</p> <p>- <a href=\"http://www.cs.indiana.edu/~dyb/pubs/implicit-phasing.pdf\">Implicit phasing for R6RS libraries</a>,  Ghuloum &amp; Dybvig, ICFP 2007</p> <p>- <a href=\"http://www.cs.indiana.edu/~dyb/pubs/popl99.pdf\">Extending the scope of syntactic abstraction</a>, Waddell &amp; Dybvig, POPL 1999</p> <p><b>Bio</b></p> <p><a href=\"http://samth.github.io/\">Sam Tobin-Hochstadt</a> (<a href=\"https://twitter.com/samth\">@samth</a>) is an Assistant Professor in the School of Informatics and Computing at Indiana University. He has worked on dynamic languages, type systems, module systems, and metaprogramming, including creating the Typed Racket system and popularizing the phrase “scripts to programs.” He is a member of the ECMA TC39 working group responsible for standardizing JavaScript, where he co-designed the module system for ES6, the next version of JavaScript. He received his PhD in 2010 from Northeastern University under Matthias Felleisen.</p> <p>--------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><b><a href=\"https://www.twosigma.com/\">TwoSigma</a> </b>- Platinum Sponsor of the New York chapter</i></p> <p>--------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Sam presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/274\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>February's meetup is sponsored by</i></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/7/5/2/f/600_433949999.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/5/3/7/600_434030487.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/5/3/b/600_434030491.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/e/8/6/d/600_434039501.jpeg","width":null}],"time":1423180800000,"title":"#13 - Sam Tobin-Hochstadt on Composable and Compilable Macros","url":"https://www.meetup.com/papers-we-love/events/220021234/","utcOffset":-18000000,"venue":{"address1":"35 East 21st St, FL 10, 10010","address2":null,"city":"New York","country":"us","lat":40.739845275878906,"lon":-73.9884033203125,"name":"Tumblr, Inc","postalCode":""}},"220081725":{"description":"<p>We're riveted to have Andrew Turley, lead software engineer on the platform team at<a href=\"https://www.theladders.com/\">TheLadders</a>, presenting<a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/garbage_collection/incremental_mature_garbage_collection_using_the_train_algorithm.pdf?raw=true\">Incremental Mature Garbage Collection Using the Train Algorithm</a> by Jacob Seligmann &amp; Steffen Grarup.  </p> <p><b>Intro</b></p> <p>Automatic garbage collection has spared programmers from an entire class of programming errors related to memory leaks and attempting to access objects that were incorrectly freed. As programs have grown in size and complexity, so have the systems that manage garbage collection. Each algorithm makes a different set of tradeoffs between factors such as the space used by objects, the space used by bookkeeping, the number of unused objects (garbage) that remain uncollected, the time spent in allocation, and the time spent in<br/>collection.</p> <p>The Train Algorithm is an incremental generational garbage collector that was designed to deal with the long and unpredictable pause times caused by other algorithms. It does this by grouping objects together on \"cars\" in \"trains\". The algorithm provides a strategy for moving objects from the younger generation into different cars, moving objects from one car to another, and collecting cars and trains. It was first described by Hudson and Moss in the paper \"Incremental<br/>Collection of Mature Objects\".</p> <p>In their paper \"<a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/garbage_collection/incremental_mature_garbage_collection_using_the_train_algorithm.pdf?raw=true\">Incremental Mature Garbage Collection Using the Train Algorithm</a>,\" Seligmann and Grarup describe what they believe is the first implementation of the Train Algorithm, which they used to replace the traditional mark-and-sweep collector that was used in the BETA programming language. They discuss their implementation and present information about the performance characteristics of the new algorithm as compared to the original.</p> <p><b>Bio</b></p> <p>Andrew Turley (<a href=\"https://twitter.com/casio_juarez\">@casio_juarez</a>) is a lead software engineer on the platform team at <a href=\"https://www.theladders.com/\">TheLadders</a>, where he builds infrastructure by linking Storm topologies together using RabbitMQ. He has also had numerous professional brushes with lower levels of the software stack, including building embedded systems for processing audio at DigiDesign, and helping to improve the performance of iOS at<br/>Apple.</p> <p>--------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><b><a href=\"https://www.twosigma.com/\">TwoSigma</a> </b>- Platinum Sponsor of the New York chapter</i></p> <p>--------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Andrew presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/258\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>January's meetup is sponsored by</i></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> <p><i><br/></i></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/d/e/e/600_434655854.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/d/f/0/600_434655856.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/d/f/1/600_434655857.jpeg","width":null}],"time":1424736000000,"title":"Andrew Turley: Incremental Mature Garbage Collection Using the Train Algorithm","url":"https://www.meetup.com/papers-we-love/events/220081725/","utcOffset":-18000000,"venue":{"address1":"35 East 21st St, FL 10, 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"220902753":{"description":"<p>We're enthusiastic to have <a href=\"http://www.johnmyleswhite.com/\">John Myles White</a>, <a href=\"http://www.oreilly.com/pub/au/4730\">author</a> and <a href=\"http://www.johnmyleswhite.com/notebook/category/julia/\">Julia programmer</a>, presenting<b> <a href=\"http://www.cs.cmu.edu/~crary/819-f09/Strachey67.pdf\">Fundamental Concepts in Programming Languages</a></b> by <a href=\"http://en.wikipedia.org/wiki/Christopher_Strachey\">Christopher Strachey</a>.  </p> <p><b>Intro</b></p> <p>Strachey's lectures on \"Fundamental Concepts in Programming Languages\" provided an extremely broad survey of core issues in programming language design that provided much of the terminology we use today, including definitions of the kinds of polymorphism and the kinds of expressions we see in programming languages. Published as a paper many years later, Strachey's lectures provide an especially readable overview of programming languages concepts.</p> <p><b>Bio</b></p> <p>John Myles White (<a href=\"https://twitter.com/johnmyleswhite\">@johnmyleswhite</a>) is a Julia hacker who loves thinking about the ways in which the design of technical programming languages influences the way in which we think about statistics and machine learning. He's written <a href=\"http://www.oreilly.com/pub/au/4730\">two books about machine learning for O'Reilly</a> and works at Facebook.</p> <p>-----------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><b><a href=\"https://www.twosigma.com/\">TwoSigma</a> </b>- Platinum Sponsor of the New York chapter</i></p> <p>-----------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After John presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/286\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>March's meetup is sponsored by</i></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/9/c/600_435342908.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/9/7/600_435342903.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/9/9/600_435342905.jpeg","width":null}],"time":1426546800000,"title":"John Myles White on Fundamental Concepts in Programming Languages","url":"https://www.meetup.com/papers-we-love/events/220902753/","utcOffset":-14400000,"venue":{"address1":"35 East 21st St, FL 10, 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"221194444":{"description":"<p>We're so excited to have Neha Narula, a PhD student in <a href=\"http://pdos.csail.mit.edu/\">PDOS</a>, the Parallel and Distributed Operating Systems group at MIT, and an amazing <a href=\"https://www.youtube.com/watch?v=Mbg1COjhsJU\">speaker</a> and <a href=\"http://pdos.csail.mit.edu/~neha/\">researcher</a>, presenting on <a href=\"http://web.mit.edu/amdragon/www/pubs/commutativity-sosp13.pdf\">The Scalable Commutativity Rule: Designing Scalable Software for Multicore Processors</a> by Clements, Kaashoek, Zeldovich, Morris, and Kohler.</p> <p><b>Intro</b></p> <p>Moore's law is over, or at least, we won't be making programs go faster by running on faster processors, but instead by parallelizing our code to use more of them.  Reasoning about concurrent code is difficult; but it's also very hard to understand whether your design has latent scalability bottlenecks until you can actually run it on many cores.  And what if the problem is in your <i>interface, </i>instead of just the implementation?</p> <p>This paper presents a simple, elegant rule:  whenever interface operations commute, they can be implemented in a way that scales.  </p> <p>The authors apply this idea to Linux, and create a new operating system by using the rule, sv6.  Their paper also comes with software, <a href=\"http://pdos.csail.mit.edu/commuter/\">COMMUTER</a>, which can help developers evaluate their interfaces to find opportunities for scaling.</p> <p>This is a very powerful idea, and probably has applications in other areas like distributed systems. In this talk I'll present the paper, and speculate a bit about where else this research could be useful.</p> <p><b>Bio</b></p> <p>Neha Narula (<a href=\"https://twitter.com/neha\">@neha</a>) is a PhD candidate at MIT building fast, scalable distributed systems. In a previous life she was a Senior Software Engineer at Google, where she designed the first version of <i>Blobstore</i>, a system for storing and serving petabytes of immutable data, and worked on <a href=\"http://code.google.com/p/nativeclient\"><i>Native Client</i></a>, a system for running native code securely through the browser.</p> <p>-----------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><b><a href=\"https://www.twosigma.com/\">TwoSigma</a> </b>- Platinum Sponsor of the New York chapter</i></p> <p>-----------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Neha presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/291\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>April's meetup is sponsored by</i> </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/4/5/3/3/600_435437715.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/e/6/8/600_435884648.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/e/6/d/600_435884653.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/e/6/f/600_435884655.jpeg","width":null}],"time":1427929200000,"title":"Neha Narula on The Scalable Commutativity Rule","url":"https://www.meetup.com/papers-we-love/events/221194444/","utcOffset":-14400000,"venue":{"address1":"35 East 21st St, FL 10, 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"222366060":{"description":"<p>We're thrilled to have Samy Al Bahra, co-founder of <a href=\"http://backtrace.io/\">Backtrace</a> and founder of <a href=\"http://concurrencykit.org/\">Concurrency Kit</a>, presenting on <a href=\"http://www.rdrop.com/users/paulmck/RCU/hart_ipdps06.pdf\">Making Lockless Synchronization Fast: Performance Implications of Memory Reclamation</a> by Hart, McKenney, and Brown.</p> <p><b>Intro</b></p> <p>Multicore systems are ubiquitous but modern concurrent programming techniques still do not see wide-spread adoption. Most concurrent software (developed in low-level languages) still relies on error-prone and unscalable memory management techniques for correctness despite the introduction of superior methods over 30 years ago. Safe memory reclamation allows for performant and robust memory management that is also suitable for advanced concurrent programming techniques such as non-blocking synchronization. If properly used, safe memory reclamation techniques allow improved performance and simplicity without the complexity of full-blown garbage collection.</p> <p>This paper provides a terrific overview of common safe memory reclamation mechanisms and then explores their performance implications. In this talk, I will do the same but with stronger emphasis on the introductory aspects of safe memory reclamation and contrast with a refreshed performance analysis.</p> <p><b>Bio</b></p> <p>Samy Al Bahra (<a href=\"https://twitter.com/0xf390\">@0xf390</a>) is the co-founder of <a href=\"http://backtrace.io\">Backtrace</a>, where he is helping build a modern debugging platform for today's complex applications. Prior to Backtrace, Samy was a principal engineer at AppNexus, where he played a lead role in the architecture and development of many mission-critical components of the ecosystem. His work at AppNexus was instrumental in scaling the system to 18 billion impressions with orders of magnitude in efficiency improvements. Prior to AppNexus, Samy was behind major performance improvements to the core technology at Message Systems. At the George Washington University High Performance Computing Laboratory, Samy worked on the UPC programming language, heterogeneous computing and multicore synchronization. Samy is also the founder of the <a href=\"http://concurrencykit.org/\">Concurrency Kit project</a>, which several leading technology companies rely on for scalability and performance. Samy serves on the ACM Practitioners Board.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><b><a href=\"https://www.twosigma.com/\">TwoSigma</a> </b>- Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Samy presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/301\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>May's meetup is sponsored by</i> </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/6/b/0/600_438026288.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/6/b/1/600_438026289.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/6/b/2/600_438026290.jpeg","width":null}],"time":1432681200000,"title":"Samy Al Bahra on Making Lockless Synchronization Fast","url":"https://www.meetup.com/papers-we-love/events/222366060/","utcOffset":-14400000,"venue":{"address1":"35 East 21st St, FL 1 (Ground Floor), 10010","address2":null,"city":"New York","country":"us","lat":40.73961639404297,"lon":-73.98841857910156,"name":"Tumblr, Inc","postalCode":""}},"223064862":{"description":"<p>We're happy to have Jason Ganetsky, tech lead of storage for Google Cloud Pub/Sub, presenting on <a href=\"http://community.haskell.org/~simonmar/papers/evalapplyjfp06.pdf\">Making a Fast Curry: Push/Enter vs. Eval/Apply for Higher-order Languages</a> by Simon Marlow and Simon Peyton Jones.</p> <p><b>Intro</b> </p> <p>Higher-order languages that encourage currying are typically implemented using one of two basic evaluation models: push/enter or eval/apply. Implementors use their intuition and qualitative judgements to choose one model or the other. Our goal in this paper is to provide, for the first time, a more substantial basis for this choice, based on our qualitative and quantitative experience of implementing both models in a state-of-the-art compiler for Haskell.</p> <p>Our conclusion is simple, and contradicts our initial intuition: compiled implementations should use eval/apply.</p> <p><b>Bio</b></p> <p><a href=\"https://about.me/jasonganetsky\">Jason Ganetsky</a> (<a href=\"https://twitter.com/ganetsky\">@ganetsky</a>) is a software engineer at Google. He is tech lead of storage for <a href=\"https://cloud.google.com/pubsub/docs\">Google Cloud Pub/Sub</a>. Prior to working at Google, Jason worked at various startups in NYC, and was briefly enrolled in a Computer Science PhD program at Carnegie Mellon. It was that brief stint that sparked the beginning of Jason's lifelong love of functional programming and type systems.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Jason presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/309\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>June's meetup is sponsored by</i> </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/1/3/8/d/600_439265005.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/1/3/8/f/600_439265007.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/1/3/9/0/600_439265008.jpeg","width":null}],"time":1435100400000,"title":"Jason Ganetsky on Making a Fast Curry","url":"https://www.meetup.com/papers-we-love/events/223064862/","utcOffset":-14400000,"venue":{"address1":"35 East 21st St, FL 10, 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"224260466":{"description":"<p>It's going to be a special evening. After taking the month of July off, we're coming back with the <a href=\"http://www.meetup.com/papers-we-love/events/163406212/\">original</a> Papers We Love speaker, <a href=\"http://michaelrbernste.in\">Michael R. Bernstein</a>, co-host of <a href=\"http://beatsryetypes.com/\">Beats, Rye, &amp; Types</a> and <a href=\"https://codeclimate.com/\">Code Climate</a> hustler, and he’s very excited to be back, presenting on <a href=\"http://homepages.inf.ed.ac.uk/wadler/papers/propositions-as-types/propositions-as-types.pdf\">Propositions as Types</a> by <a href=\"http://homepages.inf.ed.ac.uk/wadler/\">Philip Wadler</a> and showcasing some work from <a href=\"http://the-little-prover.github.io/\">The Little Prover</a> by <a href=\"http://www.cs.indiana.edu/~dfried/\">Friedman</a> and <a href=\"http://www.ccs.neu.edu/home/cce/\">Eastlund</a>!</p> <p><b>Intro </b></p> <p>I’ll (Michael) be talking about Philip Wadler’s paper \"<b>Propositions as Types</b>,\" which starts out with the following sentence:</p> <p><b><i>\"Powerful insights arise from linking two fields of study previously thought separate.\"</i></b></p> <p>And just keeps on going from there. In less than 9 full pages, Wadler assembles an exuberant, hilarious take on the deep, meaningful connections between mathematics, philosophy, and computer science.</p> <p>I’ll also be showing off some work from Daniel P. Friedman and Carl Eastlund’s recent book \"<a href=\"https://mitpress.mit.edu/books/little-prover\"><b>The Little Prover</b></a>,\" which implements a small theorem prover in Scheme, to demonstrate some of the connections Wadler discusses in his paper.</p> <p><b>Bio</b></p> <p><a href=\"http://michaelrbernste.in\">Michael R. Bernstein</a> (<a href=\"http://twitter.com/mrb_bk\">@mrb_bk</a>) loves you. He lives in Takoma Park, MD and spends most of his time thinking about pottery, obscure LPs, food, and the intersection of philosophy and Computer Science.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Michael presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/319\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>August's meetup is sponsored by</i> </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/5/9/8/600_431498296.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/8/0/b/600_441078443.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/8/0/d/600_441078445.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/8/0/f/600_441078447.jpeg","width":null}],"time":1439852400000,"title":"Michael Bernstein on Propositions as Types","url":"https://www.meetup.com/papers-we-love/events/224260466/","utcOffset":-14400000,"venue":{"address1":"35 East 21st St, FL 1 (Ground Floor), 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"224637574":{"description":"<p>We're elated to have Ryan Zezeski, kernel hacker and Baltimorean, presenting on <a href=\"https://www.usenix.org/legacy/publications/library/proceedings/bos94/full_papers/bonwick.a\">The Slab Allocator: An Object-Caching Kernel Memory Allocator</a> by Jeff Bonwick. </p> <p><b>Intro </b></p> <p>In 1994 <a href=\"https://en.wikipedia.org/wiki/Jeff_Bonwick\">Jeff Bonwick</a> presented his Slab Allocator at the USENIX SummerTechnical Conference. Over two decades later Google reports 35-thousand results for \"slab allocator\". CiteSeerX reports 93 citations. And many modern kernel allocators are based on his design, such as illumos, Linux, and FreeBSD. Jeff's design, along with the original paper, remains just as relevant today as it was 21 years ago. Join me as I tell the tale of the Slab Allocator: where it came from, what it is, why it's important, and where it's going.</p> <p><b>Bio</b></p> <p><a href=\"http://michaelrbernste.in\">&lt;/a&gt;Ryan Zezeski (&lt;a href=\"https://twitter.com/rzezeski\"&gt;@rzezeski</a>) is an aspiring kernel hacker working at <a href=\"https://www.lucera.com/\">Lucera Financial Infrastructures</a>. A primary contributor to the <a href=\"http://docs.basho.com/riak/latest/\">Riak</a> distributed database. Author of the <a href=\"https://github.com/rzezeski/try-try-try\">try-try-try</a> Riak Core tutorials. And creator of project <a href=\"https://github.com/basho/yokozuna\">Yokozuna</a>: a program which combined the powers of Riak and Solr. He once wrote a <a href=\"http://zinascii.com/2014/crossed-signals.html\">blog post</a> on POSIX Real Time Signals that made a bunch of people mad and caused a bug to be filed against Oracle Solaris. Ryan loves reading about arcane operating system stuff and occasionally writes about it at <a href=\"http://zinascii.com/\">zinascii.com</a>. His spirit animal is <a href=\"https://en.wikipedia.org/wiki/W._Richard_Stevens\">W. Richard Stevens</a>.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Ryan presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/323\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>September's meetup is sponsored by</i> </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/9/6/b/e/600_442298590.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/9/6/c/3/600_442298595.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/9/6/c/5/600_442298597.jpeg","width":null}],"time":1442358000000,"title":"Ryan Zezeski's Memory by the Slab: The Tale of Bonwick's Slab Allocator","url":"https://www.meetup.com/papers-we-love/events/224637574/","utcOffset":-14400000,"venue":{"address1":"35 East 21st St, FL 1 (Ground Floor), 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"225369741":{"description":"<p>It's with great pleasure to announce that we'll have <a href=\"http://tomasp.net/\">Tomas Petricek</a>, PhD student at University of Cambridge, functional programer, and F# enthusiast, presenting on the 1975 book -- <a href=\"https://en.wikipedia.org/wiki/Against_Method\">Against Method: Outline of an Anarchist Theory of Knowledge</a> by <a href=\"https://en.wikipedia.org/wiki/Paul_Feyerabend\">Paul Feyerabend</a>.</p> <p>This will be a little different! There's no open-access PDF version of the book around, but you can find at bookstores, <a href=\"http://www.amazon.com/Against-Method-Paul-Feyerabend/dp/1844674428\">Amazon</a>, or on the Internet... or so I've heard. </p> <p><b>Intro </b></p> <p>How is computer science research done? What we take for granted and what we question? And how do theories in computer science tell us something about the real world? Those are some of the questions that may inspire computer scientist like me (and you!) to look into philosophy of science. I’ll present the work of one of the more extreme (and interesting!) philosophers of science, Paul Feyerabend. In “Against Method”, Feyerabend looks at the history of science and finds that there is no fixed scientific methodology and the only methodology that can encompass the rich history is ‘anything goes’. We see (not only computer) science as a perfect methodology for building correct knowledge, but is this really the case? To quote Feyerabend: </p> <p><i><b>Science is much more 'sloppy' and 'irrational' than its methodological image.</b></i></p> <p>I’ll be mostly talking about Paul Feyerabend’s “Against Method”, but as a computer scientist myself, I’ll insert a number of examples based on my experience with theoretical programming language research. I hope to convince you that looking at philosophy of science is very much worthwhile if we want to better understand what we do and how we do it as computer scientists!</p> <p><b>Bio</b></p> <p><a href=\"http://michaelrbernste.in\">&lt;/a&gt;&lt;a href=\"http://tomasp.net\"&gt;Tomas Petricek</a> (<a href=\"https://twitter.com/tomaspetricek\">@tomaspetricek</a>) recently submitted his PhD thesis at University of Cambridge on context-aware programming languages. He is active in the functional programming community, contributes to various F# open-source libraries, writes and talks about F# and offers trainings and consulting at <a href=\"http://www.fsharpworks.com/\">fsharpWorks</a>. When he isn’t writing equations or code, he enjoys reading philosophy of science books and <a href=\"http://tomasp.net/blog/tag/philosophy/\">occasionally publishes an essay</a> combining philosophy and computer science.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Tomas presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/332\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>October's meetup is sponsored by</i> </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/2/2/1/600_442816929.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/2/2/2/600_442816930.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/2/2/4/600_442816932.jpeg","width":null}],"time":1444086000000,"title":"Tomas Petricek on Paul Feyerabend's The Against Method","url":"https://www.meetup.com/papers-we-love/events/225369741/","utcOffset":-14400000,"venue":{"address1":"35 East 21st St, FL 1 (Ground Floor), 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"226193314":{"description":"<p>We're delighted to have our old friend, Tom Santero, software engineer at Helium and current FOCO resident, presenting on <a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/buridan.pdf\">Buridan's Principle</a>, a paper by Turing Award-winner, <a href=\"https://en.wikipedia.org/wiki/Leslie_Lamport\">Leslie Lamport</a>.</p> <p><b>Intro </b></p> <p>In 1984 Leslie Lamport began to observe the glitch problem [0] occurs in everyday life. Realizing this phenomenon had not been discussed by psychologists of the day, he set out to describe his observations using the classical formalization of Buridan's ass. Lamport initially failed to have this paper published in various scientific journals, being rejected on grounds of superficiality. It wasn't until 2011, when a reader suggested he resubmit to Foundations of Physics, that the paper was eventually published.</p> <p>Those familiar with the works of Lamport know him as a logician, his life's work has pushed forward the state of the art in areas of mutual exclusion and distributed systems probably more than any other, and so reading Buridan's Principle might strike us as a bit odd, or even obscure. We're in unfamiliar territory with Lamport. Nonetheless, in this paper, Lamport's casual observations lead him to bridge the gap between the humanities and the sciences, providing us readers with what appears to be a universal law of nature: Buridan's Principle. </p> <p>[0] <a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/glitch.pdf\"><a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/glitch.pdf\" class=\"linkified\">http://research.microsoft.com/en-us/um/people/lamport/pubs/glitch.pdf</a></a></p> <p><b>Bio</b></p> <p><a href=\"http://michaelrbernste.in\">&lt;/a&gt;&lt;a href=\"http://tomasp.net\"&gt;</a></p> <p>Tom Santero (<a href=\"https://twitter.com/tsantero\">@tsantero</a>) is a Software Engineer at <a href=\"https://www.helium.com\">Helium Systems</a>, writing Haskell and Erlang to connect things to the internet. Previously, Tom worked at the New York Times on Search infrastructure, and before that he ran evangelism at Basho Technologies. A native New Yorker, Tom recently defected to Fort Collins, CO, where he lives with his two cats nearby an obnoxiously loud freight train. </p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Tom presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/physics/buridans-principle.pdf\">find the paper</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>November's meetup is sponsored by</i> </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/d/b/600_444342971.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/d/e/600_444342974.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/7/d/f/600_444342975.jpeg","width":null}],"time":1447977600000,"title":"Tom Santero on Leslie Lamport's Buridan’s Principle","url":"https://www.meetup.com/papers-we-love/events/226193314/","utcOffset":-18000000,"venue":{"address1":"35 East 21st St, FL 1 (Ground Floor), 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"228110427":{"description":"<p>We're excited to begin the new year with <a href=\"http://nas.sr/\">Ramsey Nasser</a>, an amazing computer scientist, game designer, educator, and all-around person, presenting on <a href=\"http://peterwonka.net/Publications/pdfs/2014.SG.Lipp.PushPull.pdf\">PushPull++</a> by Lipp, Wonka, and Muller.</p> <p><b>Intro </b></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/d/3/7/4/600_445914132.jpeg\" /></p> <p>Of all the ways to manipulate a 3D mesh, the “push/pull” technique popularized by <a href=\"http://www.sketchup.com/\">SketchUp</a> is one of the most approachable and fun. PushPull++ is a recent paper that elaborates on the technique, cleaning up a lot of edge cases and unlocking new features, using wonderfully straightforward math. The potential for 3D modeling tools or procedural mesh generation APIs built on these simple ideas is very exciting.</p> <p>The paper presents the technique and the tool that the authors built. I will focus on the technique, as that’s the part I loved more in this paper.</p> <p>**Also, check out <a href=\"https://www.youtube.com/watch?v=lOYpaJWNPaU\">this video</a> on the work!**</p> <p><b>Bio<br/></b></p> <p>Ramsey Nasser (<a href=\"https://twitter.com/ra\">@ra</a>) is a computer scientist, game designer, and educator based in Brooklyn. He researches programming languages by building tools to make computation more expressive and implementing projects that question the basic assumptions we make about code itself. His games playfully push people out of their comfort zones, and are often written in experimental programming languages of his design. A former <a href=\"http://eyebeam.org/\">Eyebeam</a> fellow and a member of <a href=\"https://twitter.com/ktcoders\">Kitchen Table Coders</a>, when he is not reasoning about abstract unintuitive machines, he builds and maintains vintage motorcycles.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. <b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. If you have any issues getting in, please contact  [masked] or email us directly.</b></p> <p>After Ramsey presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/computer_graphics/pushpull%2B%2B.pdf\">find the paper</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/b/4/3/600_446539267.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/b/4/a/600_446539274.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/b/7/4/600_446539316.jpeg","width":null}],"time":1454025600000,"title":"Ramsey Nasser on PushPull++","url":"https://www.meetup.com/papers-we-love/events/228110427/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"228110831":{"description":"<p>We're **crazy** excited to have <a href=\"http://dtrace.org/blogs/bmc/\">Bryan Cantrill</a>, CTO of Joyent, formerly of Sun Microsystems, presenting on <i><a href=\"https://us-east.manta.joyent.com/bcantrill/public/ppwl-cantrill-jails.pdf\">Jails: Confining the omnipotent root.</a> </i>by Poul-Henning Kamp and Robert Watson and <i><a href=\"https://us-east.manta.joyent.com/bcantrill/public/ppwl-cantrill-zones.pdf\">Solaris Zones: Operating System Support for Consolidating Commercial Workloads</a> </i>by Dan Price and Andy Tucker!</p> <p>You can also catch Bryan presenting at the <a href=\"http://containersummit.io/events/nyc-2016\">NYC Container Summit</a> on February 10th, which also is hosting an <a href=\"https://www.eventbrite.com/e/container-summit-advanced-technical-track-tickets-20708946015\">advanced technical track</a>, which includes hand-on tutorials! Also, <a href=\"https://www.youtube.com/watch?v=-zRN7XLCRhc\">watch this amazing illumos presentation</a> by Bryan in 2011! </p> <p><b>Abstracts</b></p> <p>Jails: Confining the omnipotent root.</p> <p>===========================</p> <p>The traditional UNIX security model is simple but inexpressive. Adding fine-grained access control improves the expressiveness, but often dramatically increases both the cost of system management and implementation complexity. In environments with a more complex management model, with delegation of some management functions to parties under varying degrees of trust, the base UNIX model and most natural extensions are inappropriate at best. Where multiple mutually untrusting parties are introduced, ‘‘inappropriate’’ rapidly transitions to‘‘nightmarish’’, especially with regards to data integrity and privacy protection. The FreeBSD ‘‘Jail’’ facility provides the ability to partition the operating system environment, while maintaining the simplicity of the UNIX‘‘root’’ model. In Jail, users with privilege find that the scope of their requests is limited to the jail, allowing system administrators to delegate management capabilities for each virtual machine environment. Creating virtual machines in this manner has many potential uses; the most popular thus far has been for providing virtual machine services in Internet Service Provider environments.</p> <p>Solaris Zones: Operating System Support for Consolidating Commercial Workloads</p> <p>===========================================</p> <p>Server consolidation, which allows multiple workloads to run on the same system, has become increasingly important as a way to improve the utilization of computing resources and reduce costs. Consolidation is common in mainframe environments, where technology to support running multiple workloads and even multiple operating systems on the same hardware has been evolving since the late 1960’s. This technology is now becoming an important differentiator in the UNIX and Linux server market as well, both at the low end (virtual web hosting) and high end(traditional data center server consolidation).This paper introduces Solaris Zones (zones), a fully realized solution for server consolidation projects in a commercial UNIX operating system. By creating virtualized application execution environments within a single instance of the operating system, the facility strikes a unique balance between competing requirements. On the one hand, a system with multiple workloads needs to run those workloads in isolation, to ensure that applications can neither observe data from other applications nor affect their operation. It must also prevent applications from over-consuming system resources. On the other hand, the system as a whole has to be flexible, manageable, and observable, in order to reduce administrative costs and increase efficiency. By focusing on the support of multiple application environments rather than multiple operating system instances, zones meets isolation requirements without sacrificing manageability.</p> <p><b>Bio</b></p> <p><a href=\"http://michaelrbernste.in\">&lt;/a&gt;&lt;a href=\"http://tomasp.net\"&gt;</a></p> <p>Bryan Cantrill is the CTO at Joyent, where he oversees worldwide development of the <a href=\"http://smartos.org/\">SmartOS</a> and <a href=\"https://www.joyent.com/private-cloud\">SmartDataCenter</a> platforms, and the <a href=\"http://nodejs.org/\">Node.js</a> platform. Prior to joining Joyent, Bryan served as a Distinguished Engineer at Sun Microsystems, where he spent over a decade working on system software, from the guts of the kernel to client-code on the browser. In particular, he co-designed and implemented DTrace, a facility for dynamic instrumentation of production systems that won the Wall Street Journal's top Technology Innovation Award in 2006 and the USENIX Software Tools User Group Award in 2008. Bryan also co-founded the Fishworks group at Sun, where he designed and implemented the DTrace-based analytics facility for the Sun Storage 7000 series of appliances.</p> <p>Bryan received the ScB magna cum laude with honors in Computer Science from Brown University.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza. </p> <p>After Bryan presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also <a href=\"https://github.com/papers-we-love/papers-we-love/tree/master/operating_systems\">find the papers</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>February's meetup is sponsored by</i> </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/7/9/8/600_433118808.jpeg\" /></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/8/b/3/3/600_446735635.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/0/a/1/600_446780641.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/0/a/4/600_446780644.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/0/a/7/600_446780647.jpeg","width":null}],"time":1455235200000,"title":"Bryan Cantrill on Jails & Solaris Zones","url":"https://www.meetup.com/papers-we-love/events/228110831/","utcOffset":-18000000,"venue":{"address1":"35 East 21st St, FL 1 (Ground Floor), 10010","address2":null,"city":"New York","country":"us","lat":40.73964309692383,"lon":-73.98893737792969,"name":"Tumblr, Inc","postalCode":""}},"230555338":{"description":"<p>We're very happy to have <a href=\"http://www.kitchensoap.com/\">John Allspaw</a>, CTO of <a href=\"https://www.etsy.com/\">Etsy</a> and author, presenting on <a href=\"http://jeffreymbradshaw.net/publications/Common_Ground_Single.pdf\">Common Ground and Coordination in Joint Activity</a> by Klein, Feltovich, and Woods.</p> <p><b>Intro </b></p> <p>The paper I'm going to discuss is the result of what happens when people with backgrounds in mathematics, psychology, and artificial intelligence (Feltovich and Bradshaw) get together to ask questions about how teams operate alongside the originators of modern decision-making and cognitive systems engineering research (Klein and Woods). </p> <p>The concepts outlined in the paper have provided frames and directions in designing tools and environments where successful work requires multiple actors (whether they are people or software agents!) to succeed. This seminal paper takes a deep dive into not just people and teamwork, but what comprises the sometimes invisible activity of coordination, collaboration, cooperation, and the contracts and expectations entities have with each other along the way. </p> <p>The paper has had far-reaching influence in multiple domains: military intelligence, space transportation and aviation, and more recently: software engineering and operations on the web. Let me walk you through where this paper came from, what makes this paper critical to the future of software, and a hint about what I'm sure it means about the future. </p> <p><b>Bio<br/></b></p> <p>John Allspaw (<a href=\"https://twitter.com/allspaw\">@allspaw</a>) is Etsy’s Chief Technology Officer (CTO), leading the Product Engineering, Infrastructure and Operations teams. Previously, he was SVP of Infrastructure and Operations at Etsy. For over 17 years, he has worked in system operations in the biotech, government and online media industries.</p> <p>He began his career running vehicle crash simulations for the U.S. government. In 1997, he made the leap to the web, building the technical infrastructures at Salon, InfoWorld, Friendster and Flickr.</p> <p>John is the author of <a href=\"http://shop.oreilly.com/product/9780596518585.do\">The Art of Capacity Planning</a> and <a href=\"http://shop.oreilly.com/product/0636920000136.do\">Web Operations: Keeping the Data On Time</a>, both published by O’Reilly Media. He holds a BS from the University of Massachusetts, Amherst, and an MSC from Lund University.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After John presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also <a href=\"http://jeffreymbradshaw.net/publications/Common_Ground_Single.pdf\">find the paper</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/1/1/7/1/600_451024465.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/1/1/7/b/600_451024475.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/1/1/8/1/600_451024481.jpeg","width":null}],"time":1464217200000,"title":"John Allspaw on Common Ground and Coordination in Joint Activity","url":"https://www.meetup.com/papers-we-love/events/230555338/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"231394908":{"description":"<p>This is going to be a special one! We're working with the <a href=\"https://qconnewyork.com/\">QCon New York</a> team to put together a series of<a href=\"https://qconnewyork.com/ny2016/presentation/papers-we-love-user-group\"> 4 PWL \"mini\" (15~20-minute) presentations</a> by 4 wonderful speakers, all of whom are also speaking at QCon! So, we're extremely happy to welcome Evelina Gabasova (<a href=\"https://twitter.com/evelgab\">@evelgab</a>), Eric Brewer (<a href=\"https://twitter.com/eric_brewer\">@eric_brewer</a>), Ines Sombra (<a href=\"https://twitter.com/randommood\">@randommood</a>), and Caitie McCaffrey (<a href=\"https://twitter.com/caitie\">@caitie</a>) to PWLNYC!</p> <p>Also, QCon New York is offering <b><a href=\"https://qconnewyork.com/registration\">$100 off their conference ticket</a></b> for our group. Just use the code \"<b>paperswelove</b>\" when registering!</p> <p><b>Abstracts</b></p> <p>- Evelina Gabasova presenting on <a href=\"http://airesearch.com/wp-content/uploads/2016/01/deepmind-mastering-go.pdf\">Mastering the Game of Go with Deep Neural Networks and Tree Search</a>:</p> <p><i>The game of Go has long been viewed as the most challenging of classic games for artificial intelligence due to its enormous search space and the difficulty of evaluating board positions and moves. We introduce a new approach to computer Go that uses value networks to evaluate board positions and policy networks to select moves. These deep neural networks are trained by a novel combination of supervised learning from human expert games, and reinforcement learning from games of self-play. Without any lookahead search, the neural networks play Go at the level of state-of-the-art Monte-Carlo tree search programs that simulate thousands of random games of self-play. We also introduce a new search algorithm that combines Monte-Carlo simulation with value and policy networks. Using this search algorithm,our program AlphaGo achieved a 99.8% winning rate against other Go programs,and defeated the European Go champion by 5 games to 0. This is the first time that a computer program has defeated a human professional player in the full-sized game of Go, a feat previously thought to be at least a decade away.</i></p> <p>- Eric Brewer presenting on <b><a href=\"https://people.eecs.berkeley.edu/~brewer/cs262/Mesa.pdf\">Experience with Processes and Monitors in Mesa</a></b>:</p> <p><i>The use of monitors for describing concurrency has been much discussed in the literature. When monitors are used in real systems of any size, however, a number of problems arise which have not been adequately dealt with: the semantics of nested monitor calls; the various ways of defining the meaning of WAIT; priority scheduling; handling of timeouts, aborts and other exceptional conditions; interactions with process creation and destruction; monitoring large numbers of small objects. These problems are addressed by the facilities described here for concurrent programming in Mesa. Experience with several substantial applications gives us some confidence in the validity of our solutions.</i></p> <p>-  Ines Sombra presenting on <a href=\"http://research.microsoft.com/pubs/255833/IronFleet-twocol.pdf\"><b>IronFleet: Proving Practical Distributed Systems Correct</b></a>:</p> <p><i>Distributed systems are notorious for harboring subtle bugs.Verification can, in principle, eliminate these bugs a priori,but verification has historically been difficult to apply at full program scale, much less distributed-system scale.We describe a methodology for building practical and provably correct distributed systems based on a unique blend of TLA-style state-machine refinement and Hoare-logic verification.We demonstrate the methodology on a complex implementation of a Paxos-based replicated state machine library and a lease-based sharded key-value store. We prove that each obeys a concise safety specification, as well as desirable liveness requirements. Each implementation achieves performance competitive with a reference system. With our methodology and lessons learned, we aim to raise the standard for distributed systems from “tested” to “correct.” </i></p> <p>-  Caitie McCaffrey presenting on <b><a href=\"https://www.usenix.org/system/files/conference/osdi14/osdi14-paper-yuan.pdf\">Simple Testing Can Prevent Most Critical Failures...</a></b>:</p> <p><i>Large, production quality distributed systems still fail periodically,and do so sometimes catastrophically, where most or all users experience an outage or data loss. We present the result of a comprehensive study investigating198 randomly selected, user-reported failures that occurred on Cassandra, HBase, Hadoop Distributed FileSystem (HDFS), Hadoop MapReduce, and Redis, with the goal of understanding how one or multiple faults eventually evolve into a user-visible failure. We found that from a testing point of view, almost all failures require only 3 or fewer nodes to reproduce, which is good news considering that these services typically run on avery large number of nodes. However, multiple inputs are needed to trigger the failures with the order between them being important. Finally, we found the error logs of these systems typically contain sufficient data on both the errors and the input events that triggered the failure,enabling the diagnose and the reproduction of the production failures. </i></p> <p><i>We found the majority of catastrophic failures could easily have been prevented by performing simple testing on error handling code – the last line of defense – even without an understanding of the software design. We extracted three simple rules from the bugs that have lead to some of the catastrophic failures, and developed a static checker, Aspirator, capable of locating these bugs. Over30% of the catastrophic failures would have been prevented had Aspirator been used and the identified bugs fixed. Running Aspirator on the code of 9 distributed systems located 143 bugs and bad practices that have been fixed or confirmed by the developers.</i></p> <p><b>Bios</b></p> <p>- Evelina (Gabasova) is a machine learning researcher working in bioinformatics, trying to reverse-engineer cancer at University of Cambridge. Outside of academia, she also speaks at developer conferences and user groups about functional programming, machine learning and data science. She writes a blog at <a href=\"http://www.evelinag.com\"><a href=\"http://www.evelinag.com\" class=\"linkified\">http://www.evelinag.com</a></a>.</p> <p>- Dr. (Eric) Brewer joined Google in May 2011 and leads the company’s compute infrastructure design. He focuses on all aspects of Internet­ based systems including cloud computing, scalability, containers, and storage. As a researcher, Dr. Brewer has led projects on scalable servers, network infrastructure, IoT, and the CAP Theorem. He has also led work on technology for developing regions, with projects in India, Indonesia, and Kenya among others, and including communications, power, and health care. In 1996, he co­founded Inktomi Corporation with a Berkeley grad student and helped lead it onto the NASDAQ 100. In 2000, working with President Clinton, Dr. Brewer helped to create USA.gov, the official portal of the Federal government.</p> <p>- Ines Sombra is a Distributed Systems Engineer at Fastly, where she spends her time helping the Web go faster. Ines holds an M.S. in Computology with an emphasis on Cheesy 80’s Rock Ballads. She has a fondness for steak, fernet, and a pug named Gordo. In a previous life she was a Data Engineer. Follow Ines <a href=\"https://twitter.com/randommood\">@randommood</a>.</p> <p>- Caitie McCaffrey is a Backend Brat and Distributed Systems Diva at Twitter.  Prior to that she built  services and systems that power the entertainment industry at 343 Industries, Microsoft Game Studios, and HBO.  While at 343 Industries she partnered with the eXtreme Computing Group in Microsoft Research to productionize Orleans as part of her work rewriting the Halo Services.  Caitie has a degree in Computer Science from Cornell University She maintains a blog at <a href=\"https://caitiem.com/\">CaitieM.com</a> and frequently discusses technology and entertainment on Twitter <a href=\"https://twitter.com/caitie\">@Caitie</a>.</p> <p>-------------------------------------------------------------------------------------</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/4/4/b/8/600_450377592.jpeg\" /></p> <p><a href=\"https://qconnewyork.com/\">QCon NewYork</a> - Host and Venue Sponsor for this Event</p> <p>-------------------------------------------------------------------------------------</p> <p>-------------------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>-------------------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will <b>begin at 7:15 pm</b>. Due to venue restrictions, we'll be offering only coffee, water, tea, and <b>popcorn </b>at the event! </p> <p><b>You'll have to check-in with your Name/ID. Definitely sign-up if you’re going to attend!</b></p> <p>We hope that you'll read the papers before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also find the papers for this event, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/9/d/2/3/600_451180227.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/9/d/2/4/600_451180228.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/9/d/2/6/600_451180230.jpeg","width":null}],"time":1465945200000,"title":"Papers We Love - QCon NYC Edition w/ Evelina, Eric, Ines, & Caitie","url":"https://www.meetup.com/papers-we-love/events/231394908/","utcOffset":-14400000,"venue":{"address1":"New York Marriott at the Brooklyn Bridge, 333 Adams St, Brooklyn, NY 11201","address2":null,"city":"New York","country":"us","lat":40.69867706298828,"lon":-73.9859390258789,"name":"New York Marriott at the Brooklyn Bridge, 333 Adams St, Brooklyn, NY 11201","postalCode":"11201"}},"231862215":{"description":"<p>PWLNYC is extremely excited to be hosting <a href=\"http://www.cs.cornell.edu/~deniz/\">Deniz Altınbüken</a>, a Ph.D. candidate in Distributed Systems at Cornell University. We were first introduced to her work upon seeing her amazing <a href=\"https://www.youtube.com/watch?v=vW8pN07cH8M\">Ricon 2015 talk</a> and reading through <a href=\"http://paxos.systems/\">Paxos: Made Moderately Complex</a>. She's travelling from Cornell to join us in talking about the topic of <i><a href=\"http://www.cs.cornell.edu/home/rvr/papers/osdi04.pdf\">Chain Replication (CR)</a></i> and their <b>new and improved protocol</b> for it, which has a formally defined end-to-end specification. </p> <p>For those unfamiliar with CR, <a href=\"https://christophermeiklejohn.com/\">Christopher Meiklejohn</a> gave a <a href=\"http://paperswelove.org/2015/video/nathan-taylor-chris-meiklejohn-os-scalability-chain-replication/\">fantastic survey talk</a> at <a href=\"http://paperswelove.org/chapter/sanfrancisco/\">Papers We Love San Francisco</a> a little <a href=\"http://www.meetup.com/papers-we-love-too/events/224178870/\">while back</a>. <a href=\"http://paperswelove.org/2015/topic/christopher-meiklejohns-a-brief-history-of-chain-replication/\">Here's an overview</a> of some of those papers on CR. We can't wait to see Deniz and her collaborators' new work in the field!</p> <p>Influenced a bit by some of our <a href=\"http://www.meetup.com/papers-we-love-too/\">other chapters</a>, we're adding a special 15-minute PWL-mini presentation by Wes Chow, CTO of <a href=\"https://chartbeat.com/\">Charbeat</a>, on <a href=\"https://www.usenix.org/system/files/conference/atc15/atc15-paper-cidon.pdf\">Tiered Replication: A Cost-effective Alternative to Full Cluster Geo-replication</a>! </p> <p><b>Schedule</b></p> <p><i>7:30 ~ 7:45-&gt; </i>PWL Mini w/ Wes Chow on <a href=\"https://www.usenix.org/system/files/conference/atc15/atc15-paper-cidon.pdf\">Tiered Replication: A Cost-effective Alternative to Full Cluster Geo-replication</a></p> <p><i>7:50 ~ -&gt;</i>Deniz Altınbüken on Chain Replication (old and new)</p> <p><b>Talks</b></p> <p>• <i><b>Chain Replication</b></i></p> <p><i>Chain Replication (CR)</i> is a variant of Primary-Backup Replication that supports high throughput and fast recovery from failures.  CR has been widely used in both commercial systems and academic research prototypes. In so doing, various shortcomings of the original CR protocol have come to light. In this talk, I will summarize these findings and present a new version of CR that addresses the shortcomings.  Our improved CR protocol supports different consistency guarantees, avoids the tail bottleneck for reads, and introduces autonomous reconfiguration of the system without requiring an external master. Additionally, we have developed a formal end-to-end specification of the protocol, including the actions of clients, detailing reconfiguration and linearizable execution of client requests. Through this specification, we are able to reason about the new protocol more precisely and implement the protocol effortlessly.  Lastly, I will contrast our approach to the related work.  </p> <p>• <b>Tiered Replication</b></p> <p>Tiered Replication, by Cidon et. al, explores the problem of effective data replication strategies first introduced in the <a href=\"https://www.usenix.org/system/files/conference/atc15/atc15-paper-cidon.pdf\">Copysets paper</a>, awarded <a href=\"https://www.usenix.org/conference/atc15/technical-session/presentation/cidon\">2013 Usenix ATC Best Student Paper</a>. While Copysets introduced a randomized algorithm for solving NP Hard redundancy and load balancing constraints around placement of data in distributed filesystem, Tiered Replication proposes a greedy algorithm for solving the same problem and also adding the ability to bake in real world constraints such as rack awareness. Wes will summarize the problem Copysets proposed, show <a href=\"https://github.com/chartbeat-labs/trepl\">Tiered Replication’s solution</a>, and examine a real world deployment of the algorithm at Chartbeat.</p> <p><b>Bios</b></p> <p><i><a href=\"http://www.cs.cornell.edu/~deniz/\">Deniz Altınbüken</a></i>  is a Ph.D. candidate in Distributed Systems at Cornell University, working with <a href=\"https://www.cs.cornell.edu/home/rvr/\">Robbert van Renesse</a>. Her interests are in distributed systems and the theory of distributed computing with a focus on building infrastructure services for large-scale distributed systems. She loves breaking distributed systems down to their basic components, understanding the bits and pieces of what makes them work and explaining these in precise ways with the objective of making complicated systems easier to understand and implement.</p> <p><i>Wes Chow</i> has a B.S. in Electrical Engineering &amp; Computer Science from UC Berkeley. He spent eight years building technical infrastructure for high frequency trading shops. One day, he stared into his dark soul and realized he needed to move into the startup light. Thus S7 Labs sprang into being, and he led teams that built Storybox, a Seedcamp NY finalist, and Songza Radio, subsumed by Google Music. He's now at Chartbeat serving out his term as CTO.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After Deniz presents her work, we will open up the floor to discussion and questions. </p> <p>We hope that you'll read the paper(s) before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also <a href=\"https://github.com/papers-we-love/papers-we-love/blob/baed7e16c0456b6395796fe0af70f4668391e9b9/distributed_systems/README.md\">find the papers</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/7/b/600_452760891.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/7/c/600_452760892.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/7/e/600_452760894.jpeg","width":null}],"time":1469660400000,"title":"Deniz Altınbüken on Chain Replication (old and new) & a PWL-Mini with Wes Chow","url":"https://www.meetup.com/papers-we-love/events/231862215/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"233240967":{"description":"<p>It's been a long time coming, but we have the fantastic <a href=\"http://swannodette.github.io/\">David Nolen</a>, lead developer of <a href=\"https://github.com/clojure/clojurescript\">Clojurescript</a> (among other things) presenting at PWLNYC. He'll be presenting <a href=\"http://matt.might.net/papers/might2011derivatives.pdf\">Parsing with Derivatives</a> by <a href=\"http://matt.might.net/\">Matthew Might</a>, <a href=\"http://david.darais.com/\">David Darais</a>, &amp; <a href=\"https://twitter.com/djspiewak\">Daniel Spiewak</a>. It's a heralded paper that has a super interesting <a href=\"https://arxiv.org/pdf/1604.04695.pdf\">follow-up</a> (<i>On the Complexity and Performance of Parsing with Derivatives</i>), <a href=\"http://swannodette.github.io/2016/06/03/tools-for-thought\">has influenced </a><a href=\"http://clojure.org/about/spec\">clojure.spec</a>, and <a href=\"https://www.youtube.com/watch?v=ZzsK8Am6dKU\">this helpful video</a>!</p> <p><b>Abstract</b></p> <p>We present a functional approach to parsing unrestricted context-free grammars based on <a href=\"https://en.wikipedia.org/wiki/Brzozowski_derivative\">Brzozowski's derivative of regular expressions</a>. If we consider context-free grammars as recursive regular expressions, Brzozowski's equational theory extends without modification to context-free grammars (and it generalizes to parser combinators). The supporting actors in this story are three concepts familiar to functional programmers - laziness, memoization and fixed points; these allow Brzozowski's original equations to be transliterated into purely functional code in about 30 lines spread over three functions.</p> <p>Yet, this almost impossibly brief implementation has a drawback: its performance is sour - in both theory <i>and </i>practice. The culprit? Each derivative can <i>double</i> the size of a grammar, and with it, the cost of the next derivative.</p> <p>Fortunately, much of the new structure inflicted by the derivative is either dead on arrival, or it dies after the very next derivative. To eliminate it, we once again exploit laziness and memoization to transliterate an equational theory that prunes such debris into working code. Thanks to this compaction, parsing times become reasonable in practice.</p> <p>We equip the functional programmer with two equational theories that, when combined, make for an abbreviated understanding and implementation of a system for parsing context-free languages.</p> <p><b>Bio</b></p> <p><i><a href=\"http://swannodette.github.io/\">David Nolen</a> </i>(<a href=\"https://twitter.com/swannodette/\">@swannodette</a>) is a Software Engineer for <a href=\"http://cognitect.com/\">Cognitect</a> and the lead developer of <a href=\"https://github.com/clojure/clojurescript\">ClojureScript</a>. He likes making music, <a href=\"http://swannodette.github.io/baduk/baduk/2016/01/08/hello-baduk.html\">playing Go</a>, and reading interesting papers.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm, and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After David presents his work, we will open up the floor to discussion and questions. </p> <p>We hope that you'll read the paper(s) before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also find the papers, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>August's meetup is also sponsored by</i> </p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/8/b/5/9/600_452975673.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/1/2/3/600_453624867.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/1/3/5/600_453624885.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/1/4/7/600_453624903.jpeg","width":null}],"time":1472079600000,"title":"David Nolen on Parsing With Derivatives","url":"https://www.meetup.com/papers-we-love/events/233240967/","utcOffset":-14400000,"venue":{"address1":"249 W 17th St, New York, NY, FL 6","address2":null,"city":"New York","country":"us","lat":40.74152755737305,"lon":-73.99988555908203,"name":"Twitter NYC","postalCode":""}},"233588742":{"description":"<p>It's with great pleasure to announce that we'll be hosting Elizabeth Ramirez, a senior software engineer at <a href=\"http://www.nytimes.com/\">The New York Times</a> and M.S. candidate in <a href=\"http://apam.columbia.edu/\">Applied Mathematics at Columbia University</a>. She'll be presenting on a classic: <a href=\"https://www.cs.unc.edu/~welch/kalman/media/pdf/Kalman1960.pdf\">A New Approach to Linear Filtering and Prediction Problems</a> by Rudolf Kálmán. Kálmán, who <a href=\"http://hungarytoday.hu/news/renowned-hungarian-scientis-rudolf-kalman-dies-aged-86-46732\">passed away in July</a>, was <a href=\"http://ethw.org/Rudolf_E._Kalman\">a luminary</a> who shaped the field of <a href=\"https://en.wikipedia.org/wiki/Control_theory#Modern_control_theory\">modern control theory</a>. </p> <p>There are many <i>Kalman Filter</i> tutorials to be found on the web, such as <a href=\"http://www.bzarg.com/p/how-a-kalman-filter-works-in-pictures/\"><a href=\"http://www.bzarg.com/p/how-a-kalman-filter-works-in-pictures/\" class=\"linkified\">http://www.bzarg.com/p/how-a-kalman-filter-works-in-pictures/</a></a>. <a href=\"https://youtu.be/k_MpfzMc9PU\">Elizabeth gave a great talk at PyCon</a> this year on implementing a discrete <i>Kalman Filter</i> in Python:</p> <p><a href=\"https://www.youtube.com/watch?v=k_MpfzMc9PU\" class=\"embedded\">https://www.youtube.com/watch?v=k_MpfzMc9PU</a></p> <p><b>Intro </b></p> <p>The <i><a href=\"https://en.wikipedia.org/wiki/Kalman_filter\">Kalman Filter</a> </i>is a prediction-correction algorithm named after <a href=\"https://en.wikipedia.org/wiki/Rudolf_E._K%C3%A1lm%C3%A1n\">Rudolf E. Kálmán</a> [masked]), by which we calculate recursively a dynamical system state at time <i>t_{k}</i> using state at previous time <i>u_{k-1}</i> and new information <i>b_{k}</i> only. This technique is presented as a generalization of the least squares model for problems with varying mean and additive noise.</p> <p>The <i>Kalman Filter</i> was first applied in the 1960s to the problem of trajectory estimation for NASA's Apollo space program and incorporated into their space navigation computer. It is also used in the guidance and navigation systems of the NASA Space Shuttle and the attitude control and navigation systems of the International Space Station. In other words, it is mostly used for positioning and navigation systems, but it can be generalized to any time series under suitable conditions.</p> <p>Rudolf Kálmán recently passed away, and I thought it was a good idea to honor his memory at Papers We Love by presenting his original paper published in 1960, \"<a href=\"https://www.cs.unc.edu/~welch/kalman/media/pdf/Kalman1960.pdf\">A New Approach to Linear Filtering and Prediction Problems</a>\", aka <i>Kalman Filter</i>.</p> <p><b>Bio<br/></b></p> <p>Elizabeth Ramirez (<a href=\"https://twitter.com/eramirem\">@eramirem</a>) is a Senior Software Engineer at <a href=\"http://www.nytimes.com/\">The New York Times</a> and M.S. candidate in <a href=\"http://apam.columbia.edu/\">Applied Mathematics at Columbia University</a>. She likes analytical and numerical methods for solving partial differential equations, and all things space.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After Elizabeth presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/data_fusion/a-new-approach-to-linear-filtering-and-prediction-problems.pdf\">find the paper</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>September's meetup is sponsored by</i> </p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/5/4/7/3/600_453441619.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/7/4/e/a/600_455249930.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/7/4/e/b/600_455249931.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/7/4/e/c/600_455249932.jpeg","width":null}],"time":1475190000000,"title":"Elizabeth Ramirez on A New Approach to Linear Filtering and Prediction Problems","url":"https://www.meetup.com/papers-we-love/events/233588742/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"235441575":{"description":"<p>We're back with <a href=\"https://wyegelwel.github.io/\">Wil Yegelwel</a>, an engineer on Two Sigma's Compute team, presenting on 3 related, foundational graphics papers on the topic(s) of <i>illumination </i>and<i> rendering</i>: <a href=\"http://page.mi.fu-berlin.de/block/htw-lehre/wise2015_2016/bel_und_rend/skripte/gouraud1971.pdf\">Continuous shading of curved surfaces</a>, <a href=\"http://www.cs.northwestern.edu/~ago820/cs395/Papers/Phong_1975.pdf\">Illumination for computer generated pictures</a>, and <a href=\"http://www.cs.rpi.edu/~cutler/classes/advancedgraphics/S08/lectures/kajiya.pdf\">The Rendering Equation</a>. </p> <p><b>Intro </b></p> <p><i>Illumination</i> in computer graphics deals with calculating the color of each pixel on the screen when trying to render a photorealistic scene. The problem is that generating increasingly realistic renderings requires a lot of processing and so a tradeoff must be made between compute time and image quality. We will first look at two foundational papers from the 70s that built “good enough” models that were fast to render. Finally, we look at <a href=\"http://www.cs.rpi.edu/~cutler/classes/advancedgraphics/S08/lectures/kajiya.pdf\">The Rendering Equation</a> that provides a single model to encompass many effects of lighting assuming you are willing to pay the processing cost.</p> <p><b>Bio<br/></b></p> <p><a href=\"https://wyegelwel.github.io\">Wil Yegelwel</a> (<a href=\"https://twitter.com/WYegelwel\">@WYegelwel</a>) is an engineer at <a href=\"https://www.twosigma.com/\">Two Sigma</a> working on the Compute team. At work he engineers <a href=\"https://github.com/twosigma/Cook\">Cook</a>, a fair share scheduler, which tries to ensure that users all get fair access to compute resources. He recently got a kitten and would be thrilled if more people wanted to discuss adorable cats. During college he fell in love with computer graphics but more so the necessity to learn broadly to do computer graphics (and life?) well.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After Wil presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also <a href=\"https://github.com/papers-we-love/papers-we-love/blob/088119df3b8ec0c563437b460563c730f7ee8ade/computer_graphics/README.md\">find the papers</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><i>November's meetup is sponsored by</i> </p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/5/4/7/3/600_453441619.jpeg\" /></p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/d/7/4/5/600_456475109.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/d/7/4/6/600_456475110.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/d/7/4/7/600_456475111.jpeg","width":null}],"time":1480464000000,"title":"Wil Yegelwel on \"The Rendering Equation\"","url":"https://www.meetup.com/papers-we-love/events/235441575/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"237581430":{"description":"<p>We're back in 2017 with Erich Ess, lead engineer on Jet.com's Core Platform team, presenting on foundational work to visualize fluid motion: <a href=\"http://cs.brown.edu/courses/csci2370/2000/1999/cabral.pdf\">Imaging Vector Fields Using Line Integral Convolution</a> by Brian Cabral and Leith Leedom. </p> <p><b>Intro </b></p> <p><a href=\"https://en.wikipedia.org/wiki/Line_integral_convolution\">Line Integral Convolution</a> is one of the most intuitive data visualization techniques around.  It's dropping paint in a river to see how the current is flowing:  to visualize a vector field simply take an image and have the vector field smear the colors.  The result is a powerful alternative to using arrows or stream lines.  And while the intuition is very straightforward, the actual mathematics that power the technique are very complex.</p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/9/4/4/2/600_458197954.jpeg\" /></p> <p><b>Bio<br/></b></p> <p>Erich Ess (<a href=\"https://twitter.com/egerhardess\">@egerhardess</a>) is a lead engineer on the Core Platform team at <a href=\"https://jet.com\">Jet.com</a>. His current work focuses on semantics for programmatic represention of distributed processes and advanced monitoring and insight platform for high distributed high volume systems.  Before that he was a CTO in Chicago and an engineer in San Diego.  He studied Computer Science and Pure Mathematics in college and did research in scientific visualization before escaping academia.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After Erich presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, where you can also <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/computer_graphics/imaging_vector_fields_using_line_integral_convolution.pdf\">find the paper</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/7/1/b/600_459494107.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/7/1/c/600_459494108.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/3/7/1/d/600_459494109.jpeg","width":null}],"time":1488326400000,"title":"Erich Ess on Imaging Vector Fields Using Line Integral Convolution","url":"https://www.meetup.com/papers-we-love/events/237581430/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"238056356":{"description":"<p>We're terrifically excited to host Kiran Bhattaram (<a href=\"https://kiranbot.com\" class=\"linkified\">https://kiranbot.com</a>), software engineer at Stripe (<a href=\"https://stripe.com\" class=\"linkified\">https://stripe.com</a>) and writer of amazing posts and paper reports (<a href=\"https://kiranbot.com/tags/computers\" class=\"linkified\">https://kiranbot.com/tags/computers</a>) about computing and sewing (<a href=\"https://kiranbot.com/tags/sewing/\" class=\"linkified\">https://kiranbot.com/tags/sewing/</a>)! She'll be presenting on a survey of work related to failure detectors for distributed systems.</p> <p>Intro</p> <p>The problem of consensus is central to many distributed systems algorithms. Failure detectors are central to the way we think about consensus algorithms. In a fully asynchronous system, the FLP impossibility result (<a href=\"https://groups.csail.mit.edu/tds/papers/Lynch/jacm85.pdf\" class=\"linkified\">https://groups.csail.mit.edu/tds/papers/Lynch/jacm85.pdf</a>) shows that no consensus solution that can tolerate crash failures exists! This simple, stunning result imposed a hard constraint on what could be solved in an asynchronous model.</p> <p>The FLP (<a href=\"http://the-paper-trail.org/blog/a-brief-tour-of-flp-impossibility/\" class=\"linkified\">http://the-paper-trail.org/blog/a-brief-tour-of-flp-impossibility/</a>) result kicked off a flurry of research into ways to circumvent the impossibility result. Failure detectors were the most compelling abstraction proposed. These augmented the asynchronous model just enough to allow consensus, while retaining most of the neat abstractions that make asynchronous systems simple to reason about.</p> <p>In this talk, I'll discuss some of the history and background of Chandra and Toueg's failure detector proposal (<a href=\"http://courses.csail.mit.edu/6.852/08/papers/CT96-JACM.pdf\" class=\"linkified\">http://courses.csail.mit.edu/6.852/08/papers/CT96-JACM.pdf</a>), and discuss some failure detector mechanisms that followed the paper.</p> <p>Bio</p> <p>Kiran (<a href=\"https://kiranbot.com\" class=\"linkified\">https://kiranbot.com</a>) (@kiranb (<a href=\"https://twitter.com/kiranb\" class=\"linkified\">https://twitter.com/kiranb</a>)) is a software engineer at Stripe (<a href=\"https://stripe.com\" class=\"linkified\">https://stripe.com</a>). At work, she's thinks a lot about distributed systems fallacies (<a href=\"https://kiranbot.com/fallacies\" class=\"linkified\">https://kiranbot.com/fallacies</a>) and how we can observe what our software is doing. A normal day working with Kiran involves conversations about operating distributed systems and learning that she made that awesome space dress she's wearing.</p> <p>------------------------------------------------------------------------</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------</p> <p>Details</p> <p>Doors open at 7 pm; the presentation will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Kiran presents the paper, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), where you can also find some of the related papers (<a href=\"https://github.com/papers-we-love/papers-we-love/tree/master/distributed_systems\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/tree/master/distributed_systems</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/f/6/d/600_459744429.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/f/6/e/600_459744430.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/f/6/f/600_459744431.jpeg","width":null}],"time":1490655600000,"title":"Kiran Bhattaram on Failure Detectors","url":"https://www.meetup.com/papers-we-love/events/238056356/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"238718664":{"description":"<p>We're delighted to host <a href=\"http://webyrd.net/\">William E. Byrd</a>, Research Assistant Professor at the <a href=\"http://www.cs.utah.edu/\">University of Utah's School of Computing</a>. William is co-author of <a href=\"https://mitpress.mit.edu/books/reasoned-schemer\">The Reasoned Schemer</a> with Daniel P. Friedman and Oleg Kiselyov, co-designer of <a href=\"http://minikanren.org/\">miniKanren</a> and <a href=\"https://github.com/webyrd/Barliman\">Barliman</a>, a prototype interactive editor for exploring program synthesis. He'll be discussing what he considers to be the most beautiful program every written and much of the research and work behind it. </p> <p>In addition to William's talk, <a href=\"http://paperswelove.org/2015/video/andrew-turley-on-the-train-algorithm/\">PWLNYC alumnus</a> <a href=\"https://twitter.com/casio_juarez\">Andrew Turley</a>, will be opening the event with a short lightning talk on <i><a href=\"https://www.cs.umd.edu/~ben/papers/Schneiderman1985Relationship.pdf\">The Relationship Between COBOL and Computer Science</a> </i>by Ben Schneiderman. </p> <p><b>Talks</b></p> <p>•<i> <a href=\"http://webyrd.net\">William E. Byrd</a></i> will \"explore what I consider to be the most beautiful program ever written---<i><b>a Lisp interpreter written in Lisp</b></i>---and a few of the many amazing ideas related to this metacircular interpreter.\"</p> <p><i>References</i></p> <p><i>- </i><a href=\"https://mitpress.mit.edu/books/little-schemer\">The Little Schemer</a> by Daniel P. Friedman and Matthias Felleisen<br/>- <a href=\"http://www.eopl3.com\">Essentials of Programming Languages </a>by Daniel P. Friedman and Mitchell Wand<br/>- John McCarthy's <a href=\"http://www-formal.stanford.edu/jmc/recursive.pdf\">Recursive functions of symbolic expressions and their computation by machine, Part I</a> <br/>- <a href=\"http://www.softwarepreservation.org/projects/LISP/book/LISP%201.5%20Programmers%20Manual.pdf/view\">LISP 1.5 Programmer's Manual</a> by John McCarthy, Paul W. Abrahams, Daniel J. Edwards, Timothy P. Hart and Michael I. Levin <b>(see especially page 13!)</b><br/> - John McCarthy's <a href=\"https://github.com/jaseemabid/micromanual\">A micro-manual for LISP - not the whole truth</a><br/>- \"<a href=\"http://www.righto.com/2008/07/maxwells-equations-of-software-examined.html\">Maxwell's equations of software</a>\" examined by Ken Shirriff<br/>- <a href=\"http://www.michaelnielsen.org/ddi/lisp-as-the-maxwells-equations-of-software/\">Lisp as the Maxwell’s equations of software</a> by Michael Nielsen<br/>- <a href=\"http://webyrd.net/quines/quines.pdf\">miniKanren, live and untagged: quine generation via relational interpreters (programming pearl)</a> by William E. Byrd, Eric Holk, and Daniel P. Friedman<br/>- <a href=\"http://pllab.is.ocha.ac.jp/~asai/papers/thesis.ps.gz\">The Reflective Language Black</a> by Asai, Kenichi<br/>- <a href=\"https://www.youtube.com/watch?v=SrKj4hYic5A\">Programming Should Eat Itself </a>by Nada Amin, Strange Loop, 2014</p> <p>• <i>Andrew Turley's lightning talk</i>:</p> <p>In 1960, two different computers compiled and ran the same COBOL program. Twenty-five years later COBOL was considered a grand success in industry and was barely mentioned, except critically, in academia. Shneiderman looks at COBOL's relationship to industry and academia, discusses COBOL's strengths and weaknesses, and describes the contributions that it made to the fields of computer science and computer engineering.</p> <p>This paper draws heavily from Jean Sammet's \"<a href=\"https://www.deepdyve.com/lp/association-for-computing-machinery/the-early-history-of-cobol-S4iP58UtHc?articleList=%2Fsearch%3Fquery%3DThe%2Bearly%2Bhistory%2Bof%2BCOBOL\">An Early History of COBOL</a>\" (<a href=\"http://dl.acm.org/citation.cfm?id=1198367\"><a href=\"http://dl.acm.org/citation.cfm?id=1198367\" class=\"linkified\">http://dl.acm.org/citation.cfm?id=1198367</a></a>). Reading Sammet's paper is not required to understand what Shneiderman is talking about, but it does provide a great deal of additional background information.</p> <p><b>Bios<br/></b></p> <p><b><i>William E. Byrd</i></b> (<a href=\"https://twitter.com/webyrd\">@webyrd</a>) is a Research Assistant Professor in the School of Computing at the University of Utah. He is co-author of 'The Reasoned Schemer', and is co-designer of the miniKanren relational programming language. He loves StarCraft (BW &amp; SC2). Ask him about the scanning tunneling microscope (STM) he is building.</p> <p><b>Andrew Turley </b>(<a href=\"https://twitter.com/casio_juarez\">@casio_juarez</a>) is a software engineer with an interest in programming languages, especially the ones that people hate. He currently works for <a href=\"http://engineering.sendence.com\">Sendence Engineering</a> where he uses Pony, a language that nobody hates yet.</p> <p>------------------------------------------------------------------------------------------</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------------------------</p> <p>------------------------------------------------------------------------------------------</p> <p><img src=\"https://secure.meetupstatic.com/photos/event/5/e/9/b/600_459924219.jpeg\" /></p> <p><i><a href=\"https://chartbeat.com\">ChartBeat</a> - Video Sponsor for this event</i></p> <p>------------------------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentations will begin at around 7:20 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After William's presentation, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>--------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/d/4/8/6/600_468894406.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/d/4/9/2/600_468894418.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/d/4/a/8/600_468894440.jpeg","width":null}],"time":1492038000000,"title":"William Byrd on \"The most beautiful program ever written\" & PWLMini w/ A. Turley","url":"https://www.meetup.com/papers-we-love/events/238718664/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"239562163":{"description":"<p>We're thrilled to be hosting <a href=\"http://code.dblock.org/\">Daniel Doubrovkine</a>, CTO of <a href=\"https://www.artsy.net\">Artsy</a>, who'll be presenting on Simon Parson's <i><b><a href=\"http://www.sci.brooklyn.cuny.edu/~parsons/projects/mech-design/publications/bluffers-final.pdf\">Auctions and bidding: A guide for computer scientists</a></b></i>. </p> <p>In addition to Daniel's talk, Sophia Gold will be opening the event with a survey-oriented lightning talk on <i><b>An Intellectual History of Automatic Differentiation</b></i>. </p> <p><b>Talks</b></p> <p>•<i> Daniel Doubrovkine</i> on <a href=\"http://www.sci.brooklyn.cuny.edu/~parsons/projects/mech-design/publications/bluffers-final.pdf\">Auctions and bidding: A guide for computer scientists</a>:</p> <p>There is a veritable menagerie of auctions — single dimensional, multi-dimensional, single sided, double sided, first price, second price, English, Dutch, Japanese, sealed bid — and these have been extensively discussed and analyzed in the economics literature. We will survey this literature from a computer science perspective, primarily from the viewpoint of computer scientists who are interested in learning about auction theory, and to provide pointers into the economics literature for those who want a deeper technical understanding. We'll also take a peek into how the paper was used to build a new online auction platform Artsy.</p> <p>• <i>Sophia Gold's lightning talk</i>:</p> <p><i><b>An Intellectual History of Automatic Differentiation</b></i> traces the research surrounding a collection of techniques for computing derivatives without using either approximation or the manipulation of subscript-filled equations used to terrorize high school students. While its simplicity gives this method the mystery of \"deep magic,\" it has its roots in work on differential equations in the late 19th century; inspired Alonzo Church's discovery of the untyped lambda calculus; influenced the development of functional programming, concurrency, and Unix in the 1970s; and has been recently rediscovered with applications to type theory, modelling stochastic processes, and training recurrent neural networks.</p> <p><i>References</i></p> <p><i>- </i><a href=\"https://mitpress.mit.edu/books/little-schemer\">&lt;/a&gt;<i>&lt;a href=\"https://books.google.com/books/about/Computer_Aided_Manipulation_of_Symbols.html?id=KWYROAAACAAJ\"&gt;Computer Aided Manipulation of Symbols</a>, </i>Fred McBride 1971</p> <p>- <a href=\"http://www.eopl3.com\">&lt;/a&gt;<i>&lt;a href=\"https://hal.inria.fr/inria-00306565/PDF/rr_iria202.pdf\"&gt;Coroutines and Networks of Parallel Processes</a>,</i> Gilles Kahn &amp; David MacQueen, 1977 </p> <p>- <i><a href=\"https://swtch.com/~rsc/thread/squint.pdf\">Squinting at Power Series</a>,</i> Doug McIlroy, 1989 </p> <p>- <i><a href=\"http://www.sciencedirect.com/science/article/pii/S0304397597000650\">Generating Power of Lazy Semantics</a>, </i>Jerzy Karczmarczuk,1997 </p> <p>- <i><a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;ved=0ahUKEwjfir7huMfTAhWF2yYKHXcyC5EQFggpMAA&amp;url=http%3A%2F%2Fwww.cs.dartmouth.edu%2F~doug%2Fpearl.ps.gz&amp;usg=AFQjCNEZeoiSvgAZ104ezBkhF8bsJI4Qcw&amp;sig2=DBK7u2GFo8ke05mCDDHpZQ\">Power Series, Power Serious</a>, </i>Doug McIlroy, 1998 </p> <p>- <i><a href=\"http://www2.tcs.ifi.lmu.de/~miranda/public/cocalculus.pdf\">Calculus in Coinductive Form</a>,</i> Pavlovic &amp; Escardo 1998</p> <p>- <a href=\"http://www.michaelnielsen.org/ddi/lisp-as-the-maxwells-equations-of-software/\">&lt;/a&gt;<i>&lt;a href=\"https://pdfs.semanticscholar.org/4edf/d071cf5012aaa69449c9fe76646955a8d185.pdf\"&gt;Functional Differentiation of Computer Programs</a>, </i>Jerzy Karczmarczuk, 2000</p> <p>- <i><a href=\"http://folk.ntnu.no/haugwarb/Programming/Haskell/haskell_automatic_differentiation_II.pdf\">Adjoint Codes in Functional Framework</a>,</i> Jerzy Karczmarczuk, 2000</p> <p>- <a href=\"http://pllab.is.ocha.ac.jp/~asai/papers/thesis.ps.gz\">&lt;/a&gt;<i>&lt;a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;ved=0ahUKEwjHq_WDu8fTAhXM1CYKHTvAAXUQFggnMAA&amp;url=http%3A%2F%2Fbcl.hamilton.ie%2F~barak%2Fpapers%2Fifl2005.ps.gz&amp;usg=AFQjCNFF1QCTVcQKQT6omrrFIgxzubIM8Q&amp;sig2=JUzkOpesJgfXdta724k1Lg\"&gt;Perturbation Confusion and Referential Transparency: Correct Functional Implementation of Forward-Mode AD</a>, </i>Pearlmutter &amp; Siskind, 2005 </p> <p>- <i><a href=\"http://www.bcl.hamilton.ie/~barak/papers/toplas-reverse.pdf\">Reverse-Mode AD in a Functional Framework: Lambda the Ultimate Backpropagator</a>,</i> Pearlmutter &amp; Siskind, 2008</p> <p><i>- <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwi0wfulu8fTAhVKNSYKHdY-Dl4QFggnMAA&amp;url=http%3A%2F%2Fciteseerx.ist.psu.edu%2Fviewdoc%2Fdownload%3Fdoi%3D10.1.1.471.7213%26rep%3Drep1%26type%3Dpdf&amp;usg=AFQjCNHNQoIGY9yJxuPSCXdjhDOHo3AO8A&amp;sig2=4I5iSYUSgvmkW6UJPomECA\">The Differential Lambda-Calculus</a>,</i> Ehrhard &amp; Regnier, 2001</p> <p><i>- </i><a href=\"https://arxiv.org/abs/1611.03416\">Efficient Implementation of a Higher-Order Language with Built-In AD, Pearlmutter &amp; Siskind</a>, 2016 </p> <p><b>Bios<br/></b></p> <p><b><a href=\"http://code.dblock.org\">Daniel Doubrovkine</a></b> (aka dB., <a href=\"https://twitter.com/dblockdotorg\">@dblockdotorg</a>) is a seasoned entrepreneur and technologist, CTO at Artsy.net in New York, working on bringing the art world online. He is a maintainer of multiple popular open-source projects, including Java Native Access, Ruby Grape, Hashie and the popular Slack Ruby client, bot and server libraries. Daniel graduated from University of Geneva in late 90s and founded and sold Vestris Inc., an early stage technology start-up right after college. He joined Microsoft as Development Lead, was Director at Visible Path, then Architect and Development Manager at Application Security.</p> <p><b><a href=\"https://github.com/Sophia-Gold\">Sophia Gold</a></b> has lived many lives: after studying to be a studio artist she has worked at a large quantitative asset manager, developed a consultancy designing embedded systems, and performed professionally as a contortionist. These days she spends a lot of time programming in Clojure and Haskell and, despite being impressively undereducated in higher mathematics, primarily focuses on developing new techniques for automatic differentiation and other problems in computer algebra.</p> <p>------------------------------------------------------------------------------------------</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentations will begin at 7:20 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After Daniel's presentation, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>--------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/d/6/b/600_461684395.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/d/7/1/600_461684401.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/a/d/8/0/600_461684416.jpeg","width":null}],"time":1495666800000,"title":"Daniel Doubrovkine on \"Auctions and Bidding\" & PWLMini w/ Sophia Gold","url":"https://www.meetup.com/papers-we-love/events/239562163/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"240218464":{"description":"<p>This is going to be another special one! We're working with the <a href=\"https://qconnewyork.com/\">QCon New York</a> team to put together a series of 4 PWL \"mini\" (15~20-minute) presentations by 4 wonderful speakers: <a href=\"http://hunch.net/~jl/\">John Langford</a>,  <a href=\"http://adereth.github.io/about/\">Matt Adereth</a> (<a href=\"https://twitter.com/adereth\">@adereth</a>), <a href=\"https://charity.wtf\">Charity Majors</a> (<a href=\"https://twitter.com/mipsytipsy\">@mipsytipsy</a>), and <a href=\"https://prodlife.wordpress.com\">Gwen Shapira</a> (<a href=\"https://twitter.com/gwenshap\">@gwenshap</a>) that will be announced very soon. Many of whom are also speaking at QCon! </p> <p><b>Abstracts</b></p> <p><b><i>John Langford</i></b> on <b><a href=\"https://arxiv.org/pdf/1606.03966.pdf\">Making Contextual Decisions with Low Technical Debt</a></b>:</p> <p><i>Applications and systems are constantly faced with decisions that require picking from a set of actions based on contextual information. Reinforcement-based learning algorithms such as contextual bandits can be very effective in these settings, but applying them in practice is fraught with technical debt, and no general system exists that supports them completely. We address this and create the first general system for contextual learning, called the Decision Service. Existing systems often suffer from technical debt that arises from issues like incorrect data collection and weak debuggability, issues we systematically address through our ML methodology and system abstractions. The Decision Service enables all aspects of contextual bandit learning using four system abstractions which connect together in a loop: explore (the decision space), log, learn, and deploy. Notably, our new explore and log abstractions ensure the system produces correct, unbiased data, which our learner uses for online learning and to enable real-time safeguards, all in a fully reproducible manner. </i></p> <p><i>The Decision Service has a simple user interface and works with a variety of applications: we present two live production deployments for content recommendation that achieved click-through improvements of 25-30%, another with 18% revenue lift in the landing page, and ongoing applications in tech support and machine failure handling. The service makes real-time decisions and learns continuously and scalably, while significantly lowering technical debt.</i> </p> <p><i><b>Matt Adereth</b> </i>on the <a href=\"https://academic.oup.com/comjnl/issue/7/4\"><b>January 1965 issue of The Computer Journal</b></a>:</p> <p><i>This issue contains one of the most important techniques in numerical optimization, the <a href=\"https://academic.oup.com/comjnl/article-abstract/7/4/308/354237/A-Simplex-Method-for-Function-Minimization?redirectedFrom=fulltext\">Nelder-Mead simplex method</a>. <a href=\"https://qconnewyork.com/ny2017/speakers/matt-adereth\">My qCon talk covers the modern distributed version of this algorithm</a>, but in this talk we’re going to try and understand the historical context by looking at everything else in the journal, from the other papers to the letters to the editor to the advertisements.<br/></i></p> <p><i><b>Charity Majors</b> </i>on <b><a href=\"http://db.disi.unitn.eu/pages/VLDBProgram/pdf/industry/p767-wiener.pdf\">Scuba: Diving into Data at Facebook</a></b>:</p> <p><i>Facebook takes performance monitoring seriously. Performance issues can impact over one billion users so we track thousands of servers, hundreds of PB of daily network traffic, hundreds of daily code changes, and many other metrics. We require latencies of under a minute from events occuring (a client request on a phone, a bug report filed, a code change checked in) to graphs showing those events on developers’ monitors.</i></p> <p><i>Scuba is the data management system Facebook uses for most real-time analysis. Scuba is a fast, scalable, distributed, in-memory database built at Facebook. It currently ingests millions of rows (events) per second and expires data at the same rate. Scuba stores data completely in memory on hundreds of servers each with 144 GB RAM. To process each query, Scuba aggregates data from all servers. Scuba processes almost a million queries per day. Scuba is used extensively for interactive, ad hoc, analysis queries that run in under a second over live data. In addition, Scuba is the workhorse behind Facebook’s code regression analysis, bug report monitoring, ads revenue monitoring, and performance debugging.<br/></i></p> <p><i><b>Gwen Shapira</b></i> on <b><a href=\"https://research.fb.com/wp-content/uploads/2016/11/realtime_data_processing_at_facebook.pdf\">Realtime Data Processing at Facebook</a></b></p> <p><i>Realtime data processing powers many use cases at Facebook, including realtime reporting of the aggregated, anonymized voice of Facebook users, analytics for mobile applications, and insights for Facebook page administrators. Many companies have developed their own systems; we have a realtime data processing ecosystem at Facebook that handles hundreds of Gigabytes per second across hundreds of data pipelines. </i></p> <p><i>Many decisions must be made while designing a realtime stream processing system. In this paper, we identify five important design decisions that affect their ease of use, performance, fault tolerance, scalability, and correctness. We compare the alternative choices for each decision and contrast what we built at Facebook to other published systems. </i></p> <p><i>Our main decision was targeting seconds of latency, not milliseconds. Seconds is fast enough for all of the use cases we support and it allows us to use a persistent message bus for data transport. This data transport mechanism then paved the way for fault tolerance, scalability, and multiple options for correctness in our stream processing systems Puma, Swift, and Stylus...</i></p> <p><b>Details</b></p> <p>Doors open at 7 pm; the room is named the <b>Broadway Ballroom North Center</b>; the presentations will begin at 7:30 pm. <b>Due to venue restrictions, there will be no food or refreshments provided at the event, please prepare accordingly</b>! </p> <p>You'll have to check-in with your Name/ID. Definitely sign-up if you’re going to attend!</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p><b>Bios</b></p> <p><i>John Langford</i> is a machine learning research scientist, a field which he says \"is shifting from an academic discipline to an industrial tool\". He is the author of the weblog <a href=\"http://hunch.net\">hunch.net</a> and the principal developer of <a href=\"https://github.com/JohnLangford/vowpal_wabbit\">Vowpal Wabbit</a>. John works at Microsoft Research New York, of which he was one of the founding members, and was previously affiliated with Yahoo! Research,Toyota Technological Institute, and IBM's Watson Research Center. He studied Physics and Computer Science at the California Institute of Technology, earning a double bachelor's degree in 1997, and received his Ph.D. in Computer Science from Carnegie Mellon University in 2002. He was the program co-chair for the 2012 International Conference on Machine Learning. </p> <p><i>Matt Adereth</i> is a Managing Director at <a href=\"https://www.twosigma.com\">Two Sigma </a>Investments, where he works on tools, infrastructure and methodologies for quantitative financial research. He previously worked at Microsoft on Office, focusing on data connectivity and visualization features. In his spare time, he designs open-source ergonomic keyboards using Clojure. </p> <p><i>Charity Majors</i> is a cofounder and engineer at <a href=\"https://honeycomb.io\">Honeycomb.io</a>, a startup that blends the speed of time series with the raw power of rich events to give you interactive, iterative debugging of complex systems. She has worked at companies like Facebook, Parse, and Linden Lab, as a systems engineer and engineering manager, but always seems to end up responsible for the databases too. She loves free speech, free software and a nice peaty single malt.</p> <p><i>Gwen Shapira</i> is a product manager at <a href=\"https://www.confluent.io\">Confluent</a>. She has 15 years of experience working with code and customers to build scalable data architectures, integrating relational and big data technologies. Gwen is the author of<i> <a href=\"http://shop.oreilly.com/product/0636920044123.do\">Kafka - The Definitive Guide</a></i> and <a href=\"http://shop.oreilly.com/product/0636920033196.do\"><i>Hadoop Application Architectures</i></a>, and a frequent presenter at industry conferences. Gwen is a PMC member on the Apache Kafka project and committer on Apache Sqoop. When Gwen isn't building data pipelines or thinking up new features, you can find her pedaling on her bike exploring the roads and trails of California, and beyond.</p> <p>-------------------------------------------------------------------------------------</p> <p><img src=\"https://secure.meetupstatic.com/photos/event/4/4/b/8/600_450377592.jpeg\" /></p> <p><a href=\"https://qconnewyork.com/\">QCon NewYork</a> - Host and Venue Sponsor for this Event</p> <p>-------------------------------------------------------------------------------------</p> <p>-------------------------------------------------------------------------------------</p> <p><img src=\"https://secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>-------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/5/2/0/600_462574080.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/5/2/2/600_462574082.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/5/2/3/600_462574083.jpeg","width":null}],"time":1498518000000,"title":"Papers We Love - QCon NYC Edition w/ John, Matt, Charity, and Gwen","url":"https://www.meetup.com/papers-we-love/events/240218464/","utcOffset":-14400000,"venue":{"address1":"1535 Broadway","address2":null,"city":"New York","country":"US","lat":40.75861740112305,"lon":-73.98622131347656,"name":"New York Marriott Marquis","postalCode":null}},"241525902":{"description":"<p>We're happy to be hosting Wes Chow, CTO of <a href=\"https://chartbeat.com\">Chartbeat</a>, who'll be presenting on <b><a href=\"https://otr.cypherpunks.ca/otr-wpes.pdf\">Off-the-Record Communication, or, Why Not To Use PGP</a> </b> by Borisov, Goldberg, and Brewer. </p> <p><b>Intro</b></p> <p>Your intrepid reporter goes to a private location and meets with a key source who wishes to remain anonymous and off the record. The reporter understands that all information she learns from the source must be validated elsewhere and not directly quoted (private), that the source is who he says he is (authenticated), and that should their conversation become public they could both plausibly deny having said any of the recorded words (repudiable). How do we construct a digital version of an IRL meeting?</p> <p>Nikita Borisov, Ian Goldberg, and Eric Brewer devise a communication protocol in Off-the-Record Communication, or Why Not To Use PGP that provides all of the above mentioned properties, as well as forward-secrecy (breaking the encryption on one message doesn’t give an attacker keys to past or future messages). Wes will review the OTR protocol and its clever collection of strong and purposefully weak cryptographic techniques that form the basis of the <a href=\"https://whispersystems.org\">Signal</a> private messaging app.</p> <p><b>Bio</b></p> <p><i>Wes Chow </i>(<a href=\"https://twitter.com/weschow\">@weschow</a>) has a B.S. in Electrical Engineering &amp; Computer Science from UC Berkeley. He spent eight years building technical infrastructure for high frequency trading shops. One day, he stared into his dark soul and realized he needed to move into the startup light. Thus S7 Labs sprang into being, and he led teams that built Storybox, a Seedcamp NY finalist, and Songza Radio, subsumed by Google Music. He's now at Chartbeat serving out his term as CTO. </p> <p>------------------------------------------------------------------------------------------</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------------------------</p> <p><b>Details</b></p> <p>Doors open at 7 pm; the presentations will begin at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>A little different than previous PWLs, you'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After Wes's presentation, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>--------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/c/2/f/600_463175887.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/c/3/1/600_463175889.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/c/3/4/600_463175892.jpeg","width":null}],"time":1500505200000,"title":"Wes Chow on \"Off-the-Record Communication, or, Why Not To Use PGP\"","url":"https://www.meetup.com/papers-we-love/events/241525902/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"242063907":{"description":"<p>We're happy to be hosting <a href=\"http://gbaz.github.io\">Gershom Bazerman</a>, software developer at S&amp;P/Capital IQ, author of various Haskell libraries, and organizer/founder of the <a href=\"https://www.meetup.com/NY-Haskell/\">NY Haskell Users Group</a>, who'll be presenting on <i><b><a href=\"http://math.univ-lyon1.fr/~malbos/Art/hcTRS.pdf\">Homological Computations for Term Rewriting Systems</a></b></i> by Philippe Malbos and Samuel Mimram. </p> <p>In addition to Gershom's talk, <a href=\"https://people.eecs.berkeley.edu/~stephentu/\">Stephen Tu</a> will be opening the event with a <b><i>lightning talk</i></b> on <a href=\"https://users.cs.duke.edu/~parr/jmlr03.pdf\"><b>Least Squares Policy Iteration</b></a> by Michail G. Lagoudakis and Ronald Parr. </p> <p><b>Talks</b></p> <p>• <i>Gershom Bazerman on Homological Computations for Term Rewriting Systems:</i></p> <p>In 1987, C. Squier wrote \"<i><a href=\"http://www.sciencedirect.com/science/article/pii/0022404987901290\">Word problems and a homological finiteness condition for monoids</a></i>,\" [1] which proved a fascinating result that spawned an entire field, but which is little known outside of it. The great mathematical popularizer and category theorist <a href=\"https://en.wikipedia.org/wiki/John_C._Baez\">John Baez</a> <a href=\"http://math.ucr.edu/home/baez/week70.html\">sketched the ideas in 1995</a>. We consider \"word problems,\" which ask the equality of two terms modulo a set of equivalences, restrict ourselves to simple objects called \"&lt;a&gt;monoids&lt;/a&gt;\" that many functional programmers are fond of, and ask about the decidability of equality over them. This is the same as looking at strings and asking when they are equal if you consider mappings that equate some contiguous sequences with other contiguous sequences. (Such problems arise ubiquitously in interesting computational problems -- consider for example the equivalence of sequences of patches, or of edit actions across a distributed system). The way computer scientists would think to answer this is to see if you can rewrite both sides of the equation into a single canonical form that you can compare for equality. Indeed, that's what Don Knuth and Peter Bendix did, and the result is the &lt;a&gt;Knuth-Bendix algorithm&lt;/a&gt;, used in theorem provers and many other applications. </p> <p>But just how universal is the Knuth-Bendix algorithm? Well, Squier showed that there are finite monoids with decidable word problems that cannot be turned into such canonical rewrite procedures as Knuth-Bendix gives us. And furthermore, he showed that this result derives from considering our systems using the tools of modern algebraic topology! In particular, he showed how to calculate a homology of a monoid presentation.  </p> <p>Ever since then, people have been seeking to generalize Squier's result in new and exciting ways. One of the niftiest and newest was presented last year at <a href=\"http://fscd2016.dcc.fc.up.pt/programme/acceptedPapers/\">FSCD</a>,<a href=\"http://math.univ-lyon1.fr/~malbos/Art/hcTRS.pdf\"> this talk's paper</a>, which I love, but do not claim to fully understand. Instead of a monoid, we consider an arbitrary \"algebraic theory\" (say, a syntax tree of a programming language with some equalities between certain forms of trees). And we now ask not about the word problem, but just the minimum number of equalities necessary to present such a theory. The answer, which can be computed with an algorithm, comes from even more, and more generalized homology.  The purpose of this talk is to make the above understandable to a lay audience, to sketch some idea of how to think about things that arise in computer science topologically, and to provide an invitation to basic notions of <a href=\"https://en.wikipedia.org/wiki/Homology_(mathematics)\">homology</a>.</p> <p>• <i>Stephen Tu on Least Squares Policy Iteration:</i></p> <p>Policy iteration is a classic dynamic programing algorithm for solving a Markov Decision Process (MDP). In policy iteration, the algorithm alternates between two steps: 1) a policy evaluation step which, given the current policy, computes the state-action value function (commonly known as the Q-function) for the policy, and 2) a policy improvement step, which uses the Q-function to greedily improve the current policy. When the number of states and actions of the MDP is finite and small, policy iteration performs well and comes with nice theoretical guarantees. However, when the state and action spaces are large (possibly continuous), policy iteration becomes intractable, and approximate methods for solving MDPs must be used. </p> <p>Least Squares Policy Iteration (LSPI) is one method for approximately solving an MDP. The key idea here is to approximate the Q-function as a linear functional in a lifted, higher dimensional space, analogous to the idea of feature maps in supervised learning. Plugging this approximation into the Bellman equation gives a tractable linear system of equations to solve for the policy evaluation step. Furthermore, the policy improvement step remains the same as before.</p> <p>In this talk, I will describe LSPI and some of its subtleties. One subtlety arises due to the fact that the Bellman operator is not necessarily invariant on our approximate function class, and hence an extra projection step is typically used to minimize the Bellman residual after projecting back on the function space. Furthermore, in order to build intuition for LSPI, I will also talk about what the LSPI algorithm does in the context of a well studied continuous optimal control problem known as the Linear Quadratic Regulator (LQR). </p> <p><b>Bios</b></p> <p><a href=\"http://gbaz.github.io/\"><i><b>Gershom Bazerman</b></i></a> is a software developer in New York. He is an organizer of the <a href=\"https://www.meetup.com/NY-Haskell/\">NY Haskell Users Group</a>, the <a href=\"https://groups.google.com/forum/#!forum/hott-nyc\">NY Homotopy (or Topos) Theory Reading group</a>, and the <a href=\"http://www.composeconference.org\">Compose conference</a> among other things. He's written some useful and used Haskell libraries, occasionally contributed to others, as well as to the PureScript compiler, and has also helped maintain Haskell infrastructure for some time. He likes reading complicated things and trying to understand and explain them.</p> <p><i><b><a href=\"https://people.eecs.berkeley.edu/~stephentu/\">Stephen Tu</a></b></i> is a PhD student in the EECS department at UC Berkeley, studying problems in the intersection of optimization, control theory, and statistics. This summer, he is interning at the Google Brain team in NYC, which has sparked his interest in reinforcement learning. </p> <p><b>Details</b></p> <p><b>Doors open at 6:30 pm</b>; the <b>presentations will begin right around 7:00 pm</b>; and, yes, there will be refreshments of all kinds and pizza.</p> <p><b>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in. </b></p> <p>After Gershom's presentation, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit <a href=\"https://paperswelove.slack.com/messages/pwlnyc/\">#pwlnyc</a> on <a href=\"http://papersweloveslack.herokuapp.com/\">slack</a>, our <a href=\"https://github.com/papers-we-love/papers-we-love\">GitHub repository</a>, or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p><i><a href=\"https://www.twosigma.com/\">TwoSigma</a> - Platinum Sponsor of the New York chapter</i></p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/b/3/9/7/600_464685975.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/b/3/9/a/600_464685978.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/b/3/9/b/600_464685979.jpeg","width":null}],"time":1504218600000,"title":"Gershom Bazerman on \"Homological Computations for Term Rewriting Systems\" & Mini","url":"https://www.meetup.com/papers-we-love/events/242063907/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"242066112":{"description":"<p>We're super excited to host <a href=\"https://blog.jessfraz.com\">Jessie Frazelle</a>, software engineer at Microsoft, contributor to <a href=\"https://github.com/opencontainers/runc\">RunC</a> and Golang, has served as Maintainer of Docker, and is the Keyser Söze of container security. She'll be presenting on <a href=\"https://www.usenix.org/system/files/conference/osdi16/osdi16-arnautov.pdf\"><b>SCONE: Secure Linux Containers with Intel SGX</b></a> by Arnautov, et. al.</p> <p>In addition to Jessie's talk, PWLNYC Organizer David Ashby will be opening the event with a lightning talk on the <a href=\"http://nvlpubs.nist.gov/nistpubs/FIPS/NIST.FIPS.180-4.pdf\">Secure Hash Standard</a>, specifically <i>SHA256</i>, called <i>SHAmwow: Poorly Re-implementing SHA256 for Fun and Profit</i>.</p> <p><b>Talks</b></p> <p>• <i><b>Jessie Frazelle on SCONE</b></i>:</p> <p>Containers are the latest infrastructure trend. In 2016, the SCONE (<a href=\"https://www.usenix.org/system/files/conference/osdi16/osdi16-arnautov.pdf\" class=\"linkified\">https://www.usenix.org/system/files/conference/osdi16/osdi16-arnautov.pdf</a>) paper was written and presented at the USENIX Symposium on Operating Systems Design and Implementation (<a href=\"https://www.usenix.org/conference/osdi16\" class=\"linkified\">https://www.usenix.org/conference/osdi16</a>). It outlined how to use Intel Secure Enclaves (<a href=\"https://en.wikipedia.org/wiki/Software_Guard_Extensions\" class=\"linkified\">https://en.wikipedia.org/wiki/Software_Guard_Extensions</a>) to guard containers against attack. Containers are built on the kernel primitives cgroups and namespaces with additional LSM (Linux Security Module) layers on top, such as AppArmor, SELinux, and seccomp. Intel SGX protects code from modification by using protected areas of memory known as enclaves. With containers and adoption of cloud on the rise, this paper continues to be on the cutting edge of what is to come. Some cloud providers are now starting to expose hardware specific features like GPU and SGX, which would make running containers with Intel's SGX trusted execution a reality in the cloud. With Intel's SGX, you can have a container's process shielded from access by other programs. We'll explore how realistic this is today and in the future as well as what benefits this would have to the security of containers.</p> <p>• <i>David Ashby on SHA256</i>: </p> <p>While most of us use hash functions on a daily basis, few people can say that they truly understand what’s actually going on when they call <i>SHA2(\"hello world\")</i>. Even fewer can say they’ve bothered to implement the function themselves, considering every introduction to cryptography starts off with a big warning saying to never, ever implement cryptographic primitives and just use vetted libraries due to the security implications. Of course, that important warning didn’t stop me from digging into <a href=\"http://nvlpubs.nist.gov/nistpubs/FIPS/NIST.FIPS.180-4.pdf\">the FIPS 180-4 spec</a> to scratch the itch to understand how exactly it works, and along the way get a much better intuition about what bitwise operators actually do, what a bitrotation is, and why hex notation actually matters.</p> <p><b>Bios</b></p> <p><i><b><a href=\"https://blog.jessfraz.com\">Jessie Frazelle</a></b></i> works with Linux and Containers at Microsoft. She loves all things involving Linux namespaces and cgroups and is probably most well known for running desktop applications in containers. Jessie has been a maintainer of Docker and a contributor to RunC, Kubernetes, Linux, and Golang, among other projects, maintained the AppArmor, Seccomp, and SELinux bits in Docker, and is quite familiar with locking down containers.</p> <p><b><i><a href=\"https://twitter.com/alazyreader\">David Ashby</a></i></b> is a self-taught programmer and systems engineer who sometimes spends his weekends implementing hash functions in high-level languages. He also helps organize the meetup, but no nepotism was to blame for the existence of this presentation.</p> <p><b>Details</b></p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Jessie's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/8/1/5/600_468730261.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/8/2/0/600_468730272.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/8/2/6/600_468730278.jpeg","width":null}],"time":1507588200000,"title":"Jessie Frazelle on SCONE: Secure Linux Containers with Intel SGX & a PWLMini","url":"https://www.meetup.com/papers-we-love/events/242066112/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"245275162":{"description":"<p>We're thrilled to host Camilo Aguilar, software engineer at Enigma and fellow PWL organizer (of the <a href=\"https://www.meetup.com/paperswelovemde/\">Medellín chapter</a>), presenting on <a href=\"https://www.andrew.cmu.edu/course/15-749/READINGS/required/cas/tridgell96.pdf\">the rsync algorithm</a> by A. Tridgell and P. Mackerras.</p> <p>In addition to Camilo's talk, PWLNYC Organizer <i>David Ashby</i> will be opening the event with a lightning talk on the <a href=\"http://nvlpubs.nist.gov/nistpubs/FIPS/NIST.FIPS.180-4.pdf\">Secure Hash Standard</a>, specifically <i>SHA256</i>, called <i>SHAmwow: Poorly Re-implementing SHA256 for Fun and Profit</i>.</p> <p><b>Talks</b></p> <p>• <b><i>Camilo Aguilar on the rsync algorithm</i></b>:</p> <p>Modern computers are very powerful. These days, mobile phones are packed with multi core CPUs and even GPUs. Despite these advances in hardware, internet connections in most parts of the world are still surprisingly slow and unreliable.  This creates a challenge: how can files be efficiently transferred between computers over a low-bandwidth, high latency network connection?  In 1996, Andrew Tridgell and Paul Mackerras developed a simple solution which powers one of the most useful UNIX tools, rsync. The algorithm remains relevant 21 years after its invention because it solves a timeless problem.</p> <p>This talk will take you step by step through the rsync algorithm. You will learn that PhD theses are not always scary or unapproachable. Hopefully, you will also leave with a better intuition about the inner workings of rsync,  as well as ideas for how its principles can be building blocks for solving many other different problems.</p> <p><i>Other References</i>:</p> <p>- <a href=\"https://www.samba.org/~tridge/phd_thesis.pdf\">Efficient Algorithms for Sorting and Synchronization</a></p> <p>• <i><b>David Ashby on SHA256</b></i>: </p> <p>While most of us use hash functions on a daily basis, few people can say that they truly understand what’s actually going on when they call <i>SHA2(\"hello world\")</i>. Even fewer can say they’ve bothered to implement the function themselves, considering every introduction to cryptography starts off with a big warning saying to never, ever implement cryptographic primitives and just use vetted libraries due to the security implications. Of course, that important warning didn’t stop me from digging into <a href=\"http://nvlpubs.nist.gov/nistpubs/FIPS/NIST.FIPS.180-4.pdf\">the FIPS 180-4 spec</a> to scratch the itch to understand how exactly it works, and along the way get a much better intuition about what bitwise operators actually do, what a bit rotation is, and why hex notation actually matters.</p> <p><b>Bios</b></p> <p><a href=\"https://github.com/c4milo\"><b><i>Camilo Aguilar</i></b></a> is a Software Engineer at <a href=\"https://www.enigma.com/\">Enigma</a> and a founding member of <a href=\"https://github.com/papers-we-love/medellin\">Papers We Love Medellín</a>. When not working, he travels to unknown places with his wife. He believes writing a bio is a lot more difficult than explaining rsync.</p> <p><b><i><a href=\"https://twitter.com/alazyreader\">David Ashby</a></i></b> is a self-taught programmer and systems engineer who sometimes spends his weekends implementing hash functions in high-level languages. He also helps organize the meetup, but no nepotism was to blame for the existence of this presentation.</p> <p><b>Details</b></p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Camilo's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/7/7/a/600_468730106.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/7/8/1/600_468730113.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/7/9/6/600_468730134.jpeg","width":null}],"time":1512603000000,"title":"Camilo Aguilar on the rsync algorithm & a PWLMini by David Ashby","url":"https://www.meetup.com/papers-we-love/events/245275162/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"245856629":{"description":"<p>We're happy to host Suz Hinton, open-source hardware developer and cloud developer advocate at Microsoft, presenting on <a href=\"http://bit.ly/2CZci4Y\">Accessible images (AIMS): a model to build self-describing images for assisting screen reader users</a> by Ab Shaqoor Nengroo and K. S. Kuppusamy.</p> <p><b>Talk</b></p> <p>In my latest experimentations in 'Guerilla Accessibility,' I stumbled upon this paper a mere two weeks after publication and was excited about the explorations in it. The ideas built upon an unlikely hero of the anti-surveillance field delighted me. There are wide implementation gaps that remain unaddressed in this paper, and I took liberty on these when implementing the algorithms. I'll be sharing both the triumphs and pitfalls of this proposed technique of improving the accessibility of online web content.</p> <p><b>Bio</b></p> <p><i><a href=\"http://noopkat.com/\">Suz Hinton</a></i> (<a href=\"https://twitter.com/noopkat\">@noopkat</a>) works in developer relations at Microsoft. Prior to her current role, Suz was a senior front-end developer at companies such as Kickstarter and Zappos. She’s an avid open source contributor, working in robotics, accessibility, and creative coding. She enjoys implementing hardware drivers in high level languages just because she can.</p> <p><b>Details</b></p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Suz's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/6/f/3/600_468729971.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/7/0/3/600_468729987.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/7/2/d/600_468730029.jpeg","width":null}],"time":1518737400000,"title":"Suz Hinton on Accessible images (AIMS)","url":"https://www.meetup.com/papers-we-love/events/245856629/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"245860299":{"description":"<p>We're thrilled to host Ben Linsay, engineer extraordinaire, presenting on HyperLogLog: the analysis of a near-optimal cardinality estimation algorithm (<a href=\"http://algo.inria.fr/flajolet/Publications/FlFuGaMe07.pdf\" class=\"linkified\">http://algo.inria.fr/flajolet/Publications/FlFuGaMe07.pdf</a>) by Flajolet, et. al.</p> <p>In addition to Ben's talk, Sandy Vanderbleek will be opening the event with a lightning talk on Peter Norvig's Correcting A Widespread Error in Unification Algorithms (<a href=\"https://norvig.com/unify-bug.pdf\" class=\"linkified\">https://norvig.com/unify-bug.pdf</a>).</p> <p>Talks</p> <p>• Ben Linsay on HyperLogLog</p> <p>This extended abstract describes and analyses a near-optimal probabilistic algorithm, HyperLogLog, dedicated to estimating the number of distinct elements (the cardinality) of very large data ensembles. Using an auxiliary memory of m units (typically, \"short bytes\"), HyperLogLog performs a single pass over the data and produces an estimate of the cardinality such that the relative accuracy (the standard error) is typically about 1.04/√m. This improves on the best previously known cardinality estimator, LogLog, whose accuracy can be matched by consuming only 64% of the original memory. For instance, the new algorithm makes it possible to estimate cardinalities well beyond 10^9 with a typical accuracy of 2% while using a memory of only 1.5 kilobytes. The algorithm parallelizes optimally and adapts to the sliding window model.</p> <p>• Sandy Vanderbleek on Correcting A Widespread Error in Unification Algorithms</p> <p>Peter Norvig found an error in the unification algorithm presented in his AI textbooks and several others and wrote a brief paper about it. While his paper focuses on Lisp implementations of higher-order unification, I will restrict the problem to syntactic propositional unification and present the erroneous and correct algorithm in a pattern and substitution notation.</p> <p>Bios</p> <p>• Ben Linsay (<a href=\"http://blinsay.com/\" class=\"linkified\">http://blinsay.com/</a>) (@blinsay (<a href=\"https://twitter.com/blinsay\" class=\"linkified\">https://twitter.com/blinsay</a>)) is somehow still a software engineer. He's worked on distributed data processing pipelines in adtech, built and maintained APIs for small startups, and has accidentally been a DBA twice. Ben has written a couple HyperLogLog implementations in his spare time and doesn't really want to show them to anyone.</p> <p>• Sandy Vanderbleek (<a href=\"https://twitter.com/haskellandchill\" class=\"linkified\">https://twitter.com/haskellandchill</a>) has been a software engineer in industry and academia for 10 years. He is currently a Data Scientist at Publicis Media (<a href=\"http://www.publicisgroupe.com/en/services/services-publicis-media-en\" class=\"linkified\">http://www.publicisgroupe.com/en/services/services-publicis-media-en</a>). His research interests are formal methods and computational logic with applications to industry.</p> <p>Details</p> <p>Doors open at 7:00 pm; the presentations will begin right at 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Ben's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.<br/>------------------------------------------------------------------------------------------<br/><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/5/4/a/600_433302314.jpeg\" /></p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter<br/>------------------------------------------------------------------------------------------</p> ","photos":[],"time":1526338800000,"title":"Ben Linsay on HyperLogLog & a PWLMini by Sandy Vanderbleek","url":"https://www.meetup.com/papers-we-love/events/245860299/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"246848117":{"description":"<p>We're glad to host Hannes Frederic Sowa, programmer at <a href=\"http://backtrace.io/\">backtrace.io</a> and has worked on the Linux Kernel networking  stack (focusing on IPv6). Hannes will be presenting on <b><i><a href=\"https://research.google.com/pubs/pub45814.html\">BBR: Congestion-Based Congestion Control  </a></i></b>by N. Cardwell, et. al.</p> <p><b>Talk</b></p> <p>TCP congestion control has a large impact on perceived network performance (especially in terms of bandwidth and latency) and thus the Internet. Two major categories of congestion control algorithms had been explored, those using packet loss or packet delay feedback. Due to historic developments (and the development of packet switching hardware), packet-loss congestion control algorithms are commonly used today. We will discuss a congestion control scheme published by Google in 2017.</p> <p><b>Bio</b></p> <p><i>Hannes Frederic Sowa</i> recently joined <a href=\"http://backtrace.io\">backtrace.io</a>, and is onsite in New York for a month. Normally he resides in Zurich, Switzerland. Before switching jobs, he worked on the Linux Kernel networking stack focusing on IPv6. Hannes interest in higher level languages has recently been rebooted. During off-time and when not reading, he enjoys spontaneous trips with minimal luggage or crashing flight simulators.</p> <p><b>Details</b></p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Hannes's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/7/6/2/600_468730082.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/7/6/9/600_468730089.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/2/7/6/e/600_468730094.jpeg","width":null}],"time":1517441400000,"title":"Hannes Frederic Sowa on \"BBR: Congestion-Based Congestion Control\"","url":"https://www.meetup.com/papers-we-love/events/246848117/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"246885115":{"description":"<p>We're super excited to host Libby Kent, software engineer, distributed ledger programmer, and demonstrator of Monads Made Semi-Understandable (<a href=\"https://www.youtube.com/watch?v=J3Djb1VyzkM\" class=\"embedded\">https://www.youtube.com/watch?v=J3Djb1VyzkM</a>)! She'll be presenting on the Ethereum White Paper (<a href=\"http://blockchainlab.com/pdf/Ethereum_white_paper-a_next_generation_smart_contract_and_decentralized_application_platform-vitalik-buterin.pdf\" class=\"linkified\">http://blockchainlab.com/pdf/Ethereum_white_paper-a_next_generation_smart_contract_and_decentralized_application_platform-vitalik-buterin.pdf</a>): A Next-Generation Smart Contract and Decentralized Application Platform (also available here (<a href=\"https://github.com/ethereum/wiki/wiki/White-Paper\" class=\"linkified\">https://github.com/ethereum/wiki/wiki/White-Paper</a>) with additional details), authored by Vitalik Buterin.</p> <p>Talk</p> <p>In 2009 bitcoin emerged as a peer-to-peer value transfer system, and was successfully deployed throughout the world. Four years later (2013), the Ethereum white paper was published by an 18 year old Vitalik Buterin which builds on top of the Bitcoin consensus model to allow for distributed computation and applications to be deployed on a decentralized peer-to-peer network.</p> <p>This paper discusses introducing a turing complete language that can be run on top of the network, utilizing a modified consensus algorithm (GHOST), strategies for defending against mining centralization, further application of such a system beyond just finance, the introduction of state, as well as a history of bitcoin and and the fundamental concepts of the underlying blockchain.</p> <p>Bio</p> <p>Libby (<a href=\"http://blog.libbykent.com/\" class=\"linkified\">http://blog.libbykent.com/</a>) (@viskobatz (<a href=\"https://twitter.com/viskobatz\" class=\"linkified\">https://twitter.com/viskobatz</a>)) is a software engineer, former Hacker Schooler (now Recurse Center (<a href=\"https://www.recurse.com/\" class=\"linkified\">https://www.recurse.com/</a>)) and Papers We Love groupie who leans towards functional programming, and really wants to understand category theory some day. She has worked in an array of industries from game startups to digital publishing and advertising and is currently in financial services, working on distributed systems - distributed ledger technology, blockchain - and cloud technologies. When not coding she enjoys snowboarding, tennis, traveling, friends, good conversations, beer, coffee, dark chocolate and cheese.</p> <p>Details</p> <p>Doors open at 6:45 pm; the presentations will begin right around 7:15 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Libby's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/f/5/6/600_470848502.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/f/7/b/600_470848539.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/f/9/5/600_470848565.jpeg","width":null}],"time":1524177900000,"title":"Libby Kent on Ethereum: The World Computer (2013)","url":"https://www.meetup.com/papers-we-love/events/246885115/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"246900563":{"description":"<p>We're extremely glad to host Bonnie Eisenman, senior software engineer at Twitter and member of NYC Resistor, presenting on <a href=\"https://n-e-r-v-o-u-s.com/education/papers/nervousSystem_2012-jigsaw-puzzle-paper.pdf\">Multiphase Numerical Modeling of Dendritic Solidification for Jigsaw Puzzle Generation</a> by J. Louis-Rosenberg, A. Resnick, and J. Rosenkrantz.</p> <p><b>Talk</b></p> <p>This paper explores expansions on the stylistic variety of handmade and artisanal jigsaw puzzles through the application of techniques from natural simulation. Typical jigsaw puzzle designs reflect the manufacturing constraints of die-cut, mass-production methods, but novel families of puzzle forms can be generated by applying a phase field approach to the simulation of <a href=\"http://www.phase-trans.msm.cam.ac.uk/dendrites.html\">dendritic solidification</a>. Existing models of solidification with multiphase methods are extended to satisfy aesthetic and geometric considerations specific to jigsaw puzzle design.</p> <p>It's a mixture of math, physics, and good old-fashioned puzzling.</p> <p><b>Bio</b></p> <p><a href=\"https://medium.com/@brindelle\">Bonnie Eisenman</a> is a senior software engineer at Twitter and a member of the hackerspace <a href=\"https://www.nycresistor.com/\">NYC Resistor</a>, with previous experience at Codecademy, Fog Creek Software, and Google. She is the author of <a href=\"https://www.amazon.com/gp/product/1491929006/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1491929006&amp;linkCode=as2&amp;tag=bonnieisen-20&amp;linkId=IWLKP5BIVDREECM3\">Learning React Native</a>, a book on building native iOS and Android applications with Javascript, published with O’Reilly Media. In her spare time, she enjoys learning languages, tinkering with hardware projects, and knitting. Find her on Twitter as <a href=\"https://twitter.com/brindelle\">@brindelle</a>.</p> <p><b>Details</b></p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Bonnie's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/5/7/3/600_469970547.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/5/9/1/600_469970577.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/5/b/6/600_469970614.jpeg","width":null}],"time":1522276200000,"title":"Bonnie Eisenman on Multiphase Numerical Modeling... for Jigsaw Puzzle Generation","url":"https://www.meetup.com/papers-we-love/events/246900563/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"248968886":{"description":"<p>We're happy to host John Feminella (<a href=\"http://jxf.me/\" class=\"linkified\">http://jxf.me/</a>), technologist and advisor, presenting on Bitcoin: A Peer-to-Peer Electronic Cash System (<a href=\"https://bitcoin.org/bitcoin.pdf\" class=\"linkified\">https://bitcoin.org/bitcoin.pdf</a>) by Satoshi Nakamoto on its 10-year anniversary.</p> <p>Talk</p> <p>The original Bitcoin paper was published by a pseudonymous individual named Satoshi Nakamoto on Halloween 2008, in the quiet recesses of a small cryptography mailing list, where it was mostly ignored. A couple of months afterwards, Satoshi published the original Bitcoin client software that implemented the ideas in the paper.</p> <p>Ten years later, a lot has happened both about cryptocurrency, and a lot of money has changed hands. In this talk, we explore the core ideas laid out in the paper, the historical background around digital currencies, and how these ideas and history were implemented in the original Bitcoin client.</p> <p>Bio</p> <p>John Feminella (<a href=\"http://jxf.me/\" class=\"linkified\">http://jxf.me/</a>) (@jxxf (<a href=\"https://twitter.com/jxxf\" class=\"linkified\">https://twitter.com/jxxf</a>)) is an avid technologist, occasional public speaker, and curiosity advocate. He serves as an advisor to Pivotal (<a href=\"https://pivotal.io/\" class=\"linkified\">https://pivotal.io/</a>), where he works on helping enterprises transform the way they write, operate, and deploy software. He's also the cofounder of a tiny analytics monitoring startup named UpHex (<a href=\"http://uphex.com/\" class=\"linkified\">http://uphex.com/</a>).</p> <p>John lives in Charlottesville, VA and likes meta-jokes, milkshakes, and referring to himself in the third person in speaker bios.</p> <p>Details</p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After John's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/7/3/4/600_473782324.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/7/3/8/600_473782328.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/7/4/0/600_473782336.jpeg","width":null}],"time":1531261800000,"title":"John Feminella on Bitcoin: A Peer-to-Peer Electronic Cash System","url":"https://www.meetup.com/papers-we-love/events/248968886/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"250809091":{"description":"<p>This June we're working with QCon New York (<a href=\"https://qconnewyork.com/\" class=\"linkified\">https://qconnewyork.com/</a>) to bring you a series of 2 25-minute talks on 2 different papers! We're very lucky to be able and host Carmen Andoh, Golestan \"Sally\" Radwan, and PWL alumni, Matt Adereth.</p> <p>Please register at <a href=\"https://www.eventbrite.com/e/community-night-papers-we-love-qcon-registration-46136097309\" class=\"linkified\">https://www.eventbrite.com/e/community-night-papers-we-love-qcon-registration-46136097309</a> to attend this event, instead of doing so through the Meetup page.</p> <p>Note: There will be no free food or drinks at this event, please grab something beforehand or afterward. We will be heading to O'Lunney's (<a href=\"https://www.yelp.com/biz/o-lunneys-new-york\" class=\"linkified\">https://www.yelp.com/biz/o-lunneys-new-york</a>) afterward, located at 145 W 45 St for food and refreshments as well.</p> <p>Papers:</p> <p>* Golestan \"Sally\" Radwan on What Does Explainable AI Really Mean? A New Conceptualization of Perspectives (<a href=\"https://arxiv.org/pdf/1710.00794.pdf\" class=\"linkified\">https://arxiv.org/pdf/1710.00794.pdf</a>) by D. Doran, S. Schulz, T. R. Besold</p> <p>* Carmen Andoh on Communicating Sequential Processes (<a href=\"https://spinroot.com/courses/summer/Papers/hoare_1978.pdf\" class=\"linkified\">https://spinroot.com/courses/summer/Papers/hoare_1978.pdf</a>) by C.A.R. Hoare</p> <p>* Matt Adereth on The Mode Tree: A Tool for Visualization of Nonparametric Density Features (<a href=\"https://www.semanticscholar.org/paper/The-Mode-Tree-%3A-A-Tool-forVisualization-of-Density-Minnotte-Scott/a4bc99f4fa560ebdfe956d4cb5d761158566e7bf\" class=\"linkified\">https://www.semanticscholar.org/paper/The-Mode-Tree-%3A-A-Tool-forVisualization-of-Density-Minnotte-Scott/a4bc99f4fa560ebdfe956d4cb5d761158566e7bf</a>) by Michael C. Minnotte and David W. Scott.</p> <p>Bios:</p> <p>* Golestan \"Sally\" Radwan (@smarthelix) is a Computer and Biomedical Engineer. Until recently, she led the AI product portfolio at London-based health tech startup babylon health, leading a team of doctors, engineers, AI scientists and designers to create an intelligent mobile platform for medical diagnosis, predictive health, and chronic disease management. Prior to babylon, Sally spent over 10 years in the technology industry in Germany, the UK and the USA, where she held various positions in engineering management, strategic planning and product management for the likes of Canonical/Ubuntu, Avaya Inc and NTT Data. Sally holds a BSc in Computer Engineering from Cairo University, an MBA from London Business School, and an MSc in Clinical Engineering and Healthcare Technology Management from the University of London, where she is currently finishing her PhD in AI and Computational Biology. She is also working on launching her own AI startup, which is currently in stealth mode.</p> <p>* Carmen Andoh (@carmatrocity) is a software engineer on the Build Infrastructure team at Travis CI. She was the first scholarship recipient for Gophercon in 2015, where she was first introduced to Go, and hasn't looked back. Ask her about her past lives as a Behavioral Analyst for Autism Spectrum Disorders, Teach for America, and having personally visited over 1000 high schools in the states of NJ, TX, NM, and CO, and all 5 boroughs of NYC.</p> <p>* Matt Adereth is a Managing Director at Two Sigma Investments (<a href=\"https://www.twosigma.com\" class=\"linkified\">https://www.twosigma.com</a>), where he works on tools, infrastructure and methodologies for quantitative financial research. He previously worked at Microsoft on Office, focusing on data connectivity and visualization features. In his spare time, he designs open-source ergonomic keyboards using Clojure.</p> <p>------------------------------------------------------------------------------------------<br/>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>QCon NYC (<a href=\"https://qconnewyork.com/\" class=\"linkified\">https://qconnewyork.com/</a>) - Co-host and Sponsor for this event.<br/>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/8/b/c/600_472775004.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/8/c/9/600_472775017.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/8/d/8/600_472775032.jpeg","width":null}],"time":1530140400000,"title":"PWLNYC: QCon NYC Edition w/ Carmen, Sally, and Matt","url":"https://www.meetup.com/papers-we-love/events/250809091/","utcOffset":-14400000,"venue":{"address1":"1535 Broadway","address2":null,"city":"New York","country":"US","lat":40.75861740112305,"lon":-73.98622131347656,"name":"New York Marriott Marquis","postalCode":null}},"252093590":{"description":"<p>We are excited to host Dan Bentley, CEO of Windmill, presenting The Connection Machine: Computer Architecture for the New Wave (<a href=\"https://dspace.mit.edu/bitstream/handle/1721.1/14719/18524280-MIT.pdf\" class=\"linkified\">https://dspace.mit.edu/bitstream/handle/1721.1/14719/18524280-MIT.pdf</a>) by Danny Hillis.</p> <p>Talk:</p> <p>The Connection Machine is a computer that a time traveler borrowed from 2015 and accidentally returned to the wrong decade. How else to explain a 1985 computer with 65,536 processors? That's motivated by doing computer vision? We'll cover The Connection Machine (Danny Hillis's Ph.D. thesis) and the related \"Data Parallel Algorithms\" in discussing this provocative technological vision. The big question: how did the Connection Machine get so much right but end up a footnote?</p> <p>Bio:</p> <p>Dan Bentley's a software engineer building Live Development as CEO of Windmill. He's opened for The Who, and has a check from Donald Knuth.</p> <p>Lightning Talk:</p> <p>68 years ago MIND published 'COMPUTING MACHINERY AND INTELLIGENCE' (<a href=\"https://www.csee.umbc.edu/courses/471/papers/turing.pdf\" class=\"linkified\">https://www.csee.umbc.edu/courses/471/papers/turing.pdf</a>) the paper that would gift the world 'The Turing Test'. Everyone knows it, everyone can give the basics of what the turning test is; or at least they think they do.</p> <p>What exactly is the Imitation Game, how was it framed, and what did Alan Turning actually care about when he proposed this idea? Lets explore together, section by section and see how this paper informed AI in the past and where it is still taking AI today.</p> <p>Bio:</p> <p>Matthew Bergman is a polyglot programmer who cares way more about people and ethics then the code he writes. He is well versed in Ruby on Rails and Western philosophy, especially Hegelian philosophy.</p> <p>Details</p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Dan's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/e/7/1/600_474532849.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/e/8/f/600_474532879.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/e/a/e/600_474532910.jpeg","width":null}],"time":1536100200000,"title":"Dan Bentley on The Connection Machine","url":"https://www.meetup.com/papers-we-love/events/252093590/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"254505298":{"description":"<p>**Please Note: We cannot accommodate +1s on your RSVP. Everyone must register and RSVP on their own.**</p> <p>We are excited to host John Allspaw, Principal Researcher at Adaptive Capacity Labs, presenting Problem Detection (<a href=\"https://www.researchgate.net/publication/220579480_Problem_detection\" class=\"linkified\">https://www.researchgate.net/publication/220579480_Problem_detection</a>) by Gary Klein, Rebecca Pliske, Beth Crandall, and David Woods.</p> <p>Talk:</p> <p>Published in 2005 in the journal Cognition, Technology and Work, \"Problem Detection\" explores the \"process by which people first become concerned that events may be taking an unexpected and undesirable direction that potentially requires action.\" While this paper primarily centers on empirically rebutting previous theories of how problems are detected, it also puts forth many important observations and concepts for software engineering to pay close attention to. This talk won't just be a re-statement of the paper's core views; I will place these into a software engineering and operations context and connect them to SRE and DevOps worlds in ways that may be consequential.</p> <p>The paper's authors are Gary Klein, Rebecca Pliske, Beth Crandall, and David Woods.</p> <p>Paper: <a href=\"https://www.researchgate.net/publication/220579480_Problem_detection\" class=\"linkified\">https://www.researchgate.net/publication/220579480_Problem_detection</a></p> <p>Bio:</p> <p>John Allspaw has worked in software systems engineering and operations for over twenty years in many different environments: biotech, government, online media, social networking, and e-commerce. John’s publications include the books The Art of Capacity Planning (2009) and Web Operations (2010) as well as the forward to “The DevOps Handbook”. His 2009 Velocity talk with Paul Hammond, “10+ Deploys Per Day: Dev and Ops Cooperation” helped start the DevOps movement.</p> <p>John served as CTO at Etsy, holds an MSc in Human Factors and Systems Safety from Lund University, and is currently a Principal Researcher at Adaptive Capacity Labs.</p> <p>----</p> <p>Lightning Talk:</p> <p>Lydia Gu on A Tutorial on Thompson Sampling</p> <p>Abstract:</p> <p>Multi-armed bandits is an online machine learning framework which trades off exploitation, selecting the current best choice, and exploration, gathering data on unknown options. One strategy for implementing this tradeoff is Thompson sampling. First proposed in 1933 in the context of clinical trials, Thompson sampling was mostly forgotten in academic literature until the recent decade. Around 2010, a couple of papers demonstrated empirically its competitive performance, prompting a flurry of academic work. In this lightning talk, we will give an overview of the multi-armed bandits problem and the Thompson sampling algorithm, and see how it has been used by companies for personalization.</p> <p>Paper: <a href=\"https://arxiv.org/pdf/1707.02038.pdf\" class=\"linkified\">https://arxiv.org/pdf/1707.02038.pdf</a></p> <p>Bio:</p> <p>Lydia Gu is a tech lead at B12, a startup that's changing the way websites are made using humans + AI. She has an MEng from MIT and lives in New York, where she enjoys rock climbing, escape the rooms, and escaping the city.</p> <p>----</p> <p>Details:</p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After John's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/a/1/c/600_475883068.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/a/2/1/600_475883073.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/a/2/7/600_475883079.jpeg","width":null}],"time":1539642600000,"title":"John Allspaw on Problem Detection","url":"https://www.meetup.com/papers-we-love/events/254505298/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"256220927":{"description":"<p>**Please note the later start time! We will open doors at 7pm and begin at 7:30pm**</p> <p>We are excited to host Elijah Ben Izzy speaking on Divide and Conquer Algorithms for Closest Point problems in Multidimensional Space (<a href=\"http://www.cs.unc.edu/techreports/76-103.pdf\" class=\"linkified\">http://www.cs.unc.edu/techreports/76-103.pdf</a>)</p> <p>Talk:</p> <p>Given n points in k dimensional space, how can you efficiently find the pair that is closest together? It turns out that there’s an elegant, divide-and-conquer approach that utilizes a nifty trick. Jon Luis Bentley, a pioneer in the space of geometric algorithms, proposes this solution (and answers many more problems) in his original PhD thesis, written in 1976. The talk will focus in on his solution to the closest-pair problem, then discuss some general approaches to algorithm construction that he outlined when defending his thesis... all written with a type-writer.</p> <p>Elijah is a quantitative software engineer at Two Sigma. Ever since he started studying CS in college, he’s loved taking deep dives into complex, elegant algorithms and building out systems to support them. He came across Jon Luis Bentley’s PhD thesis when researching for an algorithms class, and found it to be a piece of archaeological computer science gold.</p> <p>----</p> <p>Lightning Talk:</p> <p>Dan Rubenstein will present \"Time, Clocks and the Ordering of Events in a Distributed System\" by Leslie Lamport (<a href=\"https://www.microsoft.com/en-us/research/publication/time-clocks-ordering-events-distributed-system/\" class=\"linkified\">https://www.microsoft.com/en-us/research/publication/time-clocks-ordering-events-distributed-system/</a>)</p> <p>Today, we take the ability to look at our phone and see what time it is for granted. But what if time weren’t so easy? In his 1978 paper “Time, Clocks, and the Ordering of Events in a Distributed System”, Leslie Lamport illustrates several key facts with time and events in distributed systems that have key importance for our ‘web-scale’ systems of 2018. We’ll investigate a few concepts from the paper, and try to understand why clocks may not be so straightforward after all.</p> <p>Dan Rubenstein is a software engineer at Blue State Digital. He’s worked on political campaigns in three electoral cycles, and is happy to hear your theory for why the polls were wrong.</p> <p>----</p> <p>Details:</p> <p>**Doors open at 7:00 pm**; the presentations will begin right around 7:30 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Elijah's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1543449600000,"title":"Elijah Ben Izzy on Divide and Conquer Algorithms","url":"https://www.meetup.com/papers-we-love/events/256220927/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"257942475":{"description":"<p>We're happy to host John Feminella (<a href=\"http://jxf.me/\" class=\"linkified\">http://jxf.me/</a>), technologist and advisor, presenting on Impossibility of Distributed Consensus with One Faulty Process (<a href=\"https://groups.csail.mit.edu/tds/papers/Lynch/jacm85.pdf\" class=\"linkified\">https://groups.csail.mit.edu/tds/papers/Lynch/jacm85.pdf</a>) by Michael J. Fischer, Nancy A. Lynch and Michael S. Paterson.</p> <p>Talk</p> <p>If you think it's hard to get humans to agree on something, wait until you see how computers work! Computer scientists call this problem consensus, and when the computers involved are in an asynchronous environment, it's distributed consensus.</p> <p>For about a decade prior to this paper, computer scientists had been debating whether distributed consensus was solvable in real environments. At the time, it was known that synchronous consensus, a weaker version of distributed consensus where everyone acts at the same time, was possible — and even better, it was resilient to crashed or unreliable processes. But was the same true for distributed consensus? Can you design a distributed consensus algorithm that is resilient to these kinds of failures?</p> <p>As the paper's title (\"Impossibility of Distributed Consensus with One Faulty Process\") might suggest, the answer is \"no, it isn't possible\". This turns out to have sweeping implications for the reliability of distributed systems, as we'll see in our talk. See you there!</p> <p>Bio</p> <p>John Feminella (<a href=\"http://jxf.me/\" class=\"linkified\">http://jxf.me/</a>) (@jxxf (<a href=\"https://twitter.com/jxxf\" class=\"linkified\">https://twitter.com/jxxf</a>)) is an avid technologist, occasional public speaker, and curiosity advocate. He serves as an advisor to Pivotal (<a href=\"https://pivotal.io/\" class=\"linkified\">https://pivotal.io/</a>), where he works on helping enterprises transform the way they write, operate, and deploy software. He's also the cofounder of a tiny analytics monitoring startup named UpHex (<a href=\"http://uphex.com/\" class=\"linkified\">http://uphex.com/</a>).</p> <p>John lives in Charlottesville, VA and likes meta-jokes, milkshakes, and referring to himself in the third person in speaker bios.</p> <p>Details</p> <p>Doors open at 6:30 pm; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After John's presentation, we will open up the floor to discussion and questions.</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> <p>------------------------------------------------------------------------------------------</p> <p>TwoSigma (<a href=\"https://www.twosigma.com/\" class=\"linkified\">https://www.twosigma.com/</a>) - Platinum Sponsor of the New York chapter</p> <p>------------------------------------------------------------------------------------------</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/9/9/9/600_478098841.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/c/e/4/600_478099684.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/d/0/2/600_478103810.jpeg","width":null}],"time":1548372600000,"title":"John Feminella on Impossibility of Distributed Consensus with One Faulty Process","url":"https://www.meetup.com/papers-we-love/events/257942475/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"258749434":{"description":"<p>We are excited to host Sarah Groff Hennigh-Palermo speaking on Exception Handling: Issues and a Proposed Notation from John B. Goodenough (<a href=\"https://web.eecs.umich.edu/~weimerw/[masked]/reading/goodenough-exceptions.pdf\" class=\"linkified\">https://web.eecs.umich.edu/~weimerw/[masked]/reading/goodenough-exceptions.pdf</a>)</p> <p>Talk:</p> <p>Errors and debugging are the bane of a programmer’s life — and the source of many jokes, Twitter rants, and midnight breakdowns. As programming matures as a practice, we continue to add different ways to avoid and address errors, but how did we get here to begin with?</p> <p>Exception Handling: Issues and a Proposed Notation from John B. Goodenough (1975) details the needs and goals of an exception handling system and then gets specific with suggestions of syntax, including remedies to known issues in the system.</p> <p>In this talk, we will take a look at the development of one approach to errors, — throwing and handling exceptions — as it developed in PL/I. Some of these features have not made it all the way to common modern languages, so this is a chance to take a look at what we've lost to time.</p> <p>Sarah Groff Hennigh-Palermo (sarahghp.com / @superSGP on Twitter) is an artist, programmer, and erstwhile data designer. Her work centers around methods to make computers and data more humane — more accessible, more flexible, more contextual. She has created data-obscured art sites, new computer languages, and hybrid nostalgia machines.</p> <p>Her current focuses are livecode, digital abstraction, and discovering new ways to break things.</p> <p>Sarah is an alumna of the School for Poetic Computation, Recurse Center, Brown University, and NYU Tandon School of Engineering.</p> <p>----</p> <p>Details:</p> <p>**Doors open at 6:30 pm**; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Sarah's presentation, we will open up the floor to discussion and questions.</p> <p>**Talks are always recorded on video and released ~2 weeks after the meetup.**</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1550619000000,"title":"Sarah Groff Palermo on Exception Handling: Issues and a Proposed Notation","url":"https://www.meetup.com/papers-we-love/events/258749434/","utcOffset":-18000000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"259743812":{"description":"<p>We are excited to host Sun-Li Beatteay speaking on Guaranteeing Consensus in Distributed Systems with CRDTs</p> <p>Talk:</p> <p>Consensus in distributed systems has been a debated topic every since programmers discovered they could run the same program on multiple machines. Researchers have been studying consensus for decades, resulting in numerous algorithms and white papers. Unfortunately, many of these algorithms are flawed and unreliabled.</p> <p>However, in 2011, a team of researchers published a paper on a novel approach to distributed consensus using Conflict-free Replicated Data Types (<a href=\"https://hal.inria.fr/inria-00609399v1/document\" class=\"linkified\">https://hal.inria.fr/inria-00609399v1/document</a>). This paper created quite a buzz as it showed that CRDTs were mathematically proven to guarantee consensus through \"Strong Eventual Consistency.\" They also claimed to have solved the CAP conundrum.</p> <p>This presentation dives into this seminal paper in order to answer the hard questions. What are CRDTs? How do they work? And most importantly, does it actually solve CAP? By the end of this talk, everyone in the audience will have a foundational understanding of CRDTs and how they can be applied to their own work.</p> <p>Best of all, I will be explaining all of this is as simple language as possible. No advanced math degree required! Sound too good to be true? You'll just have to come see for yourself!</p> <p>Bio:</p> <p>Sunny Beatteay (<a href=\"http://sunli.co\" class=\"linkified\">http://sunli.co</a>) (@SunnyPaxos <a href=\"https://twitter.com/SunnyPaxos\" class=\"linkified\">https://twitter.com/SunnyPaxos</a>) is a software engineer and writer. He works on the Storage team at DigitalOcean where he helps to build Cloud products for fellow engineers. He also writes stories and tutorials related to technology on Medium (<a href=\"https://medium.com/@SunnyB\" class=\"linkified\">https://medium.com/@SunnyB</a>).</p> <p>Sunny lives in Brooklyn, NY. When he's not writing software, you can often find him drinking fine whiskeys, entertaining his cat, and playing Zelda. Usually at the same time.</p> <p>----</p> <p>Details:</p> <p>**Doors open at 6:30 pm**; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Sunny's presentation, we will open up the floor to discussion and questions.</p> <p>**Talks are always recorded on video and released ~2 weeks after the meetup.**</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1553641200000,"title":"Sun-Li Beatteay on Guaranteeing Consensus in Distributed Systems with CRDTs","url":"https://www.meetup.com/papers-we-love/events/259743812/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"260160755":{"description":"<p>We are excited to host John Valois speaking on Wait-Free Synchronization</p> <p>Talk:</p> <p>How do we implement data structures in a shared memory environment? The conventional answer is to use mutual exclusion, but this approach does not behave well when we encounter delays or failures in the critical section, forcing other processes to wait.</p> <p>Wait-Free Synchronization by Maurice Herlihy (<a href=\"https://cs.brown.edu/~mph/Herlihy91/p124-herlihy.pdf\" class=\"linkified\">https://cs.brown.edu/~mph/Herlihy91/p124-herlihy.pdf</a>) explores an idea which ensures that operations complete in finite time regardless of the relative speeds of other processes. We’ll see a connection to the ubiquitous consensus problem and a framework for understanding what synchronization primitives are necessary and sufficient for implementing a given object, culminating in a method for implementing any object in a wait-free manner.</p> <p>Bio:</p> <p>John Valois is a Managing Director at BlackRock where he works on core platform engineering.</p> <p>----</p> <p>Details:</p> <p>**Doors open at 6:30 pm**; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After John's presentation, we will open up the floor to discussion and questions.</p> <p>**Talks are always recorded on video and released ~2 weeks after the meetup.**</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1555542000000,"title":"John Valois on Wait-Free Synchronization","url":"https://www.meetup.com/papers-we-love/events/260160755/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"261571316":{"description":"<p>We are excited to host John Langford speaking on Real World Reinforcement Learning</p> <p>Talk:</p> <p>We’ve created a dozen real world reinforcement learning deployments enabling use cases around contextual personalization and contextual optimization culminating in the new Cognitive Services Personalizer (<a href=\"https://azure.microsoft.com/en-us/services/cognitive-services/personalizer/\" class=\"linkified\">https://azure.microsoft.com/en-us/services/cognitive-services/personalizer/</a>) which makes these techniques available to the world on a mass scale. I’ll discuss the key technology (and papers) behind this along with the possibilities that it allows. Amongst other things, the counterfactual evaluation system we’ve created makes optimization over policies radically faster and friendlier than A/B testing.</p> <p>Bio:</p> <p>John Langford is a machine learning research scientist, a field which he says \"is shifting from an academic discipline to an industrial tool\". He is the author of the weblog <a href=\"http://hunch.net/\" class=\"linkified\">http://hunch.net/</a> and the principal developer of Vowpal Wabbit (<a href=\"http://hunch.net/~vw/\" class=\"linkified\">http://hunch.net/~vw/</a>). John works at Microsoft Research New York, of which he was one of the founding members.</p> <p>----</p> <p>Details:</p> <p>**Doors open at 6:30 pm**; the presentations will begin right around 7:00 pm; and, yes, there will be refreshments of all kinds and pizza.</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After John's presentation, we will open up the floor to discussion and questions.</p> <p>**Talks are always recorded on video and released ~2 weeks after the meetup.**</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1559084400000,"title":"John Langford on Real World Reinforcement Learning","url":"https://www.meetup.com/papers-we-love/events/261571316/","utcOffset":-14400000,"venue":{"address1":"101 Ave. of the Americas, 23rd Fl. J","address2":null,"city":"New York ","country":"US","lat":40.72338104248047,"lon":-74.00542449951172,"name":"Two Sigma","postalCode":null}},"262272744":{"description":"<p>Note that this meetup has MOVED from Two Sigma to Microsoft Reactor at 11 Times Square (42nd and 8th)! You _must_ have your real name on your account _and_ provide a photo ID at the entrance to attend, per the venue rules.</p> <p>-----</p> <p>Elizabeth Ramirez will be presenting the paper \"Transition Matrix Estimation in High Dimensional Time Series\" (<a href=\"http://proceedings.mlr.press/v28/han13a.pdf\" class=\"linkified\">http://proceedings.mlr.press/v28/han13a.pdf</a>).</p> <p>About the Paper:</p> <p>The state-transition matrix $A$ is a matrix you use to propagate the state vector over time, i.e. $x_{t+1} = Ax_{t} + Bu$. It usually comes from the equations that describe the system, but if you don’t know the dynamics of your system or the system is stochastic, this matrix has to be estimated. This paper presents multiple methods to estimate this matrix for high-dimensional VAR time series.</p> <p>----</p> <p>Speaker:</p> <p>Elizabeth Ramirez is an Electrical Engineer and Applied Mathematician. I'm an Applied Scientist at Descartes Labs, where I solve very large linear systems that model complex systems, like transportation. <a href=\"https://twitter.com/eramirem\" class=\"linkified\">https://twitter.com/eramirem</a></p> <p>----</p> <p>You'll have to check-in with security with your Name/ID. Definitely sign-up if you’re going to attend–unfortunately people whose names aren’t entered into the security system in advance won’t be allowed in.</p> <p>After Elizabeth's presentation, we will open up the floor to discussion and questions.</p> <p>**Talks are always recorded on video and released ~2 weeks after the meetup.**</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1561676400000,"title":"Elizabeth Ramirez on Transition Matrix Estimation","url":"https://www.meetup.com/papers-we-love/events/262272744/","utcOffset":-14400000,"venue":{"address1":"11 Times Sq","address2":null,"city":"New York","country":"us","lat":40.756561279296875,"lon":-73.9898910522461,"name":"Microsoft","postalCode":"10036"}},"263820844":{"description":"<p>**Note that this meetup has MOVED to Datadog at 620 8th Ave (across from Port Authority)!</p> <p>You _must_ have your real name on your account _and_ provide a photo ID at the entrance to attend, per the venue rules.**</p> <p>-----</p> <p>We've got a special edition of Papers We Love tonight as we round up a gang of speakers for Lightning Talks! Each speakers will present for 15 - 20m on a topic dear to their heart related to computers. We're still filling out the list of talks but you can see some of them below:</p> <p>* Talk: Approximation Algorithms for Lawn Mowing and Milling - <a href=\"http://www.ams.sunysb.edu/~jsbm/papers/lawn-mow-cgta.pdf\" class=\"linkified\">http://www.ams.sunysb.edu/~jsbm/papers/lawn-mow-cgta.pdf</a></p> <p>Catherine Holloway almost completed a PhD in experimental quantum optics at the University of Waterloo's Institute for Quantum Computing but dropped out to work at a few robotics and quantum computing startups. She currently lives in Manhattan and is an SRE at Bloomberg.</p> <p>* Talk: Branch Prediction and the Performance of Interpreters - Don't Trust Folklore (Erven Rohou, Bharath Narasimha Swamy, André Seznec, 2015). <a href=\"https://hal.inria.fr/hal-01100647/document\" class=\"linkified\">https://hal.inria.fr/hal-01100647/document</a></p> <p>Max Marrone is a recent computer science graduate whose other interests include aviation and design. He aspires to someday be able to transfer laundry from the washer to the dryer without accidentally dropping wet clothing all over the dirty floor</p> <p>* Talk: The Sensitivity Conjecture Solved!<br/><a href=\"http://www.mathcs.emory.edu/~hhuan30/papers/sensitivity_1.pdf\" class=\"linkified\">http://www.mathcs.emory.edu/~hhuan30/papers/sensitivity_1.pdf</a></p> <p>Homin Lee has a PhD in computational learning theory, and is currently a data scientist at Datadog.</p> <p>* Talk: Flipping Bits in Memory Without Accessing Them: An Experimental Study of DRAM Disturbance Errors (Yoongu Kim, Ross Daly, Jeremie Kim, Chris Fallin, Ji Hye Lee, Donghyuk Lee, Chris Wilkerson, Konrad Lai, Onur Mutlu) - <a href=\"http://users.ece.cmu.edu/~yoonguk/papers/kim-isca14.pdf\" class=\"linkified\">http://users.ece.cmu.edu/~yoonguk/papers/kim-isca14.pdf</a></p> <p>Andrew Gross graduated with a degree in Applied Physics and the knowledge that he did not want to pursue a career in it. He currently lives in Queens and works as a Staff Engineer at YipitData.</p> <p>---</p> <p>Venue:</p> <p>Datadog<br/>620 8th Ave, 45th Floor<br/>New York, NY 10018 USA<br/>7pm</p> <p>---</p> <p>**Talks are always recorded on video and released ~2 weeks after the meetup.**</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1566255600000,"title":"Lightning Round!","url":"https://www.meetup.com/papers-we-love/events/263820844/","utcOffset":-14400000,"venue":{"address1":"620 8th Ave","address2":null,"city":"New York","country":"us","lat":40.75608825683594,"lon":-73.9901123046875,"name":"Datadog","postalCode":"10018"}},"265575294":{"description":"<p>***<br/>PLEASE NOTE: You _must_ have your real name on your account _and_ provide a photo ID at the entrance to attend, per the venue rules.<br/>***</p> <p>We've got two talks for you this evening!</p> <p>Jonathan Brown will present Life Beyond Distributed Transactions by Pat Helland.</p> <p>Paper: <a href=\"http://www-db.cs.wisc.edu/cidr/cidr2007/papers/cidr07p15.pdf\" class=\"linkified\">http://www-db.cs.wisc.edu/cidr/cidr2007/papers/cidr07p15.pdf</a></p> <p>This paper explores and names some of the practical approaches used in the implementations of large-scale mission-critical applications in a world which rejects distributed transactions.</p> <p>Jonathan Brown is a software engineer at Wallaroo Labs (<a href=\"https://www.wallaroolabs.com/\" class=\"linkified\">https://www.wallaroolabs.com/</a>), a role that has allowed him to explore and learn about many interesting problems in the distributed systems space.</p> <p>---</p> <p>Vaibhav Sagar will present Space-efficient Static Trees and Graphs by Guy Jacobsen.</p> <p>Paper: <a href=\"https://www.computer.org/csdl/proceedings-article/focs/1989/063533/12OmNx2QUHQ\" class=\"linkified\">https://www.computer.org/csdl/proceedings-article/focs/1989/063533/12OmNx2QUHQ</a></p> <p>In this era of bountiful disk space and unlimited cloud storage, it seems<br/>ridiculous to claim that data takes up too much of it. But it does!</p> <p>In this 1989 paper, Guy Jacobson (whose PhD thesis is credited with creating this field of research) introduces a set of techniques to create what he calls \"succinct data structures\", which approach the information-theoretical lower bound for space usage while still allowing useful operations to be performed on the resulting representation. They accomplish this by getting rid of pointers for linking data and operating directly at the bit level. These techniques are used to encode trees and planar graphs, and although the details have changed in the last 30 years, the fundamental concepts are very much the same and still the focus of active research.</p> <p>Vaibhav (@vbhvsgr | <a href=\"https://twitter.com/vbhvsgr\" class=\"linkified\">https://twitter.com/vbhvsgr</a>) used to write web applications for a living. He still does, but he used to, too. When he’s not doing that he yells about functional programming and package managers on Twitter, re-racks bumper plates after using them, and trawls the internet for the finest space disco.</p> <p>---</p> <p>Venue:</p> <p>Datadog<br/>620 8th Ave, 45th Floor<br/>New York, NY 10018 USA<br/>Doors open at 6:30pm EST</p> <p>---</p> <p>**Talks are always recorded on video and released ~2 weeks after the meetup.**</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't.</p> <p>If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1571869800000,"title":"Life Beyond Distributed Transactions / Space-efficient Static Trees and Graphs","url":"https://www.meetup.com/papers-we-love/events/265575294/","utcOffset":-14400000,"venue":{"address1":"620 8th Ave","address2":null,"city":"New York","country":"us","lat":40.75608825683594,"lon":-73.9901123046875,"name":"Datadog","postalCode":"10018"}},"267124284":{"description":"<p>***<br/>PLEASE NOTE: You _must_ have your real name on your account _and_ provide a photo ID at the entrance to attend, per the venue rules.</p> <p>Reminder: Papers We Love has a code of conduct. Breaching that CoC is grounds to be ejected from the meetup at the organizers' discretion.<br/>***</p> <p>\"Deny Capabilities for Safe, Fast Actors (2015)\" by Sylvan Clebsch et al. lays out the core novel idea behind the Pony programming language: reference capabilities. Reference capabilities take object capabilities, turn them on their head and then apply them to variable aliases.</p> <p>Not sure what that means? Come on out to Papers We Love, where Sean T. Allen (member of the Pony core team) will explain Deny Capabilities and how Pony combines them with an actor based model -- to provide a programming environment that allows for data-race freedom and fearless concurrency.</p> <p>- Paper: <a href=\"http://soft.vub.ac.be/AGERE15/papers/AGERE_2015_paper_10.pdf\" class=\"linkified\">http://soft.vub.ac.be/AGERE15/papers/AGERE_2015_paper_10.pdf</a><br/>- Pony: <a href=\"https://www.ponylang.io/\" class=\"linkified\">https://www.ponylang.io/</a></p> <p>----</p> <p>**Speaker Bio**</p> <p>Sean T. Allen is a member of the core team for the Pony programming language and an all-around swell fella.</p> <p>---</p> <p>Venue:</p> <p>Datadog<br/>620 8th Ave, 45th Floor<br/>New York, NY 10018 USA<br/>Doors open at 6:30pm EST</p> <p>---</p> <p>**Talks are always recorded on video and released ~2 weeks after the meetup.**</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't.</p> <p>If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> ","photos":[],"time":1578526200000,"title":"Sean T. Allen on Deny Capabilities for Safe, Fast Actors","url":"https://www.meetup.com/papers-we-love/events/267124284/","utcOffset":-18000000,"venue":{"address1":"620 8th Ave","address2":null,"city":"New York","country":"us","lat":40.75608825683594,"lon":-73.9901123046875,"name":"Datadog","postalCode":"10018"}},"268129607":{"description":"<p>***<br/>PLEASE NOTE: You _must_ have your real name on your account _and_ provide a photo ID at the entrance to attend, per the venue rules.</p> <p>Reminder: Papers We Love has a code of conduct. Breaching that CoC is grounds to be ejected from the meetup at the organizers' discretion.<br/>***</p> <p>Greetings Papers We Love NYC,</p> <p>This month we have a pair of talks prepared! To open we have a lightning talk with Catherine Holloway on 'The Mathematics of Origami', followed by Dan Bentley on 'Build Systems a la Carte'. Check below for the details and links to the papers!</p> <p>***<br/>Build Systems a la Carte, presented by Dan Bentley<br/>***</p> <p>Authors: Andrey Mokhov, Neil Mitchell, Simon Peyton Jones</p> <p>I love this paper because it explores a topic that rarely gets academic attention: build systems (such as Make). It takes a confused landscape and finds a meta-model that even the authors of those tools didn't comprehend. It makes a convincing argument that Excel (!!) is a build system. And it does it all with a healthy dose of functional programming/category theory.</p> <p>I'll try to recap the paper, in terminology and figures that can make sense to users, not just functional programmers. I'll also try and lay out unexplored territory and questions I'm left with.</p> <p>Paper: <a href=\"https://www.microsoft.com/en-us/research/uploads/prod/2018/03/build-systems.pdf\" class=\"linkified\">https://www.microsoft.com/en-us/research/uploads/prod/2018/03/build-systems.pdf</a></p> <p>***<br/>Speaker Bio<br/>***</p> <p>Dan Bentley is a Software Engineer who's currently CEO of Tilt. Tilt's a startup building a Distributed Developer Experience, aka Make for Microservices. Previously, he worked at Google on a build tool that was a predecessor to Bazel, Open Source, and Google Sheets. He's opened for The Who and has received two checks from Donald Knuth.</p> <p>***<br/>The Mathematics of Origami presented by Catherine Holloway<br/>***</p> <p>Author: David A. Huffman</p> <p>Origami designs can produce an amazing diversity of 3-dimensional shapes from a 2-dimensional piece of paper without cuts or glue. In the late 70s, David Huffman (of the Huffman Coding algorithm used in JPEG compression) showed how the same mathematical techniques used for quantifying the amount of charge in an arbitrary electric field, the Gaussian Sphere, can be used to prove which individual vertices in a crease pattern are possible from a simple piece of paper. Determining valid crease patterns has applications to computer graphics, materials science, and design.</p> <p>Paper: <a href=\"http://www.organicorigami.com/thrackle/class/hon394/papers/HuffmanCurvatureAndCreases.pdf\" class=\"linkified\">http://www.organicorigami.com/thrackle/class/hon394/papers/HuffmanCurvatureAndCreases.pdf</a></p> <p>***<br/>Speaker Bio<br/>***</p> <p>Catherine Holloway is an SRE in finance. She previously gave a lightning talk about algorithms for lawn mowing, which has applications in computerized embroidery. She is about to become a mother and has already acquired the inevitable closet full of unused crafting supplies and equipment.</p> <p>---<br/>Venue:</p> <p>Datadog<br/>620 8th Ave, 45th Floor<br/>New York, NY 10018 USA<br/>Doors open at 6:30pm EST<br/>---</p> ","photos":[],"time":1580945400000,"title":"Dan Bentley on Build Systems & Catherine Holloway on The Mathematics of Origami","url":"https://www.meetup.com/papers-we-love/events/268129607/","utcOffset":-18000000,"venue":{"address1":"620 8th Ave","address2":null,"city":"New York","country":"us","lat":40.75608825683594,"lon":-73.9901123046875,"name":"Datadog","postalCode":"10018"}},"270693839":{"description":"<p>Greetings Papers We Love NYC and welcome to our first remote meetup!</p> <p>This month we have a talk by David Ashby on Understanding Real-World Concurrency Bugs in Go. Check below for the details and links to the papers!</p> <p>***<br/>PLEASE NOTE: Even though this is a remote event, the Papers We Love code of conduct is still in effect in any chatrooms or forums associated with the meetup. Breaching the CoC is grounds to be ejected from the meetup at the organizers' discretion.<br/>***</p> <p>***<br/>Understanding Real-World Concurrency Bugs in Go.<br/>***</p> <p>Authors: Tengfei Tu, Xiaoyu Liu, Linhai Song, and Yiying Zhang</p> <p>This paper investigates whether go’s message-passing channel model leads to programmers making fewer concurrency mistakes by examining six real-world large-scale go code bases to see what sort of bugs they have to fix in practice. We’ll review the paper’s research and conclusions, dig into some of the code examples to make sure we understand how the various classes of bugs work, and take some side journeys into the history and influence of Hoare’s Communicating Sequential Processes, what happens when empirical research falls into the hands of its subjects, and the cutest little bunny mascot ever.</p> <p>Paper: <a href=\"https://songlh.github.io/paper/go-study.pdf\" class=\"linkified\">https://songlh.github.io/paper/go-study.pdf</a><br/>Communicating Sequential Processes: <a href=\"https://www.cs.cmu.edu/~crary/819-f09/Hoare78.pdf\" class=\"linkified\">https://www.cs.cmu.edu/~crary/819-f09/Hoare78.pdf</a></p> <p>***<br/>Speaker Bio<br/>***</p> <p>David Ashby is a “Senior Systems Engineer” at SageSure Insurance, which means he works on distributed authentication and authorization services all day. Lucky him! He’s also an organizer of Papers We Love NYC and PWLConf and previously gave a lightning talk at PWLNYC on implementing toy versions of SHA1 and SHA256 in Ruby (<a href=\"https://www.youtube.com/watch?v=KWH7HmvmQ6o\" class=\"embedded\">https://www.youtube.com/watch?v=KWH7HmvmQ6o</a>). Not bad for an English major who dropped out of his first college. When not fighting with computers, he posts pictures of his cat Cricket on Instagram.</p> ","photos":[],"time":1591398000000,"title":"David Ashby on Understanding Real-World Concurrency Bugs in Go","url":"https://www.meetup.com/papers-we-love/events/270693839/","utcOffset":-14400000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"272401929":{"description":"<p>Greetings Papers We Love NYC and welcome to our second remote meetup!</p> <p>This month we have a talk by Toma Morris on CRaft: An Erasure-coding-supported Version of Raft for Reducing Storage Cost and Network Cost. Check below for the details and links to the papers!</p> <p>***<br/>PLEASE NOTE: Even though this is a remote event, the Papers We Love code of conduct is still in effect in any chatrooms or forums associated with the meetup. Breaching the CoC is grounds to be ejected from the meetup at the organizers' discretion.<br/>***</p> <p>***<br/>CRaft: An Erasure-coding-supported Version of Raft for Reducing Storage Cost and Network Cost<br/>***</p> <p>Authors: Zizhong Wang, Tongliang Li, Haixia Wang, Airan Shao, Yunren Bai, Shangming Cai, Zihan Xu, and Dongsheng Wang, Tsinghua University</p> <p>This paper discusses a method for using erasure codes (specifically Reed-Solomon codes) to encode data stored in a Raft cluster to reduce the volume of storage and network traffic, while maintaining the failure-tolerance guarantees that Raft provides. We will briefly discuss the basics of Raft and erasure codes, and then talk through practical examples of how the cluster encodes, stores, and reconstructs data during different failure scenarios.</p> <p>Paper: <a href=\"https://www.usenix.org/system/files/fast20-wang_zizhong.pdf\" class=\"linkified\">https://www.usenix.org/system/files/fast20-wang_zizhong.pdf</a></p> <p>***<br/>Speaker Bio<br/>***</p> <p>Toma is a software engineering manager with the Trust and Safety team at Hinge where they and their team work to prevent scams, harassment, and violence. They have also worked in robotics, AI, medical devices, and various other kinds of projects. Toma studied both Electrical Engineering and History, and is as interested in talking about the early Islamic empire as in distributed systems.</p> ","photos":[],"time":1597791600000,"title":"Toma Morris on CRaft: An Erasure-coding-supported Version of Raft","url":"https://www.meetup.com/papers-we-love/events/272401929/","utcOffset":-14400000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"274304502":{"description":"<p>Welcome to Papers We Love NYC's third remote meetup!</p> <p>We're happy to host John Feminella (<a href=\"http://jxf.me/\" class=\"linkified\">http://jxf.me/</a>), technologist and advisor, presenting on Time, Clocks and the Ordering of Events in a Distributed System by Leslie Lamport (<a href=\"https://lamport.azurewebsites.net/pubs/pubs.html#time-clocks\" class=\"linkified\">https://lamport.azurewebsites.net/pubs/pubs.html#time-clocks</a>)</p> <p>The talk will be streamed for free on PWLNYC's twitch channel:<br/><a href=\"https://www.twitch.tv/paperswelove\" class=\"linkified\">https://www.twitch.tv/paperswelove</a>, and uploaded to the PWL YouTube channel afterward: <a href=\"https://www.youtube.com/channel/UCoj4eQh_dZR37lL78ymC6XA\" class=\"embedded\">https://www.youtube.com/channel/UCoj4eQh_dZR37lL78ymC6XA</a></p> <p>Talk</p> <p>Did A happen before B? This might seem like a question that must have an obvious answer for any two events you could pick — but it's harder than it looks, and it vexed physicists for decades. Now it's computer science's turn to be annoyed!</p> <p>One approach to this question was posed in 1978 by Leslie Lamport. In this talk, we'll explore how Time, Clocks, and the Ordering of Events in a Distributed System seeks to provide an answer to causality for distributed events — and why it's sometimes complicated.</p> <p>Bio</p> <p>John Feminella is an avid technologist, occasional public speaker, and curiosity advocate. He serves as a technical leader for ThoughtWorks, where he works on helping enterprises transform the way they write, operate, and deploy software. He also serves on the board of Forge and Brightbits, two organizations focused on giving superpowers to aspiring technologists and business leaders.</p> <p>John lives in Charlottesville, VA and likes meta-jokes, milkshakes, and referring to himself in the third person in speaker bios.</p> <p>Details</p> <p>The talk will be streamed for free on PWLNYC's twitch channel:<br/><a href=\"https://www.twitch.tv/paperswelove\" class=\"linkified\">https://www.twitch.tv/paperswelove</a></p> <p>***<br/>PLEASE NOTE: Even though this is a remote event, the Papers We Love code of conduct is still in effect in any chats or forums associated with the meetup. Breaching the CoC is grounds to be ejected from the meetup at the organizers' discretion.<br/>***</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[],"time":1608076800000,"title":"John Feminella on Lamport's Ordering of Events in a Distributed System","url":"https://www.meetup.com/papers-we-love/events/274304502/","utcOffset":-18000000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"275872506":{"description":"<p>Welcome to Papers We Love NYC's third remote meetup!</p> <p>Last time, John got cut short because of a power outage during a storm, so we're going to try again! Details are the same, but here they are again:</p> <p>We're happy to once again host John Feminella (<a href=\"http://jxf.me/\" class=\"linkified\">http://jxf.me/</a>), technologist and advisor, presenting on Time, Clocks and the Ordering of Events in a Distributed System by Leslie Lamport (<a href=\"https://lamport.azurewebsites.net/pubs/pubs.html#time-clocks\" class=\"linkified\">https://lamport.azurewebsites.net/pubs/pubs.html#time-clocks</a>)</p> <p>The talk will be streamed for free on PWLNYC's twitch channel:<br/><a href=\"https://www.twitch.tv/paperswelove\" class=\"linkified\">https://www.twitch.tv/paperswelove</a>, and uploaded to the PWL YouTube channel afterward: <a href=\"https://www.youtube.com/channel/UCoj4eQh_dZR37lL78ymC6XA\" class=\"embedded\">https://www.youtube.com/channel/UCoj4eQh_dZR37lL78ymC6XA</a></p> <p>Talk</p> <p>Did A happen before B? This might seem like a question that must have an obvious answer for any two events you could pick — but it's harder than it looks, and it vexed physicists for decades. Now it's computer science's turn to be annoyed!</p> <p>One approach to this question was posed in 1978 by Leslie Lamport. In this talk, we'll explore how Time, Clocks, and the Ordering of Events in a Distributed System seeks to provide an answer to causality for distributed events — and why it's sometimes complicated.</p> <p>Bio</p> <p>John Feminella is an avid technologist, occasional public speaker, and curiosity advocate. He serves as a technical leader for ThoughtWorks, where he works on helping enterprises transform the way they write, operate, and deploy software. He also serves on the board of Forge and Brightbits, two organizations focused on giving superpowers to aspiring technologists and business leaders.</p> <p>John lives in Charlottesville, VA and likes meta-jokes, milkshakes, and referring to himself in the third person in speaker bios.</p> <p>Details</p> <p>The talk will be streamed for free on PWLNYC's twitch channel:<br/><a href=\"https://www.twitch.tv/paperswelove\" class=\"linkified\">https://www.twitch.tv/paperswelove</a></p> <p>***<br/>PLEASE NOTE: Even though this is a remote event, the Papers We Love code of conduct is still in effect in any chats or forums associated with the meetup. Breaching the CoC is grounds to be ejected from the meetup at the organizers' discretion.<br/>***</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[],"time":1611792000000,"title":"John Feminella on Lamport's Ordering of Events in a Distributed System (Take 2)","url":"https://www.meetup.com/papers-we-love/events/275872506/","utcOffset":-18000000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"278148177":{"description":"<p>Welcome to Papers We Love NYC's next remote meetup!</p> <p>We're happy to host Michael Pigott presenting Toward a Generic Fault Tolerance Technique for Partial Network Partitioning by Mohammed Alfatafta, Basil Alkhatib, Ahmed Alquraan, and Samer Al-Kiswany, University of Waterloo, Canada (<a href=\"https://www.usenix.org/conference/osdi20/presentation/alfatafta\" class=\"linkified\">https://www.usenix.org/conference/osdi20/presentation/alfatafta</a>)</p> <p>The talk will be streamed for free on PWLNYC's twitch channel<br/>(<a href=\"https://www.twitch.tv/paperswelove\" class=\"linkified\">https://www.twitch.tv/paperswelove</a>) and uploaded to the PWL YouTube channel afterward (<a href=\"https://www.youtube.com/channel/UCoj4eQh_dZR37lL78ymC6XA\" class=\"embedded\">https://www.youtube.com/channel/UCoj4eQh_dZR37lL78ymC6XA</a>)</p> <p>Talk</p> <p>\"When the network partitions, it partitions completely.\" While this is not a direct quote, nearly all distributed systems today assume that if a network partitions, the nodes in the network are separated completely, and nodes on one side of the partition cannot communicate with nodes on the other side of the partition. The authors behind \"Toward a Generic Fault Tolerance Technique for Partial Network Partitioning\" find this assumption to be inadequate, to catastrophic results. The paper presents a network communication layer which can detect partial network partitions, and re-route traffic so the entire system can remain available.</p> <p>Bio</p> <p>I'm a student earning his master's degree in computer science at University of Illinois. I’ve been a professional software developer for over 15 years. I currently work on a microservices architecture in Go to offer online lending in the buy-now-pay-later space.</p> <p>Details</p> <p>The talk will be streamed for free on PWLNYC's twitch channel:<br/>(<a href=\"https://www.twitch.tv/paperswelove\" class=\"linkified\">https://www.twitch.tv/paperswelove</a>)</p> <p>***<br/>PLEASE NOTE: Even though this is a remote event, the Papers We Love code of conduct is still in effect in any chats or forums associated with the meetup. Breaching the CoC is grounds to be ejected from the meetup at the organizers' discretion.<br/>***</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[],"time":1621897200000,"title":"Michael Pigott on Toward a Generic Fault Tolerance Technique","url":"https://www.meetup.com/papers-we-love/events/278148177/","utcOffset":-14400000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"278148236":{"description":"<p>Welcome to Papers We Love NYC's next remote meetup!</p> <p>We're happy to host Jake Moshenko, CEO of Authzed, presenting on Zanzibar: Google’s Consistent, Global Authorization System (<a href=\"https://research.google/pubs/pub48190/\" class=\"linkified\">https://research.google/pubs/pub48190/</a>)</p> <p>The talk will be streamed for free on PWLNYC's twitch channel:<br/><a href=\"https://www.twitch.tv/paperswelove\" class=\"linkified\">https://www.twitch.tv/paperswelove</a>, and uploaded to the PWL YouTube channel afterward: <a href=\"https://www.youtube.com/channel/UCoj4eQh_dZR37lL78ymC6XA\" class=\"embedded\">https://www.youtube.com/channel/UCoj4eQh_dZR37lL78ymC6XA</a></p> <p>Abstract</p> <p>In this talk, Authzed’s CEO Jake Moshenko, will talk about what makes Zanzibar a paper worthy of dropping everything and forming a company around. Zanzibar is the singular global-scale authorization service that powers permissions and sharing across all Google properties, including Docs, YouTube, and Cloud IAM. The talk will cover how the paper lays out an engineer-friendly blueprint for building a highly scalable distributed system with flexible consistency guarantees. The talk will also cover details of some of the known existing implementations, and how and why they have deviated from the paper.</p> <p>Bio</p> <p>Jake Moshenko is an engineering leader that has been building infrastructure tools and services for over 15 years for large companies and startups alike. Having previously struggled to keep up with customer permissions demands on products such as CoreOS’s Quay and Tectonic, he was searching for a better way to do application permissions.</p> <p>Details</p> <p>The talk will be streamed for free on PWLNYC's twitch channel:<br/><a href=\"https://www.twitch.tv/paperswelove\" class=\"linkified\">https://www.twitch.tv/paperswelove</a></p> <p>***<br/>PLEASE NOTE: Even though this is a remote event, the Papers We Love code of conduct is still in effect in any chats or forums associated with the meetup. Breaching the CoC is grounds to be ejected from the meetup at the organizers' discretion.<br/>***</p> <p>We hope that you'll read some of the papers and references before the meetup, but don't stress if you can't. If you have any questions, thoughts, or related information, please visit #pwlnyc (<a href=\"https://paperswelove.slack.com/messages/pwlnyc/\" class=\"linkified\">https://paperswelove.slack.com/messages/pwlnyc/</a>) on slack (<a href=\"http://papersweloveslack.herokuapp.com/\" class=\"linkified\">http://papersweloveslack.herokuapp.com/</a>), our GitHub repository (<a href=\"https://github.com/papers-we-love/papers-we-love\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love</a>), or add to the discussion on this event's thread.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a pull request (<a href=\"https://github.com/papers-we-love/papers-we-love/pulls\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/pulls</a>). Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[],"time":1624921200000,"title":"Jake Moshenko on Zanzibar: Google’s Consistent, Global Authorization System","url":"https://www.meetup.com/papers-we-love/events/278148236/","utcOffset":-14400000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}}}