{"258480974":{"url":"https://www.meetup.com/Papers-We-Love-Philadelphia/events/258480974/","description":"<p>As software becomes more and more integrated in our daily lives, we<br/>need, more than ever, for the software we write to work reliably in a<br/>wide range of conditions--even, and especially, in unexpected<br/>conditions. This paper, written by Robert Rasmussen from the Jet<br/>Propulsion Laboratory, documents and explains some fundamental<br/>principles about designing fault tolerant systems as learned through<br/>the hard-won experience of designing Guidance, Navigation, and Control<br/>(GN&amp;C) systems for spacecraft. This paper is rich in principles,<br/>examples, and advice, and has a lot to offer to our industry<br/>generally--even if we don't actively work on software for spaceships!</p> <p>Link to paper: <a href=\"https://trs.jpl.nasa.gov/bitstream/handle/2014/41696/08-0125.pdf?sequence=1\" class=\"linkified\">https://trs.jpl.nasa.gov/bitstream/handle/2014/41696/08-0125.pdf?sequence=1</a><br/>Presenter: Jon Moore - <a href=\"https://twitter.com/jon_moore\" class=\"linkified\">https://twitter.com/jon_moore</a></p> ","photos":[],"venue":{"lat":39.9549674987793,"address1":"1701 John F Kennedy Blvd","address2":null,"name":"Comcast Center","postalCode":"19103","lon":-75.16844940185547,"country":"us","city":"Philadelphia"},"utcOffset":-14400000,"time":1553032800000,"title":"Fault Protection Fundamentals"},"gghkrlyvgbzb":{"url":"https://www.meetup.com/Papers-We-Love-Philadelphia/events/gghkrlyvgbzb/","description":"<p><b>Harvest, Yield, and Scalable Tolerant Systems</b> and <b>Cluster-Based Scalable Network Services</b></p> <p>Talk Abstract:</p> <p>The CAP theorem is one of the defining blocks of how we talk about and build distributed systems. We use its tenets to understand how a system is going to behave in the case of failure and what kind of measures we can take to prevent or alleviate them. We'll learn how it came to be and why it's still so important today, especially when dealing with servers and services in the cloud.</p> <p><b>This lecture will not assume any background in distributed systems research from the audience. </b></p> <p>Food and drinks will be available at 6:30PM and the talk will start at 7PM.</p> <p>Harvest, Yield, and Scalable Tolerant Systems paper: <a href=\"https://www.dropbox.com/s/l5vloba3msvt3s4/harvest-yield-fault-tolerant-systems.pdf?dl=0\"><a href=\"https://www.dropbox.com/s/l5vloba3msvt3s4/harvest-yield-fault-tolerant-systems.pdf?dl=0\" class=\"linkified\">https://www.dropbox.com/s/l5vloba3msvt3s4/harvest-yield-fault-tolerant-systems.pdf?dl=0</a></a></p> <p>Cluster-Based Scalable Network Services paper: <a href=\"https://www.dropbox.com/s/ceigowr09ykfhp7/cluster-based-scalable-network-services.pdf?dl=0\"><a href=\"https://www.dropbox.com/s/ceigowr09ykfhp7/cluster-based-scalable-network-services.pdf?dl=0\" class=\"linkified\">https://www.dropbox.com/s/ceigowr09ykfhp7/cluster-based-scalable-network-services.pdf?dl=0</a></a></p> <p><a href=\"https://mauricio.github.io/\"><b>Maurício Linhares</b></a> is a technical lead at <a href=\"http://www.neat.com/\">Neat.com</a> working on scaling the company in the cloud. He's interested in programming languages, functional programming, distributed systems and machine learning. Just recently moved to Philadelphia from the northwestern coast in Brazil and enjoying it a lot.</p> <p><b>Food and drinks sponsored by Chariot Solutions:</b></p> <p>Chariot Solutions is passionate about technology. We work with a wide variety of technologies, and solve an even wider variety of problems.  We value learning, working with the best people and delivering great products for our customers.  And we are hiring. <a href=\"http://chariotsolutions.com/\">chariotsolutions.com</a> </p> <p>All attendees are expected to follow the Papers We Love <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a>&lt;a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\"&gt;&lt;/a&gt;.</p> ","photos":[],"venue":{"lat":39.95075988769531,"address1":"1211 Chestnut Street Suite 400","address2":null,"name":"PromptWorks","postalCode":"","lon":-75.16071319580078,"country":"us","city":"Philadelphia"},"utcOffset":-14400000,"time":1461105000000,"title":"Maurício Linhares on \"Harvest, Yield and Scalable Tolerant Systems”"},"222479138":{"url":"https://www.meetup.com/Papers-We-Love-Philadelphia/events/222479138/","description":"<p>Link to the paper: <a href=\"http://research.microsoft.com/en-us/um/people/srikanth/netdb11/netdb11papers/netdb11-final12.pdf\"><a href=\"http://research.microsoft.com/en-us/um/people/srikanth/netdb11/netdb11papers/netdb11-final12.pdf\" class=\"linkified\">http://research.microsoft.com/en-us/um/people/srikanth/netdb11/netdb11papers/netdb11-final12.pdf</a></a></p> <p>Thanks to PromptWorks for hosting, and Comcast for the food!</p> ","photos":[],"venue":{"lat":39.95075988769531,"address1":"1211 Chestnut Street Suite 400","address2":null,"name":"PromptWorks","postalCode":"","lon":-75.16071319580078,"country":"us","city":"Philadelphia"},"utcOffset":-14400000,"time":1436308200000,"title":"Toby DiPasquale on Kafka: a Distributed Messaging System for Log Processing"},"260670005":{"url":"https://www.meetup.com/Papers-We-Love-Philadelphia/events/260670005/","description":"<p>Info about the venue:</p> <p>* check in at the front desk<br/>* meeting will be on the 18th floor<br/>* doors lock at six, so go around to the back of the building if you arrive late, and security will let you in.</p> <p>Paper Title:</p> <p>Márk Jelasity, Rachid Guerraoui, Anne-Marie Kermarrec, and Maarten Van Steen. \"The peer sampling service: Experimental evaluation of unstructured gossip-based implementations.\" In ACM/IFIP/USENIX International Conference on Distributed Systems Platforms and Open Distributed Processing, pp. 79-98. Springer, Berlin, Heidelberg, 2004.</p> <p>Paper Link:<br/><a href=\"http://www.inf.u-szeged.hu/~jelasity/cikkek/middleware04.pdf\" class=\"linkified\">http://www.inf.u-szeged.hu/~jelasity/cikkek/middleware04.pdf</a></p> <p>Talk Abstract:<br/>Self-organizing algorithms enable the design of fully decentralized computing systems with useful properties that emulate those found in nature, such as adapting to changing conditions or self-healing when damaged. Many metaphor-driven models have been built in this space, drawing inspiration from fields such as biology, physics, chemistry, ecology, economics, social system.</p> <p>A simple example of a self-organizing mechanism applied to distributed systems can be found in \"gossip protocols\", which use dynamics inspired by observations of the spread of information through social networks. As such, they serve as a useful entry point to thinking about self-organization as a tool for designing real-world computing systems. Gossip protocols are also useful in their own right, and are used by NoSQL databases such as Cassandra and blockchain implementations such as Bitcoin and Ethereum.</p> <p>In this session, we'll take a look at the design and implementation of Newcast gossip protocol, which is described in a number of papers. The selected paper discusses applying Newscast to the problem of peer sampling, which ensures that every participant in a leaderless network has a fresh selection of other peers with whom to exchange information.</p> ","photos":[],"venue":{"lat":39.953609466552734,"address1":"1600 John F Kennedy Blvd","address2":null,"name":"1600 John F Kennedy Blvd","postalCode":"19103","lon":-75.16706848144531,"country":"us","city":"Philadelphia"},"utcOffset":-14400000,"time":1559685600000,"title":"Talk Amongst Yourselves: Gossip as an Introduction to Self-Organizing Algorithms"},"222735322":{"url":"https://www.meetup.com/Papers-We-Love-Philadelphia/events/222735322/","description":"<p><b>From System F to Typed Assembly Language </b></p> <p>by Greg Morrisett, David Walker, Karl Crary and Neal Glew</p> <p>Abstract:</p> <p>We motivate the design of a typed assembly language (TAL) and present a type-preserving translation from System F to TAL. The typed assembly language we present is based on a conventional RISC assembly language, but its static type system provides support for enforcing high-level language abstractions, such as closures, tuples, and user-defined abstract data types. The type system ensures that well-typed programs cannot violate these abstractions. In addition, the typing constructs admit many low-level compiler optimizations. Our translation to TAL is specified as a sequence of type-preserving transformations, including CPS and closure conversion phases; type-correct source programs are mapped to type-correct assembly language. A key contribution is an approach to polymorphic closure conversion that is considerably simpler than previous work. The compiler and typed assembly language provide a fully automatic way to produce certified code, suitable for use in systems where untrusted and potentially malicious code must be checked for safety before execution.</p> <p><b>Even though it is a technical paper, the lecture will not assume any background in programming language research or type systems from the audience.</b></p> <p>Paper: <a href=\"https://www.cs.princeton.edu/~dpw/papers/tal-toplas.pdf\"><a href=\"https://www.cs.princeton.edu/~dpw/papers/tal-toplas.pdf\" class=\"linkified\">https://www.cs.princeton.edu/~dpw/papers/tal-toplas.pdf</a></a></p> <p><b><a href=\"http://www.cis.upenn.edu/~sweirich/\">Stephanie Weirich</a> is a Professor of <a href=\"http://www.cis.upenn.edu/\">Computer and Information Science</a> at the University of Pennsylvania.</b></p> <p>Food and drinks will be available at 6:30PM and the talk will start at 7PM.</p> <p><b>Directions</b>: </p> <p>Unfortunately, getting to the Greenberg Lounge can be tricky. There are two ways to get there:</p> <p>1. Most dependable: Levine Hall entrance. This seems to be the entrance closest to Greenberg Lounge that won't be locked. Enter “3300 Chancellor St, Philadelphia, PA 19104” into Google Maps and enter through this <a href=\"https://upload.wikimedia.org/wikipedia/commons/6/68/Levine_Hall_(University_of_Pennsylvania)_-_IMG_6634.JPG\">entrance</a>. Go straight, through the door that goes to the courtyard. Walk up the steps until you reach this <a href=\"http://www.cis.upenn.edu/~dfaced/directions/cafe_03a.png\">door</a>. Then go straight and make a right. The lounge will then be on your right.</p> <p>2. Closer but will be locked after 7PM: Skirkanich Entrance on S 33rd St. This <a href=\"https://c2.staticflickr.com/4/3411/3278952033_1828f2ce1d.jpg\">entrance</a> will be easier to find. I'll be there to let people in until 7PM when the talk will start. <br/>If anyone has trouble getting to Greenberg Lounge, please post on the meetup page. I'll be checking it frequently.</p> <p><b>Food and drinks sponsored by Chariot Solutions:</b></p> <p>Chariot Solutions is passionate about technology. We work with a wide variety of technologies, and solve an even wider variety of problems.  We value learning, working with the best people and delivering great products for our customers.  And we are hiring. <a href=\"http://chariotsolutions.com/\">chariotsolutions.com</a></p> ","photos":[],"venue":{"lat":39.952064514160156,"address1":"Room 114, Skirkanich Hall, South 33rd Street","address2":null,"name":"Greenberg Lounge","postalCode":"","lon":-75.19061279296875,"country":"us","city":"Philadelphia"},"utcOffset":-14400000,"time":1444170600000,"title":"Stephanie Weirich on From System F to Typed Assembly Language"},"252510571":{"url":"https://www.meetup.com/Papers-We-Love-Philadelphia/events/252510571/","description":"<p>Title:<br/>Scaling Visual Search with Locally Optimized Product Quantization</p> <p>Paper:<br/>Locally Optimized Product Quantization for Approximate Nearest Neighbor Search.<br/>Yannis Kalantidis and Yannis Avrithi.<br/>2014 IEEE Conference on Computer Vision and Pattern Recognition (CVPR), June 2014.</p> <p>Paper: <a href=\"http://image.ntua.gr/iva/files/lopq.pdf\" class=\"linkified\">http://image.ntua.gr/iva/files/lopq.pdf</a></p> <p>Talk Abstract:</p> <p>Approximate nearest neighbor (ANN) search is an essential technique for big data applications, and has only become more relevant as the scale of our data has increased dramatically in the past decade. At Curalate, we use ANN to power our visual search technology that enables our clients to identitfy apparel products in user-generated photos from social networks.</p> <p>Kalantidis and Avrithi present an extremely fast and accurate ANN algorithm in their paper \"Locally Optimized Product Quantization for Approximate Nearest Neighbor Search\" (LOPQ). Their key contribution is a quantization method that minimizes distortion by leveraging Principle Component Analysis on small sub-vectors of the data. This technique enables fast and accurate searching over data sets of millions or even billions of items.</p> <p>In this talk, I will present the LOPQ paper by Kalantidis and Avrithi, and follow it with a deep dive into how we have implemented it at Curalate to power our visual search technology. By leveraging LOPQ, we reduced our storage requirements by 90% allowing us to store an index of 31 million images in 1GB of RAM and search it in a only few hundred milliseconds.</p> <p>About the Speaker:</p> <p>Lou Kratz is a Research Engineer at Curalate, a Philadelphia-based startup that leverages social content to help their clients to sell more effectively online. He received his PhD in computer vision from Drexel University in 2012, and then got bit by the start-up bug in the best way. His passions include computer vision, machine learning, video analysis, and brewing beer when he can find the time.</p> <p>This lecture will not assume any background in product quantization or approximate nearest neighbor search.</p> <p>Directions:<br/>When you arrive at 1900 Market St., present a valid photo ID to the security desk in the lobby. We will be located on the 8th floor. Once you exit the elevators on the 8th floor the entrance is very clear.</p> <p>Food and drinks will be available at 6:30PM and the talk will start at 7PM.</p> <p>Pizza and soft drinks will be provided by Curalate (<a href=\"https://www.curalate.com/\" class=\"linkified\">https://www.curalate.com/</a>).</p> <p>All attendees are expected to follow the Papers We Love Code of Conduct (<a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md</a>).</p> <p>WeWork Blurb: WeWork is a community for creators. We transform buildings into beautiful, collaborative workspaces and provide the infrastructure, services, events and technology so our members can focus on doing what they love. WeWork currently has 111 locations in 29 cities across the world with over 70,000 members. Book a tour at wework.com now!</p> ","photos":[],"venue":{"lat":39.95310974121094,"address1":"1900 Market Street","address2":null,"name":"WeWork 1900 Market St","postalCode":null,"lon":-75.17245483398438,"country":"US","city":"Philadelphia"},"utcOffset":-14400000,"time":1533853800000,"title":" Lou Kratz on Scaling Visual Search with Locally Optimized Product Quantization"}}