{"ctkphpyxdbdc":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/247544576/","description":"<p>Hello everyone!</p> <p>We are delighted to tell you that we are kicking off the first Papers We Love @ Porto. Our goal is to help bridge the gap between Porto industry and academics: membership of both types are very welcome; and to dive deep into interesting programming topics.</p> <p>For the first ever Papers We Love in Portugal, we'll be hosting Alvaro Videla (<a href=\"https://twitter.com/old_sound\" class=\"linkified\">https://twitter.com/old_sound</a>), Co-Author of the book \"RabbitMQ in Action\" and Former RabbitMQ Core Developer and José Marcelino (<a href=\"https://www.linkedin.com/in/josemarcelino1\" class=\"linkified\">https://www.linkedin.com/in/josemarcelino1</a>), Data Scientist at Farfetch.</p> <p>--</p> <p>&amp;gt; Harmful GOTOs, Premature Optimizations and Programming Myths are The Root of All Evil</p> <p>Over the years our industry has accumulated folklore that shapes what we are as an industry. We repeat maxims like \"Premature optimisation is the root of all evil\" but perhaps ignoring the context on which that sentence was said. This ignorance has lead us to creating myths that sometimes do more harm than good.</p> <p>In this talk I will review some of those myths, see their origin and at the same time make a historical review of what was going on in our industry in the '70s, when those myths appeared.</p> <p>As the old saying goes: Those who cannot remember the past are condemned to repeat it</p> <p>&amp;gt; Talk objectives:</p> <p>- Promote a culture of reading more books, academic papers and related material that refers to the history of our field and programming in general.</p> <p>&amp;gt; Talk audience:</p> <p>- From beginners to experts. No special knowledge is required to attend the talk.</p> <p>Bio</p> <p>Alvaro Videla used to work as a Core Developer for RabbitMQ and co-authored the book \"RabbitMQ in Action\" for Manning Publishing. Before moving to Europe, Alvaro worked in Shanghai building one of Germany's largest dating websites. Some of his open source projects can be found here: <a href=\"http://github.com/videlalvaro\" class=\"linkified\">http://github.com/videlalvaro</a>. Besides code related stuff he likes traveling with his wife, listening/playing music and reading books.</p> <p>--</p> <p>&amp;gt; All Aboard the Natural Language Processing Train</p> <p>From the depts of intuition to practice, José Marcelino will guide us throw the valley of Natural Language Processing field.</p> <p>Sequence labeling tasks, such as Part-of-Speech Tagging or Named Entity Recognition, represents a crucial step to understand language. Step by step, we will review Xuezhe Ma and Eduard Hovy approach (<a href=\"https://arxiv.org/pdf/1603.01354.pdf\" class=\"linkified\">https://arxiv.org/pdf/1603.01354.pdf</a>) to address the problem. We will examine each decision and explain how can we mount a similar solution in a practical approach.</p> <p>Bio</p> <p>José Marcelino is a Data Scientist at Farfetch while completing his Master Thesis in Natural Language Processing at the University of Coimbra.</p> <p>--</p> <p>Details</p> <p>Doors will open around 18:30 and presentations will start after a quick introduction of the meetup, around 19:00.</p> <p>After each presentation, we will open up the floor for discussion, questions and drinks!</p> <p>Hope to see you soon!</p> <p>--</p> <p>Remember that we strictly adhere to the Code of Conduct (<a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md</a>) set forth by all PWL charters.</p> <p>If you want to present a paper either in a full or lightning-talk format, feel free to reach @ordepdev or submit the CFP form (<a href=\"https://docs.google.com/forms/d/1OfwO8XlESmka1uWB_HczuCjsy__o8ORdqEEKBmGXQxA\" class=\"linkified\">https://docs.google.com/forms/d/1OfwO8XlESmka1uWB_HczuCjsy__o8ORdqEEKBmGXQxA</a>).</p> <p>Make sure that you join us on Slack through <a href=\"https://pwlporto.slack.com/\" class=\"linkified\">https://pwlporto.slack.com/</a> or <a href=\"https://pwlporto.herokuapp.com/\" class=\"linkified\">https://pwlporto.herokuapp.com/</a> and follow us on Twitter (<a href=\"https://twitter.com/pwlporto\" class=\"linkified\">https://twitter.com/pwlporto</a>).</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/1/d/0/c/600_468847436.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/1/d/0/f/600_468847439.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/1/d/1/1/600_468847441.jpeg","height":null,"width":null}],"venue":{"lat":41.215335845947266,"address1":"Rua da Lionesa nº 446, Edifício G12, 4465-671 Leça do Balio","address2":null,"name":"Farfetch","postalCode":null,"lon":-8.62398624420166,"country":"pt","city":"Porto"},"utcOffset":0,"time":1519326000000,"title":"PWL #01 :: Hello Porto!"},"248379987":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/248379987/","description":"<p>Hello everyone!</p> <p>We are delighted to tell you that we'll have our second Papers We Love @ Porto at UPTEC. This time we'll host Carlos Baquero (<a href=\"https://twitter.com/xmal\" class=\"linkified\">https://twitter.com/xmal</a>) and Michael Domingues (<a href=\"https://www.linkedin.com/in/michaelapdomingues\" class=\"linkified\">https://www.linkedin.com/in/michaelapdomingues</a>).</p> <p>Talks</p> <p>&amp;gt; Performance testing of open-source HTTP web frameworks in an API</p> <p>Upon each day there are more and more services running on the web and we are trying to make to most out of them. These Web Applications (WAs) represent thousands of type of services we can interact with like weather forecast and Application Programming Interface (API) which use by themselves other WAs. API provides at a certain authorization level access to multi-source data using several request endpoints in a multi-tier architecture where performance is critical and it must be ensured the best throughput, response time and availability. This study presents the implementation of three open-source web frameworks (Revel, Gin and Echo) in a corporate API developed by Movvo® in order to evaluate the overall architecture using Apache Benchmark as a load testing tool. Results show Gin contributed to the fastest response times for a set of requests that vary on processing and retrieved data complexity.</p> <p>&amp;gt; Causality is simple</p> <p>Causality is an essential component of how we make sense of the physical world, and of our relations to other humans. If I put a cup on the table, and look back at it, I expect it to be there. I also expect to get a reply to my postcards, after I send them, and not before. These days hardly any service can claim not to have some form of distributed algorithm at its core. In a distributed scenario, if we are not careful, it is very easy to break the causal sense of things. In a key-value store my writes can be directed to a replica, and my subsequent reads served from an outdated one --- my cup might not be there when I look back. Message dissemination middleware might not always provide the ordering I expect --- I might receive some replies, before their leading questions.</p> <p>Luckily, most of these problems were already there 30 years ago, although in a much smaller scale, and lots of techniques have been developed to keep track of causality and make sense of the complex interactions in modern systems. However developers often look at techniques such as as replica synchronization with version vectors, or causal broadcasting algorithms, as black boxes; or as complex sets of rules that have to be followed and not questioned.</p> <p>This talk will focus on bringing back the intuition on causality, and show that keeping in mind some simple concepts, allows to understand how version vectors and vector clocks work, and were they differ, and how to use more sophisticated mechanisms to handle millions of concurrent clients in modern distributed data stores.</p> <p>Bio</p> <p>Carlos Baquero is an Assistant Professor and teaches Distributed Systems at Universidade do Minho, Portugal. He is a Senior Researcher at the High Assurance Laboratory within INESC TEC. In the 90s, motivated by mobile computing and disconnected operation for file systems, he studied data types with merge (and fork) operations over semi-lattices, a precursor to state-based CRDTs. He is also interested in causality and in distributed aggregation algorithms. He specially likes all things distributed that eventually merge.</p> <p>Details</p> <p>Doors will open around 18:30 and presentations will start after a quick introduction of the meetup, around 19:00.</p> <p>After each presentation, we will open up the floor for discussion, questions and drinks!</p> <p>This meetup will be sponsored by XING.</p> <p>Hope to see you soon!</p> <p>--</p> <p>If you want to present a paper either in a full or lightning-talk format, feel free to reach @ordepdev or submit the CFP form (<a href=\"https://docs.google.com/forms/d/1OfwO8XlESmka1uWB_HczuCjsy__o8ORdqEEKBmGXQxA\" class=\"linkified\">https://docs.google.com/forms/d/1OfwO8XlESmka1uWB_HczuCjsy__o8ORdqEEKBmGXQxA</a>).</p> ","photos":[],"venue":{"lat":41.17802429199219,"address1":"461 Rua Alfredo Allen","address2":null,"name":"UPTEC - Polo Tecnológico","postalCode":null,"lon":-8.605775833129883,"country":"pt","city":"Porto"},"utcOffset":0,"time":1521745200000,"title":"March :: Papers We Love #02"}}