{"cmmfnqyzdbzb":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/cmmfnqyzdbzb/","description":"<p>Hello everyone 👋</p> <p>The 9th session of Papers We Love @ Porto will be hosted by Feedzai and we're super happy to have Joāo Fernandes (<a href=\"https://bit.ly/2m9ocSe\" class=\"linkified\">https://bit.ly/2m9ocSe</a>) talking about another great scientific topic!</p> <p>Agenda<br/>19:20 👋 Meet &amp; Greet<br/>19:30 🎙 Introduction<br/>19:40 📜 Deep Residual Learning for Image Recognition<br/>20:20 🍕 Networking<br/>20:30 👏 Wrap-up</p> <p>Talk</p> <p>📜 Deep Residual Learning for Image Recognition</p> <p>Deep neural networks have shown high performance on image classification tasks. However, due to its complexity, it usually takes a long time and a lot of computational resources to train deeper neural networks. Deep Residual networks (ResNets), can make the training process easier, faster and even allow to build deeper networks. In this presentation we will take a look on how ResNets work and the breakthroughs they allowed to make in the world of computer vision.</p> <p>Details</p> <p>Doors will open around 18:30 and we'll start the talk after a quick introduction of the meetup, around 19:00. After the networking we can grab dinner nearby!</p> <p>Hope to see you soon 🎉</p> ","photos":[],"venue":{"lat":41.15078353881836,"address1":"Rua de Santos Pousada 228","address2":null,"name":"Feedzai - Porto Office","postalCode":null,"lon":-8.60006332397461,"country":"pt","city":"Porto"},"utcOffset":0,"time":1551295800000,"title":"PWL #09 :: Deep Residual Learning for Image Recognition"},"248727184":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/248727184/","description":"<p>Hello everyone!</p> <p>This month we're going to Braga! Our fourth edition will be hosted by Subvisual (<a href=\"https://subvisual.co\" class=\"linkified\">https://subvisual.co</a>) and Fernando Mendes (<a href=\"https://twitter.com/fribmendes\" class=\"linkified\">https://twitter.com/fribmendes</a>) with talk about \"Knee Deep Into P2P\".</p> <p>Abstract</p> <p>What happens when you don't like centralized things? You do P2P! I created a distributed smart office using Elixir that runs in a single P2P network. There are a lot of subtleties into this. How can we prevent someone from entering the network? How do we manage shared data? What topology do we use? How about nodes that are unrealiable and we are not sure when they will connect or disconnect? What if YOU want to add a node and we can't trust you to deliver messages? I will use the office as an example and teach you how different the reasoning between a web-like centralised context and a P2P distributed system is. We will go from simple P2P topologies (gossip, trees) to more complex ones (Gnutella2, HyParView, Plumtrees), analyse their problems and take a look at what CRDTs are and how awesome they can be for shared data.</p> <p>Bio</p> <p>Mendes exchanges coffee for code. He has a background in Distributed Systems and Cryptography, having won multiple national awards for academic excellence. He also does a lot of volunteering, being the founder of #include &lt;braga&gt; and the champion of CoderDojo Braga.</p> <p>Hope to see you soon!</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/b/d/c/7/600_471468583.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/b/d/c/d/600_471468589.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/b/d/d/7/600_471468599.jpeg","height":null,"width":null}],"venue":{"lat":41.543094635009766,"address1":"Polo de Negócios de Braga, Avenida D. JOAO II 404, 4º andar, Sala 45, 4715-275","address2":null,"name":"Subvisual","postalCode":null,"lon":-8.399553298950195,"country":"pt","city":"Braga"},"utcOffset":3600000,"time":1527098400000,"title":"PWL #04 :: Knee Deep Into P2P"},"248728411":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/248728411/","description":"<p>Hello everyone!</p> <p>We are delighted to tell you that we'll have our third Papers We Love @ Porto at Porto i/o Riverside.</p> <p>Talks</p> <p>&amp;gt; Things you should know about Database Storage and Retrieval ~ Pedro Tavares (<a href=\"https://twitter.com/ordepdev\" class=\"linkified\">https://twitter.com/ordepdev</a>)</p> <p>On the most fundamental level, a database needs to do two things: when you give it some data, it should store the data, and when you ask it again later, it should give the data back to you.</p> <p>Why should you, as an application developer, care how the database handles storage and retrieval internally? In order to select the storage engine that is appropriate for your application, you need to have a rough idea of what the storage engine is doing under the hood.</p> <p>In this talk, we’ll discuss and examine some core data structures such as Hash Indexes, SSTables, LSM-Trees, and B-Trees, that are used in the traditional relational databases and NoSQL databases.</p> <p>Details</p> <p>Doors will open around 19:00 and presentations will start after a quick introduction.</p> <p>After the presentation, we will open up the floor for questions and discussions.</p> <p>Hope to see you soon!</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/2/4/b/4/600_470769396.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/2/4/b/6/600_470769398.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/2/4/b/9/600_470769401.jpeg","height":null,"width":null}],"venue":{"lat":41.140865325927734,"address1":"Rua do Infante D. Henrique 73","address2":"4º Piso","name":"Porto i/o Riverside","postalCode":null,"lon":-8.614784240722656,"country":"pt","city":"Porto"},"utcOffset":3600000,"time":1524592800000,"title":"PWL #03 :: Things you should know about Database Storage and Retrieval"},"250979703":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/250979703/","description":"<p>Hello everyone, we're back to Porto!</p> <p>Our fifth session will be hosted by Veniam (<a href=\"https://veniam.com\" class=\"linkified\">https://veniam.com</a>) and we have two amazing talks for you. We're super happy to have both Daniel Moura (<a href=\"https://www.linkedin.com/in/dmoura\" class=\"linkified\">https://www.linkedin.com/in/dmoura</a>), and Hugo Peixoto (<a href=\"https://www.linkedin.com/in/hugopeixoto\" class=\"linkified\">https://www.linkedin.com/in/hugopeixoto</a>) talking about two great scientific topics!</p> <p>Talk 1: Visualising graphs with millions of edges using edge bundling by Daniel Moura</p> <p>Three years ago, when trying to visualize flows of people in cities, I came across a family of algorithms that was new to me: edge bundling algorithms. Edge bundling is based on visually clustering edges and, at that time, the main focus was on bundling together edges based on their spatial proximity. After reading several papers on the subject, \"Graph Bundling by Kernel Density Estimation” (<a href=\"http://www.cs.rug.nl/~alext/PAPERS/EuroVis12/kdeeb.pdf\" class=\"linkified\">http://www.cs.rug.nl/~alext/PAPERS/EuroVis12/kdeeb.pdf</a>) was the one that inspired me the most due to its simplicity and potential to handle large graphs.</p> <p>In this sessions of paper we love, I will explain you the rationale of graph bundling based on kernel density estimation, propose simplifications that make the algorithm more efficient and easier to implement, and show how the base algorithm can be extend to handle different clustering criteria and to produce videos of evolving graphs. Finally, I will present visualisations that try to illustrate the potential of edge bundling (teaser: <a href=\"https://www.linkedin.com/pulse/visualising-flow-bus-passengers-porto-new-algorithm-daniel-moura/\" class=\"linkified\">https://www.linkedin.com/pulse/visualising-flow-bus-passengers-porto-new-algorithm-daniel-moura/</a>).</p> <p>You can read the paper here: <a href=\"http://www.cs.rug.nl/~alext/PAPERS/EuroVis12/kdeeb.pdf\" class=\"linkified\">http://www.cs.rug.nl/~alext/PAPERS/EuroVis12/kdeeb.pdf</a></p> <p>Bio</p> <p>Daniel Moura joined Veniam on September 2015 and is the Head of Data, leading Data Science and Business Intelligence. PhD in Informatics by University of Porto (2011), Daniel has 11 years of experience in data analysis, 17 years in computer science and engineering, 7 years as teaching assistant on computer science subjects, 9 publications in peer-reviewed journals, 3 international patents, and several papers in international conferences. Daniel was Visiting Researcher in the University College of London (England), the University of Gent (Belgium) and the École Polytechnique de Montréal (Canada). Before joining Veniam, Daniel was Research Associate at University of Porto, where he was responsible for data analysis in the FP7 Future Cities project.</p> <p>Talk 2: Ethereum: A secure decentralised generalised transaction ledger by Hugo Peixoto</p> <p>The blockchain paradigm when coupled with cryptographically-secured transactions has demonstrated its utility through a number of projects, not least Bitcoin. Each such project can be seen as a simple application on a decentralised, but singleton, compute resource. We can call this paradigm a transactional singleton machine with shared-state.</p> <p>Ethereum implements this paradigm in a generalised manner. Furthermore it provides a plurality of such resources, each with a distinct state and operating code but able to interact through a message-passing framework with others. We discuss its design, implementation issues, the opportunities it provides and the future hurdles we envisage.</p> <p>You can read the paper here: <a href=\"https://ethereum.github.io/yellowpaper/paper.pdf\" class=\"linkified\">https://ethereum.github.io/yellowpaper/paper.pdf</a></p> <p>Hope to see you soon!</p> ","photos":[],"venue":{"lat":41.151947021484375,"address1":"Rua do Alferes Malheiro 97 4th floor","address2":null,"name":"Veniam (conference room)","postalCode":null,"lon":-8.610437393188477,"country":"pt","city":"Porto"},"utcOffset":3600000,"time":1528912800000,"title":"PWL #05 :: Edge Bundling and Ethereum"},"255632610":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/255632610/","description":"<p>Hello everyone 👋</p> <p>We're getting ready for the 7th session of Papers We Love @ Porto.</p> <p>Let's sit together and discuss about one of the most misunderstood concept in distributed systems, introduced by Eric A. Brewer in the paper \"Harvest, Yield, and Scalable Tolerant Systems\", the CAP Theorem.</p> <p>Details</p> <p>There will be a presentation around the CAP Theorem and its misconceptions, still, if you can, please read the paper (<a href=\"https://pdfs.semanticscholar.org/5015/8bc1a8a67295ab7bce0550886a9859000dc2.pdf\" class=\"linkified\">https://pdfs.semanticscholar.org/5015/8bc1a8a67295ab7bce0550886a9859000dc2.pdf</a>).</p> <p>Doors will open around 18:30 and we'll start the discussion after a quick introduction of the meetup, around 19:00.</p> <p>After we can grab a drink nearby!</p> <p>Hope to see you soon 🎉</p> ","photos":[],"venue":{"lat":41.148101806640625,"address1":"Rua de António Pedro, 24","address2":null,"name":"Porto i/o Santa Catarina","postalCode":null,"lon":-8.606707572937012,"country":"pt","city":"Porto"},"utcOffset":0,"time":1540926000000,"title":"PWL #07 :: Harvest, Yield, and Scalable Tolerant Systems"},"ctkphpyxdbdc":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/ctkphpyxdbdc/","description":"<p>Hello everyone!</p> <p>We are delighted to tell you that we are kicking off the first Papers We Love @ Porto. Our goal is to help bridge the gap between Porto industry and academics: membership of both types are very welcome; and to dive deep into interesting programming topics.</p> <p>For the first ever Papers We Love in Portugal, we'll be hosting Alvaro Videla (<a href=\"https://twitter.com/old_sound\" class=\"linkified\">https://twitter.com/old_sound</a>), Co-Author of the book \"RabbitMQ in Action\" and Former RabbitMQ Core Developer and José Marcelino (<a href=\"https://www.linkedin.com/in/josemarcelino1\" class=\"linkified\">https://www.linkedin.com/in/josemarcelino1</a>), Data Scientist at Farfetch.</p> <p>--</p> <p>&amp;gt; Harmful GOTOs, Premature Optimizations and Programming Myths are The Root of All Evil</p> <p>Over the years our industry has accumulated folklore that shapes what we are as an industry. We repeat maxims like \"Premature optimisation is the root of all evil\" but perhaps ignoring the context on which that sentence was said. This ignorance has lead us to creating myths that sometimes do more harm than good.</p> <p>In this talk I will review some of those myths, see their origin and at the same time make a historical review of what was going on in our industry in the '70s, when those myths appeared.</p> <p>As the old saying goes: Those who cannot remember the past are condemned to repeat it</p> <p>&amp;gt; Talk objectives:</p> <p>- Promote a culture of reading more books, academic papers and related material that refers to the history of our field and programming in general.</p> <p>&amp;gt; Talk audience:</p> <p>- From beginners to experts. No special knowledge is required to attend the talk.</p> <p>Bio</p> <p>Alvaro Videla used to work as a Core Developer for RabbitMQ and co-authored the book \"RabbitMQ in Action\" for Manning Publishing. Before moving to Europe, Alvaro worked in Shanghai building one of Germany's largest dating websites. Some of his open source projects can be found here: <a href=\"http://github.com/videlalvaro\" class=\"linkified\">http://github.com/videlalvaro</a>. Besides code related stuff he likes traveling with his wife, listening/playing music and reading books.</p> <p>--</p> <p>&amp;gt; All Aboard the Natural Language Processing Train</p> <p>From the depts of intuition to practice, José Marcelino will guide us throw the valley of Natural Language Processing field.</p> <p>Sequence labeling tasks, such as Part-of-Speech Tagging or Named Entity Recognition, represents a crucial step to understand language. Step by step, we will review Xuezhe Ma and Eduard Hovy approach (<a href=\"https://arxiv.org/pdf/1603.01354.pdf\" class=\"linkified\">https://arxiv.org/pdf/1603.01354.pdf</a>) to address the problem. We will examine each decision and explain how can we mount a similar solution in a practical approach.</p> <p>Bio</p> <p>José Marcelino is a Data Scientist at Farfetch while completing his Master Thesis in Natural Language Processing at the University of Coimbra.</p> <p>--</p> <p>Details</p> <p>Doors will open around 18:30 and presentations will start after a quick introduction of the meetup, around 19:00.</p> <p>After each presentation, we will open up the floor for discussion, questions and drinks!</p> <p>Hope to see you soon!</p> <p>--</p> <p>Remember that we strictly adhere to the Code of Conduct (<a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md</a>) set forth by all PWL charters.</p> <p>If you want to present a paper either in a full or lightning-talk format, feel free to reach @ordepdev or submit the CFP form (<a href=\"https://docs.google.com/forms/d/1OfwO8XlESmka1uWB_HczuCjsy__o8ORdqEEKBmGXQxA\" class=\"linkified\">https://docs.google.com/forms/d/1OfwO8XlESmka1uWB_HczuCjsy__o8ORdqEEKBmGXQxA</a>).</p> <p>Make sure that you join us on Slack through <a href=\"https://pwlporto.slack.com/\" class=\"linkified\">https://pwlporto.slack.com/</a> or <a href=\"https://pwlporto.herokuapp.com/\" class=\"linkified\">https://pwlporto.herokuapp.com/</a> and follow us on Twitter (<a href=\"https://twitter.com/pwlporto\" class=\"linkified\">https://twitter.com/pwlporto</a>).</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/1/d/0/c/600_468847436.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/1/d/0/f/600_468847439.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/1/d/1/1/600_468847441.jpeg","height":null,"width":null}],"venue":{"lat":41.215335845947266,"address1":"Rua da Lionesa nº 446, Edifício G12, 4465-671 Leça do Balio","address2":null,"name":"Farfetch","postalCode":null,"lon":-8.62398624420166,"country":"pt","city":"Porto"},"utcOffset":0,"time":1519326000000,"title":"PWL #01 :: Hello Porto!"},"248379987":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/248379987/","description":"<p>Hello everyone!</p> <p>We are delighted to tell you that we'll have our second Papers We Love @ Porto at UPTEC. This time we'll host Carlos Baquero (<a href=\"https://twitter.com/xmal\" class=\"linkified\">https://twitter.com/xmal</a>) and Michael Domingues (<a href=\"https://www.linkedin.com/in/michaelapdomingues\" class=\"linkified\">https://www.linkedin.com/in/michaelapdomingues</a>).</p> <p>Talks</p> <p>&amp;gt; Performance testing of open-source HTTP web frameworks in an API</p> <p>Upon each day there are more and more services running on the web and we are trying to make to most out of them. These Web Applications (WAs) represent thousands of type of services we can interact with like weather forecast and Application Programming Interface (API) which use by themselves other WAs. API provides at a certain authorization level access to multi-source data using several request endpoints in a multi-tier architecture where performance is critical and it must be ensured the best throughput, response time and availability. This study presents the implementation of three open-source web frameworks (Revel, Gin and Echo) in a corporate API developed by Movvo® in order to evaluate the overall architecture using Apache Benchmark as a load testing tool. Results show Gin contributed to the fastest response times for a set of requests that vary on processing and retrieved data complexity.</p> <p>&amp;gt; Causality is simple</p> <p>Causality is an essential component of how we make sense of the physical world, and of our relations to other humans. If I put a cup on the table, and look back at it, I expect it to be there. I also expect to get a reply to my postcards, after I send them, and not before. These days hardly any service can claim not to have some form of distributed algorithm at its core. In a distributed scenario, if we are not careful, it is very easy to break the causal sense of things. In a key-value store my writes can be directed to a replica, and my subsequent reads served from an outdated one --- my cup might not be there when I look back. Message dissemination middleware might not always provide the ordering I expect --- I might receive some replies, before their leading questions.</p> <p>Luckily, most of these problems were already there 30 years ago, although in a much smaller scale, and lots of techniques have been developed to keep track of causality and make sense of the complex interactions in modern systems. However developers often look at techniques such as as replica synchronization with version vectors, or causal broadcasting algorithms, as black boxes; or as complex sets of rules that have to be followed and not questioned.</p> <p>This talk will focus on bringing back the intuition on causality, and show that keeping in mind some simple concepts, allows to understand how version vectors and vector clocks work, and were they differ, and how to use more sophisticated mechanisms to handle millions of concurrent clients in modern distributed data stores.</p> <p>Bio</p> <p>Carlos Baquero is an Assistant Professor and teaches Distributed Systems at Universidade do Minho, Portugal. He is a Senior Researcher at the High Assurance Laboratory within INESC TEC. In the 90s, motivated by mobile computing and disconnected operation for file systems, he studied data types with merge (and fork) operations over semi-lattices, a precursor to state-based CRDTs. He is also interested in causality and in distributed aggregation algorithms. He specially likes all things distributed that eventually merge.</p> <p>Details</p> <p>Doors will open around 18:30 and presentations will start after a quick introduction of the meetup, around 19:00.</p> <p>After each presentation, we will open up the floor for discussion, questions and drinks!</p> <p>This meetup will be sponsored by XING.</p> <p>Hope to see you soon!</p> <p>--</p> <p>If you want to present a paper either in a full or lightning-talk format, feel free to reach @ordepdev or submit the CFP form (<a href=\"https://docs.google.com/forms/d/1OfwO8XlESmka1uWB_HczuCjsy__o8ORdqEEKBmGXQxA\" class=\"linkified\">https://docs.google.com/forms/d/1OfwO8XlESmka1uWB_HczuCjsy__o8ORdqEEKBmGXQxA</a>).</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/b/a/5/5/600_469487701.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/b/a/5/6/600_469487702.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/b/a/5/7/600_469487703.jpeg","height":null,"width":null}],"venue":{"lat":41.17802429199219,"address1":"461 Rua Alfredo Allen","address2":null,"name":"UPTEC - Polo Tecnológico","postalCode":null,"lon":-8.605775833129883,"country":"pt","city":"Porto"},"utcOffset":0,"time":1521745200000,"title":"March :: Papers We Love #02"},"cmmfnqyzcbtb":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/cmmfnqyzcbtb/","description":"<p>Hello everyone 👋</p> <p>We're getting ready for the 8th session of Papers We Love @ Porto. It will be hosted by Talkdesk (<a href=\"https://talkdesk.com\" class=\"linkified\">https://talkdesk.com</a>) and we'll have an amazing talk for you. We're super happy to have André Freitas talking about Dapper.</p> <p>Talk: Dapper, a Large-Scale Distributed Systems Tracing Infrastructure</p> <p>Dapper is a distributed tracing system that Google developed to be able to diagnose all requests that microservices make to each other, originated by a single request (e.g. Searching something at Google). André will present the paper and the conclusions Google learned while developing this tool internally.</p> <p>This paper inspired tools such as Zipkin <a href=\"https://zipkin.io/\" class=\"linkified\">https://zipkin.io/</a> and will help you understand what are the implications of using a Distributed Tracing System.</p> <p>Details</p> <p>Doors will open around 18:30 and we'll start the discussion after a quick introduction of the meetup, around 19:00.</p> <p>After we can grab dinner nearby!</p> <p>Hope to see you soon 🎉</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/a/d/0/9/600_478064297.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/a/d/0/c/600_478064300.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/a/d/1/0/600_478064304.jpeg","height":null,"width":null}],"venue":{"lat":41.15219497680664,"address1":"R. de Anselmo Braancamp 119","address2":null,"name":"Talkdesk","postalCode":null,"lon":-8.60106086730957,"country":"pt","city":"Porto"},"utcOffset":0,"time":1547578800000,"title":"PWL #08 :: Dapper, a Large-Scale Distributed Systems Tracing Infrastructure"},"cmmfnqyzfbzb":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/cmmfnqyzfbzb/","description":"<p>Hello everyone 👋</p> <p>The 10th session of Papers We Love @ Porto will be hosted by Blip and we're super happy to have both Sasha Fonseca (<a href=\"https://www.linkedin.com/in/sashafonseca\" class=\"linkified\">https://www.linkedin.com/in/sashafonseca</a>) and Tiago Caxias (<a href=\"https://www.linkedin.com/in/tiagocaxias\" class=\"linkified\">https://www.linkedin.com/in/tiagocaxias</a>) talking about interesting scientific topics!</p> <p>Agenda<br/>18:30 👋 Meet &amp; Greet<br/>19:00 🎙 Introduction<br/>19:15 📜 Conquering Concurrency in Erlang by Sasha Fonseca<br/>20:00 🍕 Networking<br/>20:15 📜The consensus is that we won't come to a consensus about consensus protocols by Tiago Caxias<br/>21:00 👏 Wrap-up</p> <p>📜 Conquering Concurrency in Erlang</p> <p>Erlang/OTP is a programming language and platform which targets concurrent and distributed systems. It sits on top of a framework of abstractions which enable programmers to more easily reason about concurrency and distribution, and to better utilize the current trend of multi-core processors.</p> <p>Due to its underlying model a large set of common problems (e.g., deadlocks, race conditions) found in these type of systems are eliminated or harder to incur into. Nonetheless, certain Erlang programs can be affected by this class of errors.</p> <p>Concuerror is a stateless model checking tool for debugging, testing and verifying Erlang programs. Its aim is to detect and debug concurrency errors via interleaving techniques for Erlang's process-oriented systems. In this talk we will get an overview of how this tool works, details about its implementation and a demo where we will see how it can be used to improve Erlang programs.</p> <p>📜 The consensus is that we won't come to a consensus about consensus protocols.</p> <p>Distributed systems are fun.</p> <p>We want them to linearizable, we want them to be high performant, we want them to be highly available ... as soon as the daemons start!<br/>Isn't it what is supposed to do?</p> <p>In fact, distributed system have a lot of design features that turn them into beasts we barely know but keep on using, and consensus protocols aren't the exception here.</p> <p>From Raft to the many flavors of Paxos to some others that came after we will take a close look and understand what they are doing.</p> <p>Let's find out if in fact we should trust the consensus features in Cassandra, Etcd, Consul, TiKV, Kudu, CockroachDB, RethinkDB, ScyllaDB, Google Spanner, Neo4j or Ceph.</p> <p>If you like distributed systems and papers which flame one another this is your talk!</p> <p>Details</p> <p>Doors will open around 18:30 and we'll start the talk after a quick introduction of the meetup, around 19:00. After networking, we can grab dinner nearby!</p> <p>Hope to see you soon 🎉</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/8/7/7/7/600_479854679.jpeg","height":null,"width":null}],"venue":{"lat":41.149078369140625,"address1":"Av. de Camilo 94","address2":null,"name":"Blip","postalCode":null,"lon":-8.594792366027832,"country":"pt","city":"Porto"},"utcOffset":0,"time":1553626800000,"title":"PWL #10 :: Concurrency & Consensus"},"252595151":{"url":"https://www.meetup.com/Papers-We-Love-Porto/events/252595151/","description":"<p>Hello everyone, we have great news for you!</p> <p>Our sixth session will be hosted by Blip (<a href=\"https://blip.pt\" class=\"linkified\">https://blip.pt</a>) and we'll have two amazing talks for you. We're super happy to have both Joāo Fernandes (<a href=\"https://bit.ly/2m9ocSe\" class=\"linkified\">https://bit.ly/2m9ocSe</a>), and Miguel Palhas (<a href=\"https://twitter.com/naps62\" class=\"linkified\">https://twitter.com/naps62</a>) talking about two great scientific topics!</p> <p>Talk 1: Mastering the game of Go with deep neural networks and tree search by Joāo Fernandes</p> <p>The game of Go has long been viewed as the most challenging of classic games for artificial intelligence owing to its enormous search space and the difficulty of evaluating board positions and moves. Joāo will introduce to us this new approach to computer Go that uses value networks to evaluate board positions and policy networks to select moves.</p> <p>Talk 2: Distributed Consensus by Miguel Palhas</p> <p>Miguel will give us an overview of some distributed consensus algorithms, from the original Hashcash/Bitcoin to some exciting research that tries to solve the know problems from the original solutions.</p> <p>Details</p> <p>Doors will open around 18:30 and presentations will start after a quick introduction of the meetup, around 19:00.</p> <p>After each presentation, we will open up the floor for discussion, questions and drinks!</p> <p>Hope to see you soon 🎉</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/c/a/0/3/600_473211715.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/c/a/0/4/600_473211716.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/c/a/0/8/600_473211720.jpeg","height":null,"width":null}],"venue":{"lat":41.149078369140625,"address1":"Av. de Camilo 94","address2":null,"name":"Blip","postalCode":null,"lon":-8.594792366027832,"country":"pt","city":"Porto"},"utcOffset":3600000,"time":1532455200000,"title":"PWL #06 :: Deep Neural Networks and Distributed Consensus"}}