{"222757147":{"url":"https://www.meetup.com/Papers-We-Love-Reykjavik/events/222757147/","description":"<p>This time it will be very informal, we will meet up at the coffee house <a href=\"https://www.facebook.com/stofan.cafe\">Stofan Café</a> as they have comfortable couches, beers and good coffee.</p> <p>Instead of having a speaker giving a talk on the paper we will simply try to explain it to each other and have some fun discussions that almost always go way off topic :)<br/>Reading the paper is highly recommended but don't stress it.</p> <p><br/>--<br/>The paper we will discuss is \"TAO: Facebook's Distributed Data Store for the Social Graph\".</p> <p>\"A single Facebook page may aggregate and filter hundreds of items from the social graph. We present each user with content tailored to them, and we filter every item with privacy checks that take into account the current viewer. This extreme customization makes it infeasible to perform most aggregation and filtering when content is created; instead we resolve data dependencies and check privacy each time the content is viewed. As much as possible we pull the social graph, rather than pushing it. This implementation strategy places extreme read demands on the graph data store; it must be efficient, highly available, and scale to high query rates.\"<br/>- Nathan Bronson</p> <p>Abstract:</p> <p><br/>We introduce a simple data model and API tailored for serving the social graph, and TAO, an implementation of this model. TAO is a geographically distributed data store that provides efficient and timely access to the so- cial graph for Facebook’s demanding workload using a fixed set of queries. It is deployed at Facebook, replac- ing memcache for many data types that fit its model. The system runs on thousands of machines, is widely dis- tributed, and provides access to many petabytes of data. TAO can process a billion reads and millions of writes each second. </p> <p><br/>Paper link: <a href=\"https://facebook.com/download/273893712748848/atc13-bronson.pdf\"><a href=\"https://facebook.com/download/273893712748848/atc13-bronson.pdf\" class=\"linkified\">https://facebook.com/download/273893712748848/atc13-bronson.pdf</a></a>&lt;a href=\"http://www.meetup.com/Papers-We-Love-Reykjavik/events/222757147/\"&gt;&lt;/a&gt;</p> ","photos":[],"venue":{"lat":null,"address1":false,"address2":null,"name":null,"postalCode":null,"lon":null,"country":false,"city":false},"utcOffset":0,"time":1432836000000,"title":"#1 => TAO: Facebook's Distributed Data Store for the Social Graph"},"211846292":{"url":"https://www.meetup.com/Papers-We-Love-Reykjavik/events/211846292/","description":"<p>For our first meetup Ólafur R. Helgason will present and lead the discussion on <a href=\"http://pdos.csail.mit.edu/papers/ton:chord/paper-ton.pdf\">Chord: A Scalable Peer-to-peer Lookup Protocol for Internet Applications</a>.</p> <p>We hope to see as many as possible and I hope we can make these meetups a regular thing.</p> <p><b>Abstract<br/></b>A fundamental problem that confronts peer-to-peer applications is the efficient location of the node that stores a desired data item. This paper presents Chord, a distributed lookup protocol that addresses this problem. Chord provides support for just one operation: given a key, it maps the key onto a node. Data location can be easily implemented on top of Chord by associating a key with each data item, and storing the key/data pair at the node to which the key maps. Chord adapts efficiently as nodes join and leave the system, and can answer queries even if the system is continuously changing. Results from theoretical analysis and simulations show that Chord is scalable: communication cost and the state maintained by each node scale logarithmically with the number of Chord nodes. </p> <p><b>Bio</b><br/>Ólafur is currently the VP of Engineering at OZ. He received his PhD in Computer Science from KTH. At KTH he was a post-doc researcher at the Laboratory for Communication Networks researching opportunistic networking and mobile wireless systems. Before going to KTH he was a researcher and teacher at Reykjavík University focusing mainly on Computer Networks.</p> <p><b>Details<br/></b>Doors open at 18:00; the presentation will begin at 18:20; and, yes, there will be beer, water, and pizza. </p> <p>After Ólafur presents the paper, we will open up the floor to discussion and questions.  </p> <p>We hope that you'll read the paper before the meetup, but don't stress if you can't.  If you have any questions, thoughts, or related information, please visit our *<a href=\"https://github.com/papers-we-love/papers-we-love/issues/211\">github-thread</a>* on the matter.</p> <p>Additionally, if you have any papers you want to add to the repository above (papers that you love!), please send us a <a href=\"https://github.com/papers-we-love/papers-we-love/pulls\">pull request</a>. Also, if you have any ideas/questions about this meetup or the Papers-We-Love org, just open up an issue.</p> ","photos":[],"venue":{"lat":64.12566375732422,"address1":"Menntavegi 1, Reykjavík","address2":null,"name":"Reykjavík University","postalCode":null,"lon":-21.92622947692871,"country":"is","city":"101"},"utcOffset":0,"time":1416420000000,"title":"#0 => Ólafur R. Helgason - Chord: A Scalable Peer-to-peer Lookup Protocol for.."}}