{"202966912":{"description":"<p>The idea is to bridge the gap between theory and practice and the first step is to disseminate the knowledge and we have and explore new horizons.</p> <p><i>For the first meetup we will be discussing Paxos - The part time parliament by Leslie Lamport. This is one of the most widely known papers in the distributed systems community but also known to be notoriously complicated and rarely well understood. We shall endeavour to change that!</i></p> <p><i><b>Reading list for Paxos:</b></i></p> <p>• <i><b>[The Part-Time Parliament]</b>(<a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/lamport-paxos.pdf\"><a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/lamport-paxos.pdf\" class=\"linkified\">http://research.microsoft.com/en-us/um/people/lamport/pubs/lamport-paxos.pdf</a></a>) </i></p> <p>• <i><b>[Paxos Made simple]</b>(<a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/distributed_systems/paxos-made-simple.pdf\"><a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/distributed_systems/paxos-made-simple.pdf\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/blob/master/distributed_systems/paxos-made-simple.pdf</a></a>)</i></p> <p>• <i><b>[Paxos Made moderately complex]</b>(<a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/distributed_systems/paxos-made-moderately-complex.pdf\"><a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/distributed_systems/paxos-made-moderately-complex.pdf\" class=\"linkified\">https://github.com/papers-we-love/papers-we-love/blob/master/distributed_systems/paxos-made-moderately-complex.pdf</a></a>)</i></p> <p>• <i><b>[Paxos on Wikipedia]</b>(<a href=\"http://en.wikipedia.org/wiki/Paxos_(computer_science)\"><a href=\"http://en.wikipedia.org/wiki/Paxos_(computer_science\" class=\"linkified\">http://en.wikipedia.org/wiki/Paxos_(computer_science</a>)</a>)</i></p> <p><i>I will present a presentation on the topic followed by informal discussions. I hope everyone can join!</i></p> <p>&lt;a href=\"http://www.meetup.com/Papers-We-Love-Seattle/polls/1145352/\"&gt;&lt;/a&gt;</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/6/0/f/6/600_413484822.jpeg","width":null}],"time":1411524000000,"title":"Inaugural meetup","url":"https://www.meetup.com/papers-we-love-seattle/events/202966912/","utcOffset":-25200000,"venue":{"address1":"209 1/2 1st Ave","address2":null,"city":"Seattle","country":"us","lat":47.600425720214844,"lon":-122.33443450927734,"name":"Cloudant","postalCode":"98108"}},"209319592":{"description":"<p><b>Abstract</b></p> <p>Immutable vectors are a convenient data structure for functional programming and part of the standard library of modern languages like Clojure and Scala. The common implementation is based on wide trees with a fixed number of children per node, which allows fast indexed lookup and update operations. In this paper, the authors extend the vector data type with a new underlying data structure, Relaxed Radix Balanced Trees (RRB-Trees), and show how this structure allows immutable vector concatenation, insert-at and splits in O(logN) time while maintaining the index, update and iteration speeds of the original vector data structure.</p> <p>Chris Bilson will be presenting this paper followed by a Q&amp;A session.</p> <p>Link: &lt;a&gt;RRB-Trees: Efficient Immutable Vectors&lt;/a&gt;</p> ","photos":[],"time":1414114200000,"title":"PWL#2: RRB-Trees: Efficient Immutable Vectors","url":"https://www.meetup.com/papers-we-love-seattle/events/209319592/","utcOffset":-25200000,"venue":{"address1":"999, 3rd Ave, 34th floor, Seattle, WA 98104","address2":null,"city":"Seattle","country":"us","lat":0.0,"lon":0.0,"name":"Madrona Venture Group","postalCode":""}},"215859342":{"description":"<p>After a long reign as the dominant on-disk data structure for databases and filesystems, B-trees are slowly being replaced by write-optimized data structures, to handle ever-growing volumes of data. Some write optimization techniques, like LSM-trees, give up some of the query performance of B-trees in order to achieve this.</p> <p>This time I will cover B-Trees, LSM Trees and Fractal Trees papers and provide some real world use cases (and data) along with the a discussion on the respective papers.</p> ","photos":[],"time":1421375400000,"title":"PWL#3: LSM Trees, BTrees and Cache oblivious B-Trees","url":"https://www.meetup.com/papers-we-love-seattle/events/215859342/","utcOffset":-28800000,"venue":{"address1":"1315 E Pine St","address2":null,"city":"Seattle","country":"us","lat":47.61521911621094,"lon":-122.3150863647461,"name":"The Project Room","postalCode":""}},"219963131":{"description":"<p><b></b></p> <p><b>Abstract</b></p> <p>Bigtable is a distributed storage system for managing structured data that is designed to scale to a very large size: petabytes of data across thousands of commodity servers. Many projects at Google store data in Bigtable, including web indexing, Google Earth, and Google Finance. These applications place very different demands on Bigtable, both in terms of data size (from URLs to web pages to satellite imagery) and latency requirements (from backend bulk processing to real-time data serving). Despite these varied demands, Bigtable has successfully provided a flexible, high-performance solution for all of these Google products. In this paper we describe the simple data model provided by Bigtable, which gives clients dynamic control over data layout and format, and we describe the design and implementation of Bigtable.</p> <p>Arunabha Ghosh, director of Engineering at Moz, will be presenting this paper. Before Moz, Arunabha spend around 7 years at Google working on large scale distributed systems. I hope to see all of you for an insightful discussion.</p> <p>Reading list: </p> <p><a href=\"http://static.googleusercontent.com/media/research.google.com/en/us/archive/bigtable-osdi06.pdf\">Bigtable: A Distributed Storage System for Structured Data</a></p> ","photos":[],"time":1423621800000,"title":"PWL#4: Bigtable: A Distributed Storage System for Structured Data","url":"https://www.meetup.com/papers-we-love-seattle/events/219963131/","utcOffset":-28800000,"venue":{"address1":"1100 2nd Ave., Suite 500","address2":null,"city":"Seattle","country":"us","lat":47.60651397705078,"lon":-122.33588409423828,"name":"Moz","postalCode":""}},"220567705":{"description":"<p><i>We will be covering the paper that launched many other NoSQL databases over the years. Apache Cassandra, Voldemort, Riak to name a few.</i></p> <p><b>ABSTRACT </b>Reliability at massive scale is one of the biggest challenges we face at Amazon.com, one of the largest e-commerce operations in the world; even the slightest outage has significant financial consequences and impacts customer trust. The Amazon.com platform, which provides services for many web sites worldwide, is implemented on top of an infrastructure of tens of thousands of servers and network components located in many datacenters around the world. At this scale, small and large components fail continuously and the way persistent state is managed in the face of these failures drives the reliability and scalability of the software systems. This paper presents the design and implementation of Dynamo, a highly available key-value storage system that some of Amazon’s core services use to provide an “always-on” experience. To achieve this level of availability, Dynamo sacrifices consistency under certain failure scenarios. It makes extensive use of object versioning and application-assisted conflict resolution in a manner that provides a novel interface for developers to use.  </p> <p><b><br/></b></p> <p><b><a href=\"http://www.cs.ucsb.edu/~agrawal/fall2009/dynamo.pdf\"><a href=\"http://www.cs.ucsb.edu/~agrawal/fall2009/dynamo.pdf\" class=\"linkified\">http://www.cs.ucsb.edu/~agrawal/fall2009/dynamo.pdf</a></a><br/></b></p> <p><b><br/></b></p> <p><b>NOTE: We are still looking for a venue for this event. If you can accommodate the group on tuesday please let me know. Thanks!</b></p> ","photos":[],"time":1426037400000,"title":"PWL#5: Dynamo: Amazon’s Highly Available Key-value Store","url":"https://www.meetup.com/papers-we-love-seattle/events/220567705/","utcOffset":-25200000,"venue":{"address1":"1315 E Pine St","address2":null,"city":"Seattle","country":"us","lat":47.61521911621094,"lon":-122.3150863647461,"name":"The Project Room","postalCode":""}},"221174354":{"description":"<p>we're excited to have <a href=\"https://twitter.com/BrandonBloom\">Brandon Bloom</a> presenting the paper <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/plt/programming-with-algebraic-effects-and-handlers.pdf?raw=true\">Programming with Algebraic Effects and Handlers</a> by Andrej Bauer and Matija Pretnar.</p> <p><b>Intro</b></p> <p>Some great papers embody insights, others package up those insights into digestible bites. \"Programing with Algebraic Effects and Handlers\" is the later sort of great paper. After two decades of fundamental research in to the nature of computation, a lot of mysterious ideas in computer science such as continuations and exception handling finally made sense to a number of mathematically inclined geniuses. Bauer and Pretnar's Eff programming language cuts right through the heart of the theory in a way that makes sense to anybody who has ever written a functional program. This paper uses the Eff language to explore a number of simple computational effects that were traditionally viewed as quite varied and complex.</p> <p><b>Brandon's Bio</b></p> <p>Brandon Bloom walks a fine line between laser focused pragmatism and broad academic interests. Most recently in his varied career, Brandon worked on Code.org's Hour Of Code campaign. In the past, he's founded and sold a startup, as well as worked on Microsoft Xbox and Google Translate. Now, he's indulging his inner scientist and exploring technology for his next venture. Find him on the web at &lt;<a href=\"http://www.brandonbloom.name/\"><a href=\"http://www.brandonbloom.name/\" class=\"linkified\">http://www.brandonbloom.name/</a></a>&gt;.</p> ","photos":[],"time":1429234200000,"title":"PWL#6: Brandon Bloom on Programming with Algebraic Effects and Handlers","url":"https://www.meetup.com/papers-we-love-seattle/events/221174354/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"222065399":{"description":"<p><i>This time Ankur Chauhan will present the paper: <b>The LCA Problem Revisited</b> </i>by Michael A. Bender and Martin Farach-Colton. The lowest common ancestor problem was first stated in 1973 and it took 11 years before an optimal solution was discovered, and another 16 before an understandable and implementable solution with the same bounds was presented. This deceptively simple problem comes together in the end and uses techniques that are powerful in plenty of other places. </p> <p>Link to the paper: <a href=\"http://www.ics.uci.edu/~eppstein/261/BenFar-LCA-00.pdf\"><a href=\"http://www.ics.uci.edu/~eppstein/261/BenFar-LCA-00.pdf\" class=\"linkified\">http://www.ics.uci.edu/~eppstein/261/BenFar-LCA-00.pdf</a></a></p> ","photos":[],"time":1431653400000,"title":"PWL#7: The LCA Problem Revisited","url":"https://www.meetup.com/papers-we-love-seattle/events/222065399/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"222902098":{"description":"<p>David Murray will present chain replication: a high-throughput alternative to quorum-based replication protocols like PAXOS and RAFT.</p> <p><i><b>Abstract</b></i></p> <p>Chain replication is a new approach to coordinating clusters of fail-stop storage servers. The approach is intended for supporting large-scale storage services that exhibit high throughput and availability without sacrificing strong consistency guarantees. Besides outlining the chain replication protocols themselves, simulation experiments explore the performance characteristics of a prototype implementation. Throughput, availability, and several objectplacement strategies (including schemes based on distributed hash table routing) are discussed.</p> <p>Link to the paper: <a href=\"http://www.cs.cornell.edu/home/rvr/papers/osdi04.pdf\" class=\"linkified\">http://www.cs.cornell.edu/home/rvr/papers/osdi04.pdf</a></p> ","photos":[],"time":1434072600000,"title":"PWL#8: Chain Replication for Supporting High Throughput and Availability","url":"https://www.meetup.com/papers-we-love-seattle/events/222902098/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"223224228":{"description":"<p>Derek Elkins will present on \"Dedalus: Datalog in Time and Space\" touching also on some follow-on work.</p> <p><b>Abstract. </b></p> <p>Recent research has explored using Datalog-based languages to express a distributed system as a set of logical invariants. Two properties of distributed systems proved difficult to model in Datalog. First, the state of any such system evolves with its execution. Second, deductions in these systems may be arbitrarily delayed, dropped, or reordered by the unreliable network links they must traverse. Previous efforts addressed the former by extending Datalog to include updates, key constraints, persistence and events, and the latter by assuming ordered and reliable delivery while ignoring delay. These details have a semantics outside Datalog, which increases the complexity of the language and its interpretation, and forces programmers to think operationally. We argue that the missing component from these previous languages is a notion of time.</p> <p>In this paper we present Dedalus, a foundation language for programming and reasoning about distributed systems. Dedalus reduces to a subset of Datalog with negation, aggregate functions, successor and choice, and adds an explicit notion of logical time to the language. We show that Dedalus provides a declarative foundation for the two signature features of distributed systems: mutable state, and asynchronous processing and communication. Given these two features, we address two important properties of programs in a domain-specific manner: a notion of safety appropriate to non-terminating computations, and stratified monotonic reasoning with negation over time. We also provide conservative syntactic checks for our temporal notions of safety and stratification. Our experience implementing full-featured systems in variants of Datalog suggests that Dedalus is well-suited to the specification of rich distributed services and protocols, and provides both cleaner semantics and richer tests of correctness.</p> <p>Tech Report version: <a href=\"http://www.eecs.berkeley.edu/Pubs/TechRpts/2009/EECS-2009-173.html\"><a href=\"http://www.eecs.berkeley.edu/Pubs/TechRpts/2009/EECS-2009-173.html\" class=\"linkified\">http://www.eecs.berkeley.edu/Pubs/TechRpts/2009/EECS-2009-173.html</a></a><br/>Published version: <a href=\"http://db.cs.berkeley.edu/papers/datalog2011-dedalus.pdf\"><a href=\"http://db.cs.berkeley.edu/papers/datalog2011-dedalus.pdf\" class=\"linkified\">http://db.cs.berkeley.edu/papers/datalog2011-dedalus.pdf</a></a></p> <p>Earlier work:</p> <p>Overlog - <a href=\"http://db.cs.berkeley.edu/netdb-09/\"><a href=\"http://db.cs.berkeley.edu/netdb-09/\" class=\"linkified\">http://db.cs.berkeley.edu/netdb-09/</a></a></p> <p>Related work:<br/>Bloom - <a href=\"http://www.bloom-lang.net/\"><a href=\"http://www.bloom-lang.net/\" class=\"linkified\">http://www.bloom-lang.net/</a></a></p> <p>The CALM and CRON Conjectures (which have since been proven): <a href=\"http://www.bloom-lang.net/calm/\"><a href=\"http://www.bloom-lang.net/calm/\" class=\"linkified\">http://www.bloom-lang.net/calm/</a></a> (I recommend the keynote talk and paper, \"The Declarative Imperative\" which introduced the CALM and CRON conjectures.)</p> ","photos":[],"time":1436491800000,"title":"PWL#9: Dedalus: Datalog in Time and Space","url":"https://www.meetup.com/papers-we-love-seattle/events/223224228/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"224064458":{"description":"<p><b>Abstract</b></p> <p>We present Mesos, a platform for sharing commodity clusters between multiple diverse cluster computing frameworks, such as Hadoop and MPI. Sharing improves cluster utilization and avoids per-framework data replication. Mesos shares resources in a fine-grained manner, allowing frameworks to achieve data locality by taking turns reading data stored on each machine. To support the sophisticated schedulers of today's frameworks, Mesos introduces a distributed two-level scheduling mechanism called resource offers. Mesos decides how many resources to offer each framework, while frameworks decide which resources to accept and which computations to run on them. Our results show that Mesos can achieve near-optimal data locality when sharing the cluster among diverse frameworks, can scale to 50,000 (emulated) nodes, and is resilient to failures.</p> <p><b><br/></b></p> <p><b>Presenter:</b></p> <p>Ankur Chauhan</p> <p><b>Links:</b></p> <p><a href=\"https://www.cs.berkeley.edu/~alig/papers/mesos.pdf\"><a href=\"https://www.cs.berkeley.edu/~alig/papers/mesos.pdf\" class=\"linkified\">https://www.cs.berkeley.edu/~alig/papers/mesos.pdf</a></a></p> <p><a href=\"http://mesos.apache.org\"><a href=\"http://mesos.apache.org\" class=\"linkified\">http://mesos.apache.org</a></a></p> <p><a href=\"http://mesos.apache.org/documentation/latest/mesos-frameworks/\">List of Mesos Frameworks</a></p> ","photos":[],"time":1439517600000,"title":"Mesos - A Platform for Fine-Grained Resource Sharing in the Data Center","url":"https://www.meetup.com/papers-we-love-seattle/events/224064458/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"224687764":{"description":"<p>David Murray will present <a href=\"http://lampwww.epfl.ch/papers/idealhashtrees.pdf\">Ideal Hash Trees</a>:</p> <p>\"Hash Trees with nearly ideal characteristics are described. These Hash Trees require no initial root hash table yet are faster and use significantly less space than chained or double hash trees. Insert, search and delete times are small and constant, independent of key set size, operations are O(1). Small worst-case times for insert, search and removal operations can be guaranteed and misses cost less than successful searches. Array Mapped Tries(AMT), first described in Fast and Space Efficient Trie Searches, Bagwell [2000], form the underlying data structure. The concept is then applied to external disk or distributed storage to obtain an algorithm that achieves single access searches, close to single access inserts and greater than 80 percent disk block load factors. Comparisons are made with Linear Hashing, Litwin, Neimat, and Schneider [1993] and B-Trees, R.Bayer and E.M.McCreight [1972]. In addition two further applications of AMTs are briefly described, namely, Class/Selector dispatch tables and IP Routing tables. Each of the algorithms has a performance and space usage that is comparable to contemporary implementations but simpler. \"</p> ","photos":[],"time":1441936800000,"title":"PWL#11 Ideal Hash Trees","url":"https://www.meetup.com/papers-we-love-seattle/events/224687764/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"225127189":{"description":"<p><a href=\"https://goo.gl/uJ4Mvk\" class=\"linkified\">https://goo.gl/uJ4Mvk</a></p> <p>This time <b>Jose Contreras</b> will be presenting a KDD paper on \"<b>Predicting Voice Elicited Emotions</b>\".</p> <p><b>Abstract: </b></p> <p>We present the research, and product development and deployment, of Voice Analyzer™ by Jobaline Inc. This is a patent pending technology that analyzes voice data and predicts human emotions elicited by the paralinguistic elements of a voice.</p> <p>Human voice characteristics, such as tone, complement the verbal communication. In several contexts of communication, “how” things are said is just as important as “what” is being said. This paper provides an overview of our deployed system, the raw data, the data processing steps, and the prediction algorithms we experimented with. A case study is included where, given a voice clip, our model predicts the degree in which a listener will find the voice “engaging”. Our prediction results were verified through independent market research with 75% in agreement on how an average listener would feel. One application of Jobaline Voice Analyzer technology is for assisting companies to hire workers in the service industry where customers’ emotional response to workers’ voice may affect the service outcome. Jobaline Voice Analyzer is deployed in production as a product offer to our clients to help them identify workers who will better engage with their customers. We will also share some discoveries and lessons learned.</p> <p>Link to the paper: </p> <p><a href=\"https://goo.gl/uJ4Mvk\"><a href=\"https://goo.gl/uJ4Mvk\" class=\"linkified\">https://goo.gl/uJ4Mvk</a></a></p> ","photos":[],"time":1444354200000,"title":"PWL#12 Predicting Voice Elicited Emotions","url":"https://www.meetup.com/papers-we-love-seattle/events/225127189/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"225811209":{"description":"<p>Ryan Cox will cover \"Survivable Key Compromise in Software Update Systems\". What happens when your signing keys are compromised or checked into GitHub?  He will demo Notary, Docker's implementation of TheUpdateFramework; described in the paper. TUF is a system that grew out of Tor and is capable of surviving key compromises as well as several other issues in current update managers.</p> <p>Paper: <a href=\"https://isis.poly.edu/~jcappos/papers/samuel_tuf_ccs_2010.pdf\"><a href=\"https://isis.poly.edu/~jcappos/papers/samuel_tuf_ccs_2010.pdf\" class=\"linkified\">https://isis.poly.edu/~jcappos/papers/samuel_tuf_ccs_2010.pdf</a></a></p> <p>Samuel, Justin, et al. \"Survivable key compromise in software update systems.\" Proceedings of the 17th ACM conference on Computer and communications security. ACM, 2010.</p> ","photos":[],"time":1447381800000,"title":"PWL #13: Survivable Key Compromise in Software Update Systems","url":"https://www.meetup.com/papers-we-love-seattle/events/225811209/","utcOffset":-28800000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"226493450":{"description":"<p>Trevor Lalish-Menagh will present \"A Critique of the CAP Theorem.\" Abstract:</p> <p>The CAP Theorem is a frequently cited impossibility result in distributed systems, especially among NoSQL distributed databases. In this paper we survey some of the confusion about the meaning of CAP, including inconsistencies and ambiguities in its definitions, and we highlight some problems in its formalization. CAP is often interpreted as proof that eventually consistent databases have better availability properties than strongly consistent databases; although there is some truth in this, we show that more careful reasoning is required. These problems cast doubt on the utility of CAP as a tool for reasoning about trade-offs in practical systems. As alternative to CAP, we propose a \"delay-sensitivity\" framework, which analyzes the sensitivity of operation latency to network delay, and which may help practitioners reason about the trade-offs between consistency guarantees and tolerance of network faults.</p> <p><a href=\"http://arxiv.org/abs/1509.05393\" class=\"linkified\">http://arxiv.org/abs/1509.05393</a></p> ","photos":[],"time":1449801000000,"title":"PWL #14: A Critique of the CAP Theorem","url":"https://www.meetup.com/papers-we-love-seattle/events/226493450/","utcOffset":-28800000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"226850256":{"description":"<p>Ankur Chauhan will present the latest research on stream processing systems that was recently presented at VLDB 2015 by the team at Google. The paper is titled: \"<b>The Dataflow Model: A Practical Approach to Balancing Correctness, Latency, and Cost in Massive-Scale, Unbounded, Out-of-Order Data Processing</b>\". This presents the state of the art in stream processing systems at scale and are also the technologies that lie at the heart of <a href=\"https://cloud.google.com/dataflow/what-is-google-cloud-dataflow\">Google Cloud Dataflow</a>.</p> <p><b>Abstract:</b></p> <p>Unbounded, unordered, global-scale datasets are increasingly common in day-to-day business (e.g. Web logs, mobile usage statistics, and sensor networks). At the same time, consumers of these datasets have evolved sophisticated requirements, such as event-time ordering and windowing by features of the data themselves, in addition to an insatiable hunger for faster answers. Meanwhile, practicality dictates that one can never fully optimize along all dimensions of correctness, latency, and cost for these types of input. As a result, data processing practitioners are left with the quandary of how to reconcile the tensions between these seemingly competing propositions, often resulting in disparate implementations and systems. We propose that a fundamental shift of approach is necessary to deal with these evolved requirements in modern data processing. We as a field must stop trying to groom unbounded datasets into finite pools of information that eventually become complete, and instead live and breathe under the assumption that we will never know if or when we have seen all of our data, only that new data will arrive, old data may be retracted, and the only way to make this problem tractable is via principled abstractions that allow the practitioner the choice of appropriate tradeoffs along the axes of interest: correctness, latency, and cost. In this paper, we present one such approach, the Dataflow Model, along with a detailed examination of the semantics it enables, an overview of the core principles that guided its design, and a validation of the model itself via the real-world experiences that led to its development.</p> <p><b>Papers:</b></p> <p>* <a href=\"http://www.vldb.org/pvldb/vol8/p1792-Akidau.pdf\">The Dataflow Model: A Practical Approach to Balancing Correctness, Latency, and Cost in Massive-Scale, Unbounded, Out-of-Order Data Processing</a></p> <p>* <a href=\"http://static.googleusercontent.com/media/research.google.com/en/us/pubs/archive/41378.pdf\">MillWheel: Fault-Tolerant Stream Processing at Internet Scale</a></p> ","photos":[],"time":1452825000000,"title":"PWL #15: The Dataflow Model and Millwheel: Fault tolerant stream processing","url":"https://www.meetup.com/papers-we-love-seattle/events/226850256/","utcOffset":-28800000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"227211670":{"description":"<p>Tristan Penman will present Chord: A Scalable Peer-to-peer Lookup Service for Internet Applications.</p> <p>\"A fundamental problem that confronts peer-to-peer applications is to efficiently locate the node that stores a particular data item. This paper presents Chord, a distributed lookup protocol that addresses this problem. Chord provides support for just one operation: given a key, it maps the key onto a node. Data location can be easily implemented on top of Chord by associating a key with each data item, and storing the key/data item pair at the node to which the key maps. Chord adapts efficiently as nodes join and leave the system, and can answer queries even if the system is continuously changing. Results from theoretical analysis, simulations, and ex- periments show that Chord is scalable, with communication cost and the state maintained by each node scaling logarithmically with the number of Chord nodes.\"</p> <p><a href=\"https://pdos.csail.mit.edu/papers/chord:sigcomm01/chord_sigcomm.pdf\"><a href=\"https://pdos.csail.mit.edu/papers/chord:sigcomm01/chord_sigcomm.pdf\" class=\"linkified\">https://pdos.csail.mit.edu/papers/chord:sigcomm01/chord_sigcomm.pdf</a></a></p> ","photos":[],"time":1455244200000,"title":"PWL #16: Chord","url":"https://www.meetup.com/papers-we-love-seattle/events/227211670/","utcOffset":-28800000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"227565360":{"description":"<p><i>[Hi fellow paper lovers! We're starting to build up a decent backlog of topics, I've heard from a couple interested people who have trouble making the usual Thursday timeslot, so I figured it might be fun to try a second event in January on a different night of the week to spread the love around. For the moment I'm only committing to one, but if it's a hit maybe we'll turn it into a regular thing. Let me know your feelings on the subject, if you have them!]</i></p> <p>Denis Rystsov will present \"Scalable Atomic Visibility with RAMP Transactions\" by Peter Bailis, Alan Fekete, Ali Ghodsi, Joseph M. Hellerstein and Ion Stoica.</p> <p>It's a fresh paper of last year (2014) where authors propose a new isolation model — Read Atomic (RA) isolation — that helps to achieve incredible scalability in multi-partition distributed databases.</p> <p>Read Atomic isolation is similar to Read Committed isolation, and provides atomic visibility: either all or none of each transaction’s updates are observed by other transactions. Bailis and friends describe algorithms for Read Atomic MultiPartition (RAMP) transactions that enforce atomic visibility while offering excellent scalability, guaranteed commit despite partial failures (via synchronization independence), and minimized communication between servers (via partition independence).</p> <p>We'll discuss RAMP transactions, its limitations and the way to handle the lost update problem.</p> <p><a href=\"http://www.bailis.org/papers/ramp-sigmod2014.pdf\"><a href=\"http://www.bailis.org/papers/ramp-sigmod2014.pdf\" class=\"linkified\">http://www.bailis.org/papers/ramp-sigmod2014.pdf</a></a></p> <p>Thanks to the lovely folks at Thomas Street (<a href=\"http://thomasstreet.com\"><a href=\"http://thomasstreet.com\" class=\"linkified\">http://thomasstreet.com</a></a>) for hosting this one!</p> ","photos":[],"time":1453948200000,"title":"PWL #15.5: Scalable Atomic Visibility with RAMP Transactions","url":"https://www.meetup.com/papers-we-love-seattle/events/227565360/","utcOffset":-28800000,"venue":{"address1":"1315 E Pine St","address2":null,"city":"Seattle","country":"us","lat":47.61518859863281,"lon":-122.31485748291016,"name":"Thomas Street","postalCode":""}},"228753723":{"description":"<p>Fuzzing is a technique to find software defects by providing random(ish) input to a system, and watching to see which patterns of input cause bad behavior.</p> <p>The paper is \"Fuzzing: The State of the Art\", available here: <br/><a href=\"http://www.dtic.mil/dtic/tr/fulltext/u2/a558209.pdf\" class=\"linkified\">http://www.dtic.mil/dtic/tr/fulltext/u2/a558209.pdf</a></p> <p>The talk will go over the history of fuzzing, different methods of fuzzing, and how fuzzing can be applicable to your everyday life.</p> ","photos":[],"time":1457663400000,"title":"PWL #17: Fuzzing: The State of the Art","url":"https://www.meetup.com/papers-we-love-seattle/events/228753723/","utcOffset":-28800000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"229471493":{"description":"<p>Y'all have called my bluff, we're talking about CRDTs! We'll use \"A comprehensive study of Convergent and Commutative Replicated Data Types.\"</p> <p><a href=\"http://hal.upmc.fr/inria-00555588/document\"><a href=\"http://hal.upmc.fr/inria-00555588/document\" class=\"linkified\">http://hal.upmc.fr/inria-00555588/document</a></a></p> <p>Eventual consistency aims to ensure that replicas of some mutable shared object converge without foreground synchronisation. Previous approaches to eventual consistency are ad-hoc and error-prone. We study a principled approach: to base the design of shared data types on some simple formal conditions that are sufficient to guarantee eventual consistency. We call these types Convergent or Commutative Replicated Data Types (CRDTs). This paper formalises asynchronous object replication, either state based or operation based, and provides a sufficient condition appropriate for each case. It describes several useful CRDTs, including container data types supporting both add and remove operations with clean semantics, and more complex types such as graphs, montonic DAGs, and sequences. It discusses some properties needed to implement non-trivial CRDTs.</p> ","photos":[],"time":1460683800000,"title":"PWL #18: Conflict-Free Replicated Data Types","url":"https://www.meetup.com/papers-we-love-seattle/events/229471493/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"229594574":{"description":"<p>[Hi fellow paper lovers! One of *my* favorite paper-lovers, Pat Helland, is going to be in town later this month, and we talked him into doing a PWL while he's here! It's kind of cheating because he loves a paper that he wrote, but he got shoehorned into this by well-meaning fan-persons without much time to prepare so I'll still count it :)]</p> <p><a href=\"http://www.cidrdb.org/cidr2015/Papers/CIDR15_Paper16.pdf\" class=\"linkified\">http://www.cidrdb.org/cidr2015/Papers/CIDR15_Paper16.pdf</a></p> <p>Abstract:</p> <p>\"There is an inexorable trend towards storing and sending immutable data. We need immutability to coordinate at a distance and we can afford immutability, as storage gets cheaper.</p> <p>This paper is simply an amuse-bouche on the repeated patterns of computing that leverage immutability. Climbing up and down the compute stack really does yield a sense of déjà vu all over again.\"</p> <p>Who is this Pat person?</p> <p>\"Pat Helland has been implementing transaction systems, databases, application platforms, distributed systems, fault-tolerant systems, and messaging systems since 1978. For recreation, he occasionally writes technical papers. He currently works at Salesforce.\"</p> ","photos":[],"time":1459299600000,"title":"PWL #17.5: Immutability Changes Everything","url":"https://www.meetup.com/papers-we-love-seattle/events/229594574/","utcOffset":-25200000,"venue":{"address1":"2001 8th Ave","address2":null,"city":"Seattle","country":"us","lat":47.61586380004883,"lon":-122.3373794555664,"name":"Salesforce.com","postalCode":""}},"230398379":{"description":"<p>Many prior efforts have suggested that Internet video Quality of Experience (QoE) could be dramatically improved by using data-driven prediction of video quality for different choices (e.g., CDN or bitrate) to make optimal decisions. However, building such a prediction system is challenging on two fronts. First, the relationships between video quality and observed session features can be quite complex. Second, video quality changes dynamically. Thus, we need a prediction model that is (a) expressive enough to capture these complex relationships and (b) capable of updating quality predictions in near real-time. Unfortunately, several seemingly natural solutions (e.g., simple machine learning approaches and simple network models) fail on one or more fronts. Thus, the potential benefits promised by these prior efforts remain unrealized. We address these challenges and present the design and implementation of Critical Feature Analytics (CFA). The design of CFA is driven by domain-specific insights that video quality is typically determined by a small subset of critical features whose criticality persists over several tens of minutes. This enables a scalable and accurate workflow where we automatically learn critical features for different sessions on coarse-grained timescales, while updating quality predictions in near real-time. Using a combination of a real-world pilot deployment and trace-driven analysis, we demonstrate that CFA leads to significant improvements in video quality; e.g., 32% less buffering time and 12% higher bitrate than a random decision maker.</p> <p>Paper: <a href=\"https://www.usenix.org/system/files/conference/nsdi16/nsdi16-paper-jiang-junchen.pdf\"><a href=\"https://www.usenix.org/system/files/conference/nsdi16/nsdi16-paper-jiang-junchen.pdf\" class=\"linkified\">https://www.usenix.org/system/files/conference/nsdi16/nsdi16-paper-jiang-junchen.pdf</a></a></p> <p>Presenter: Ankur Chauhan (Sr Software Engineer, Brightcove Inc.)</p> ","photos":[],"time":1463103000000,"title":"PWL #19: CFA: A Practical Prediction System for Video QoE Optimization","url":"https://www.meetup.com/papers-we-love-seattle/events/230398379/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"231024908":{"description":"<p>[Hi friends! For June we're going to try something a little different - two presenters talking about two different papers in a shorter format. I'm excited to see how it works! As usual, if you have a paper you love and would like to present at a future meetup, give me a shout! -d]</p> <p><b>PayWord and MicroMint: Two simple micropayment schemes</b></p> <p>This paper from 2001 written by Ronald Rivest and Adi Shamir (The R and S from RSA) is discussing how to design a micropayments scheme when making one of those was a popular idea. It uses relatively simple cryptography and some neat tricks in order to build systems that solve a complex problem.</p> <p><a href=\"http://people.csail.mit.edu/rivest/RivestShamir-mpay.pdf\" class=\"linkified\">http://people.csail.mit.edu/rivest/RivestShamir-mpay.pdf</a></p> <p>Harley graduated from the University of California, Riverside and has been a developer for the past decade. They are interested in microservices, security, and free software.</p> <p><b>Liquid Haskell</b></p> <p>Liquid Haskell is a type refinement framework which can be loosely described as a more rigorous and mathematical testing framework. It helps provide static guarantees that your code never gets into a \"bad\" state, giving you more freedom to write code. </p> <p>Garrett is a Software Engineer specializing in Java based distributed systems. He is a Haskell coder on the side and has a passion for writing correct but fast code. </p> <p><a href=\"http://goto.ucsd.edu/~rjhala/papers/real_world_liquid.pdf\"><a href=\"http://goto.ucsd.edu/~rjhala/papers/real_world_liquid.pdf\" class=\"linkified\">http://goto.ucsd.edu/~rjhala/papers/real_world_liquid.pdf</a></a></p> <p><b>Remember</b></p> <p>We strictly abide by the <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a> set forth by all PWL charters.</p> ","photos":[],"time":1465522200000,"title":"PWL #20: Liquid Haskell / PayWord and Micromint","url":"https://www.meetup.com/papers-we-love-seattle/events/231024908/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"231423465":{"description":"<p><b>The Paper<br/></b>Scott Francis presents <a href=\"http://web.mit.edu/~axch/www/art.pdf\">The Art of the Propagator</a>. </p> <p>\"We develop a programming model built on the idea that the basic computational elements are autonomous machines interconnected by shared cells through which they communicate. Each machine continuously examines the cells it is interested in, and adds information to some based on deductions it can make from information from the others. This model makes it easy to smoothly combine expression-oriented and constraint-based programming; it also easily accommodates implicit incremental distributed search in ordinary programs.\"</p> <p>We will also be covering some extra material from the <a href=\"http://groups.csail.mit.edu/mac/users/gjs/propagators/\">Revised Report on the Propagator Model</a> , which contains the practical results from implementing the Propagator Model in MIT Scheme.</p> <p><b>Boring Details</b><br/>Thanks to thePlatform for hosting! </p> <p>We are on the 10th floor. Someone will be in the ground floor lobby to let people in the door, and in the 10th floor lobby to see you in.</p> <p><b>A Friendly Post-Script</b><br/>We strictly abide by the <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a> set forth by all PWL charters. Please reach out to one of the organizers if you have any issues or concerns.</p> ","photos":[],"time":1468546200000,"title":"PWL #21: The Art of the Propagator","url":"https://www.meetup.com/papers-we-love-seattle/events/231423465/","utcOffset":-25200000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.605865478515625,"lon":-122.33529663085938,"name":"thePlatform","postalCode":""}},"232475084":{"description":"<p><b>The Main Event: <br/></b><b>Derek Elkins presents</b><a href=\"http://www.cs.cornell.edu/~taozou/sosp13/tangososp.pdf\">Tango: Distributed Data Structures over a Shared Log</a>.</p> <p>```<br/>Distributed systems are easier to build than ever with the emergence of new, data-centric abstractions for storing and computing over massive datasets. However, similar abstractions do not exist for storing and accessing metadata. To fill this gap, Tango provides developers with the abstraction of a replicated, in-memory data structure (such as a map or a tree) backed by a shared log. Tango objects are easy to build and use, replicating state via simple append and read operations on the shared log instead of complex distributed protocols; in the process, they obtain properties such as linearizability, persistence and high availability from the shared log. Tango also leverages the shared log to enable fast transactions across different objects, allowing applications to partition state across machines and scale to the limits of the underlying log without sacrificing consistency.<br/>```</p> <p><b>Where is this going down?</b><br/>Thanks to Whitepages for hosting! Enter the building through the doors on 4th Ave, and head for the elevators in the southwest corner of the building. Suite 1600 is on the 16th floor!</p> <p><b>Please keep in mind:</b><br/>We strictly abide by and enforce the PWL <a href=\"https://github.com/papers-we-love/papers-we-love/blob/master/CODE_OF_CONDUCT.md\">Code of Conduct</a>. Please reach out to one of the organizers if you have any issues or concerns.</p> ","photos":[],"time":1470965400000,"title":"PWL #22: Tango: Distributed Data Structures over a Shared Log","url":"https://www.meetup.com/papers-we-love-seattle/events/232475084/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"233068249":{"description":"<p><b>PWL Mini</b><br/>Tristan Penman presents <a href=\"http://homes.cs.washington.edu/~pedrod/papers/cacm12.pdf\">A Few Useful Things to Know about Machine Learning</a>.</p> <p>At just over eight pages, this paper by Pedro Domingos delivers an approachable summary of some of the challenges and misunderstandings faced by those new to the field of Machine Learning.</p> <p><b>The Main Event</b><br/>David Graunke presents <a href=\"http://foswiki.cs.uu.nl/foswiki/pub/Cco/CourseResources/new_implementation_technique.pdf\">A New Implementation Technique for Applicative Languages</a> from 1979.</p> <p>The paper describes a technique for eliminating bound variables from lambda calculus programs by compiling to a small set of combinators, and describes a machine for executing the resulting combinator programs.</p> <p>This paper is a pretty gentle introduction to the challenges of implementing functional languages in a way that's simple and efficient. The compilation algorithm in the paper is based on a very small set of rewrite rules that makes it easy to understand and implement (and fun to do by hand!).</p> <p><b>Who What Where?</b><br/>Thanks to Whitepages for hosting! Enter the building through the doors on 4th Ave, and head for the elevators in the southwest corner of the building. Suite 1600 is on the 16th floor!</p> <p><b>Keep it Classy</b><br/>We abide by and enforce the PWL <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">Code of Conduct</a>. Please give it a read and involve one of the organizers if you need help.</p> ","photos":[],"time":1473384600000,"title":"PWL #23: A New Implementation Technique for Applicative Languages","url":"https://www.meetup.com/papers-we-love-seattle/events/233068249/","utcOffset":-25200000,"venue":{"address1":"1301 5th Avenue #1600","address2":null,"city":"Seattle","country":"us","lat":47.609004974365234,"lon":-122.33439636230469,"name":"Whitepages","postalCode":"98101"}},"234767068":{"description":"<p><b>PWL Mini</b><br/>David Murray presents <a href=\"https://www.usenix.org/legacy/event/imc05/tech/full_papers/luckie/luckie.pdf\">Inferring and Debugging Path MTU Discovery Failures</a>.</p> <p>The Internet was built on rough consensus and running code, and the code does in fact mostly run. This paper from 2005 discusses one of the edge cases where it doesn't - an edge case that still occasionally bothers Papers We Love presenters named David in 2016.</p> <p><b>The Main Event</b><br/>Denis Rystsov presents <a href=\"https://arxiv.org/pdf/1608.06696v1.pdf\">Flexible Paxos: Quorum intersection revisited</a>.</p> <p>The paper explores how non-standard quorum configurations can improve latency without affecting correctness of a system. In this talk Denis will describe how Paxos works and how Flexible Paxos differs from the other algorithms of the Paxos family.</p> <p><b>Who What Where?</b><br/>Big ups to Comcast for hosting this month! There will be a person at the front door ushering folks up to the 11th Floor for the event. We will have food (of course), again sponsored by Comcast.</p> <p><b>Please Remember</b><br/>As a chapter of Papers We Love, we abide by and enforce the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a> at our events. Please give it a read, plan on conducting yourself accordingly, and involve one of the organizers if you have any concerns.</p> <p><b>Drinks Afterwards</b><br/>Please join us afterwards to have drinks at <a href=\"http://www.sazeracrestaurant.com/\">Sazerac</a> for more conversations over a <a href=\"http://www.sazeracrestaurant.com/menus/menus.htm\">Ravena or two</a>.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/e/f/f/600_456264319.jpeg","width":null}],"time":1478223000000,"title":"PWL #25: Flexible Paxos","url":"https://www.meetup.com/papers-we-love-seattle/events/234767068/","utcOffset":-25200000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.605865478515625,"lon":-122.33529663085938,"name":"thePlatform","postalCode":""}},"235218146":{"description":"<p>It's a two-for-one Paper-loving holiday bonanza!</p> <p><b>Act I</b><br/>Brandon Sherman presents <a href=\"http://www.mimuw.edu.pl/~ajank/papers/Kursa2010.pdf\">Boruta - A System for Feature Selection</a>.</p> <p>\"Machine learning methods are often used to classify objects described by hundreds of attributes; in many applications of this kind a great fraction of attributes may be totally irrelevant to the classification problem. Even more, usually one cannot decide a priori which attributes are relevant. In this paper we present an improved version of the algorithm for identification of the full set of truly important variables in an information system.\"</p> <p><b>Act II</b><br/>Ryan Cox presents &lt;a&gt;Maglev: A Fast and Reliable Software Network Load Balancer&lt;/a&gt;.</p> <p>\"Maglev is Google’s network load balancer. It is a large distributed software system that runs on commodity Linux servers. Unlike traditional hardware network load balancers, it does not require a specialized physical rack deployment, and its capacity can be easily adjusted by adding or removing servers.\"</p> <p><b>Who What Where?</b><br/>Big ups to <a href=\"http://thomasstreet.com/\">Thomas Street</a> for hosting! Show up at 6:30 for food (banh mi and springs rolls) and talking; presentations and discussion of the papers will begin at 7:00.</p> <p><b>Please Remember</b></p> <p>Like all chapters of Papers We Love, we abide by and enforce the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a>. Please give it a read, plan on conducting yourself accordingly, and involve one of the organizers if you have any concerns.</p> ","photos":[],"time":1480645800000,"title":"PWL #26: Boruta && Maglev","url":"https://www.meetup.com/papers-we-love-seattle/events/235218146/","utcOffset":-28800000,"venue":{"address1":"1505 Broadway Ave","address2":null,"city":"Seattle","country":"us","lat":47.61427688598633,"lon":-122.32112884521484,"name":"Thomas Street","postalCode":""}},"235992744":{"description":"<p><b>The Main Event<br/></b>David Murray presents <a href=\"https://www.cs.upc.edu/~diaz/diffie.hellman.pdf\">New Directions in Cryptography</a> and <a href=\"http://people.csail.mit.edu/rivest/Rsapaper.pdf\">A Method for Obtaining Digital Signatures and Public-Key Cryptosystems</a>.</p> <p>These two classic papers are big favorites of mine. New Directions in Cryptography introduced the idea of digital signatures and public key cryptosystems, and reduced both problems to the search for a trap-door one-way permutation. Although Diffie and Hellman were unable to come up with such a permutation (settling for \"just\" Diffie-Hellman-Merkle key exchange), they laid the theoretical framework and invited others to join the search. Rivest, Shamir, and Adleman read the paper, did a lot of hard thinking, and a year later published A Method for Obtaining Digital Signatures and Public-Key Cryptosystems - now known as the RSA algorithm.</p> <p>David works on Infrastructure Security for Salesforce.com.</p> <p><b>Who What Where</b><br/>Big ups to <a href=\"https://www.wework.com/\">WeWork</a> for providing the space and <a href=\"https://trust.salesforce.com/en/security/\">Salesforce</a> for providing the victuals! Enter through the doors on the north corner of the building - they'll be locked by 6:30 (when food starts), but we'll have someone down there to let you in until 7:00 (when discussion of the paper starts).</p> <p><b>And Please Remember</b></p> <p>Like all chapters of Papers We Love, we abide by and enforce the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a>. Please give it a read, plan on conducting yourself accordingly, and involve one of the organizers if you have any concerns.</p> ","photos":[],"time":1483669800000,"title":"PWL #27: New Directions in Cryptography","url":"https://www.meetup.com/papers-we-love-seattle/events/235992744/","utcOffset":-28800000,"venue":{"address1":"1601 5th Ave (11th floor)","address2":null,"city":"Seattle","country":"us","lat":47.61244201660156,"lon":-122.33746337890625,"name":"Salesforce @ WeWork Westlake Tower","postalCode":""}},"236557338":{"description":"<p>We will have &lt;a&gt;Wale Ogundipe&lt;/a&gt; presenting on Quicksort (<a href=\"http://comjnl.oxfordjournals.org/content/5/1/10.full.pdf\">paper link</a>), and &lt;a&gt;Chris Kolodin&lt;/a&gt; presenting on Haskore (<a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.36.8687&amp;rep=rep1&amp;type=pdf\">paper link</a>).</p> <p>Quicksort is one of the most important and ubiquitous algorithms of Computer Science. If you use Google Chrome, you use it. In this short presentation, Walé will summarize the paper and tease out some of its finer points. Please feel free to read the paper ahead of time - it weighs in as 6 pages, so it should be a relatively quick (gah, no pun intended) read.</p> ","photos":[],"time":1486089000000,"title":"PWL #28: Quicksort and Haskore","url":"https://www.meetup.com/papers-we-love-seattle/events/236557338/","utcOffset":-28800000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"237408130":{"description":"<p>Error rates across one of Facebook’s sites were spiking. The problem had first shown up through an automated alert triggered by an in-memory time-series database called Gorilla a few minutes after the problem started. One set of engineers mitigated the immediate issue. A second group set out to find the root cause. They fired up Facebook’s time series correlation engine built on top of Gorilla, and searched for metrics showing a correlation with the errors. This showed that copying a release binary to Facebook’s web servers (a routine event) caused an anomalous drop in memory used across the site</p> <p>Open source version: <a href=\"https://github.com/facebookincubator/beringei\" class=\"linkified\">https://github.com/facebookincubator/beringei</a></p> <p>Lazy people paper summary: <a href=\"https://www.google.com/amp/s/blog.acolyer.org/2016/05/03/gorilla-a-fast-scalable-in-memory-time-series-database/amp/\" class=\"linkified\">https://www.google.com/amp/s/blog.acolyer.org/2016/05/03/gorilla-a-fast-scalable-in-memory-time-series-database/amp/</a></p> <p>Link to the paper: <a href=\"http://www.vldb.org/pvldb/vol8/p1816-teller.pdf\" class=\"linkified\">http://www.vldb.org/pvldb/vol8/p1816-teller.pdf</a></p> <p>Link to slides: <a href=\"https://goo.gl/1dXMxt\"><a href=\"https://goo.gl/1dXMxt\" class=\"linkified\">https://goo.gl/1dXMxt</a></a></p> <p>Food (veg and gluten-free included) and drinks provided!</p> ","photos":[],"time":1488508200000,"title":"PWL #29: Gorilla: A fast, scalable, in-memory time series database","url":"https://www.meetup.com/papers-we-love-seattle/events/237408130/","utcOffset":-28800000,"venue":{"address1":"1505 Broadway Ave","address2":null,"city":"Seattle","country":"us","lat":47.61427688598633,"lon":-122.32112884521484,"name":"Thomas Street","postalCode":""}},"238400445":{"description":"<p><b>The Main Event</b><br/>George Reilly presents <a href=\"http://www.georgevreilly.com/content/LKRhash-for-SoftwarePE.pdf\">LKRhash</a>.</p> <p>LKRhash is a scalable hashtable. It scales to multiple processors and to millions of items. It was invented at Microsoft in the late 90s by Paul Larson, Murali Krishnan, and George Reilly. This talk is based on an unpublished paper that was submitted to <i>Software: Practice &amp; Experience.</i></p> <p><b>Who What Where</b><br/>Big ups to Comcast for hosting this month! There will be a person at the front door ushering folks up to the 11th Floor for the event.</p> <p><b>Please Remember</b><br/>Like all chapters of Papers We Love, we abide by and enforce the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a>. Please give it a read, plan on conducting yourself accordingly, and contact one of the organizers if you need to report an incident.</p> ","photos":[],"time":1491528600000,"title":"PWL #30: LKRhash","url":"https://www.meetup.com/papers-we-love-seattle/events/238400445/","utcOffset":-25200000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"239026973":{"description":"<p>To parse or not to parse: a two-for-one paper-loving showdown!</p> <p><b>David Murray presents <a href=\"http://www.voelter.de/data/pub/projectingModuleFuture.pdf\">Projecting a Modular Future</a></b></p> <p>\"We describe two innovations in programming languages: modularity and projectional editing. Language modularity refers to the ability to combine independently developed languages without changing their respective definitions. A language is not anymore a fixed quantity, instead it can be extended with domain-specific constructs as needed. Projectional editing refers to a technique of building editors and IDEs that avoid the need for parsers. They support a wide range of tightly integrated notations including textual, symbolic, tabular and graphical. In addition, by avoiding parsers, the well-known limitations of grammar composition are avoided as well.\"</p> <p><b>David Graunke presents <a href=\"http://matt.might.net/papers/might2011derivatives.pdf\">Parsing with Derivatives</a></b></p> <p>\"We present a functional approach to parsing unrestricted context-free grammars based on Brzozowski’s derivative of regular expressions. If we consider context-free grammars as recursive regular expressions, Brzozowski’s equational theory extends without modification to context-free grammars (and it generalizes to parser combinators). The supporting actors in this story are three concepts familiar to functional programmers—laziness, memoization and fixed points; these allow Brzozowski’s original equations to be transliterated into purely functional code in about 30 lines spread over three functions.\"<b><br/></b></p> <p><b>Who What Where<br/></b>Big ups to <a href=\"https://thomasstreet.com/\">Thomas Street</a> for hosting! As usual, food and chatting starts at 6:30, papers at 7:00.</p> <p><b>Please Remember<br/></b>Like all chapters of Papers We Love, we abide by and enforce the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a>. Please give it a read, plan on conducting yourself accordingly, and contact one of the organizers if you need to report an incident.</p> ","photos":[],"time":1493947800000,"title":"PWL #31: Projectional Editors and Parsing with Derivatives","url":"https://www.meetup.com/papers-we-love-seattle/events/239026973/","utcOffset":-25200000,"venue":{"address1":"1505 Broadway Ave","address2":null,"city":"Seattle","country":"us","lat":47.61427688598633,"lon":-122.32112884521484,"name":"Thomas Street","postalCode":""}},"239551291":{"description":"<p><a href=\"http://www.kurokoproject.com/about/\">Scott Francis</a> (<a href=\"https://twitter.com/mechazoidal\">@mechazoidal</a>) will be guiding us through two papers on the Styx Architecture. <a href=\"http://doc.cat-v.org/inferno/4th_edition/styx\">The Styx Architecture for Distributed Systems</a> and <a href=\"http://doc.cat-v.org/inferno/4th_edition/styx-on-a-brick/\">Styx-on-a-Brick</a> invented by <a href=\"https://research.google.com/pubs/r.html\">Rob Pike</a> (he invented the <a href=\"https://golang.org/\">Go language</a>) and <a href=\"https://www.bell-labs.com/usr/dmr/www/index.html\">Dennis Ritchie</a> (he co-invented the <a href=\"https://archive.org/details/TheCProgrammingLanguageFirstEdition\">C language</a>).</p> <p>The protocol is effectively <a href=\"https://en.wikipedia.org/wiki/9P_(protocol)\">9P</a> (specifically 9P2000). Pike and Ritchie renamed the protocol after the papers were written to unify with <a href=\"http://www.plan9.bell-labs.com/plan9/index.html\">Plan 9</a>.</p> <p>Here is the abstract to whet your appetite:</p> <p><i>A distributed system is constructed from a set of relatively independent components that form a unified, but geographically and functionally diverse entity. Examples include networked operating systems, Internet services, the national telephone switching system, and in general all the technology using today’s diverse digital networks. Nevertheless, distributed systems remain difficult to design, build, and maintain, primarily because of the lack of a clean, perspicuous interconnection model for the components.</i></p> <p><i>Our experience with two distributed operating systems, Plan 9 and Inferno, encourages us to propose such a model. These systems depend on, advocate, and generally push to the limit a fruitful idea: to present their resources as files in a hierarchical name space. The objects appearing as files may represent stored data, but may also be devices, dynamic information sources, interfaces to services, and control points. The approach unifies and provides basic naming, structuring, and access control mechanisms for all system resources. A simple underlying network protocol, Styx, forms the core of the architecture by presenting a common language for communication within the system.</i></p> <p><i>Even within non-distributed systems, the presentation of services as files advantageously extends a familiar scheme for naming, classifying, and connecting to system resources. More important, the approach provides a natural way to build distributed systems, by using well-known technology for attaching remote file systems. If resources are represented as files, and there are remote file systems, one has a distributed system: resources available in one place are usable from another.</i></p> <p>Make some noise here or in #seattle at <a href=\"https://papersweloveslack.herokuapp.com/\" class=\"linkified\">https://papersweloveslack.herokuapp.com/</a>. It's going to be a good one. See you there!</p> ","photos":[],"time":1496280600000,"title":"PWL #32: The Styx Architecture for Distributed Systems","url":"https://www.meetup.com/papers-we-love-seattle/events/239551291/","utcOffset":-25200000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"240572865":{"description":"<p>We've got another two-for-the-price-of-one paper-loving spectacular!</p> <p><b>Round One</b></p> <p>Brandon Sherman presents <a href=\"https://arxiv.org/pdf/1602.04938v1.pdf\">Why Should I Trust You? Explaining the Predictions of Any Classifier</a>.</p> <p>\"Despite widespread adoption, machine learning models remain mostly black boxes. Understanding the reasons behind predictions is, however, quite important in assessing trust in a model. Trust is fundamental if one plans to take action based on a prediction, or when choosing whether or not to deploy a new model. Such understanding further provides insights into the model, which can be used to turn an untrustworthy model or prediction into a trustworthy one. In this work, we propose LIME, a novel explanation technique that explains the predictions of any classifier in an interpretable and faithful manner, by learning an interpretable model locally around the prediction.\"</p> <p><b>Round Two</b></p> <p>Andrew Beyer presents <a href=\"http://adam.chlipala.net/papers/SqlcachePOPL17/SqlcachePOPL17.pdf\">A Program Optimization for Automatic Database Result Caching</a>.</p> <p>\"Most popular Web applications rely on persistent databases based on languages like SQL for declarative specification of data models and the operations that read and modify them. As applications scale up in user base, they often face challenges responding quickly enough to the high volume of requests. A common aid is caching of database results in the application’s memory space, taking advantage of program-specific knowledge of which caching schemes are sound and useful, embodied in handwritten modifications that make the program less maintainable. These modifications also require nontrivial reasoning about the read-write dependencies across operations. In this paper, we present a compiler optimization that automatically adds sound SQL caching to Web applications coded in the Ur/Web domain-specific functional language, with no modifications required to source code.\"</p> <p><b>Who What Where?<br/></b><br/>Big ups to <a href=\"http://thomasstreet.com/\">Thomas Street</a> for hosting! Show up at 6:30 for food, discussion of the papers starts at 7:00 on the dot.</p> <p><b>Please Remember<br/></b><br/>Be an adult, don't be a jerk. You can find more details in the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a>.</p> ","photos":[],"time":1499391000000,"title":"PWL #33: LIME && Sqlcache","url":"https://www.meetup.com/papers-we-love-seattle/events/240572865/","utcOffset":-25200000,"venue":{"address1":"1505 Broadway Ave","address2":null,"city":"Seattle","country":"us","lat":47.61427688598633,"lon":-122.32112884521484,"name":"Thomas Street","postalCode":""}},"240921517":{"description":"<p>We will be talking about Peter Bailis' 2015 paper \"Feral Concurrency Control.</p> <p><b>Abstract</b></p> <p>The rise of data-intensive “Web 2.0” Internet services has led to a range of popular new programming frameworks that collectively embody the latest incarnation of the vision of Object-Relational Mapping (ORM) systems, albeit at unprecedented scale. In this work, we empirically investigate modern ORM-backed applications’ use and disuse of database concurrency control mechanisms. Specifically, we focus our study on the common use of feral, or application-level, mechanisms for maintaining database integrity, which, across a range of ORM systems, often take the form of declarative correctness criteria, or invariants. We quantitatively analyze the use of these mechanisms in a range of open source applications written using the Ruby on Rails ORM and find that feral invariants are the most popular means of ensuring integrity (and, by usage, are over 37 times more popular than transactions). We evaluate which of these feral invariants actually ensure integrity (by usage, up to 86.9%) and which—due to concurrency errors and lack of database support—may lead to data corruption (the remainder), which we experimentally quantify. In light of these findings, we present recommendations for database system designers for better supporting these modern ORM programming patterns, thus eliminating their adverse effects on application integrity.</p> <p><b>Paper Link</b></p> <p><a href=\"http://www.bailis.org/papers/feral-sigmod2015.pdf\"><a href=\"http://www.bailis.org/papers/feral-sigmod2015.pdf\" class=\"linkified\">http://www.bailis.org/papers/feral-sigmod2015.pdf</a></a></p> <p><b>The Morning Paper Discussion</b></p> <p><a href=\"https://blog.acolyer.org/2015/09/04/feral-concurrency-control-an-empirical-investigation-of-modern-application-integrity/\"><a href=\"https://blog.acolyer.org/2015/09/04/feral-concurrency-control-an-empirical-investigation-of-modern-application-integrity/\" class=\"linkified\">https://blog.acolyer.org/2015/09/04/feral-concurrency-control-an-empirical-investigation-of-modern-application-integrity/</a></a></p> <p><b>SIGMOD '15 Presentation</b></p> <p><a href=\"https://speakerdeck.com/pbailis/feral-concurrency-control-an-empirical-investigation-of-modern-application-integrity\"><a href=\"https://speakerdeck.com/pbailis/feral-concurrency-control-an-empirical-investigation-of-modern-application-integrity\" class=\"linkified\">https://speakerdeck.com/pbailis/feral-concurrency-control-an-empirical-investigation-of-modern-application-integrity</a></a></p> <p><b>Caitie McCaffrey's Distributed Sagas Talk</b></p> <p>This is what inspired us to discuss the paper:</p> <p><a href=\"https://www.youtube.com/watch?v=0UTOLRTwOX0\"><a href=\"https://www.youtube.com/watch?v=0UTOLRTwOX0\" class=\"embedded\">https://www.youtube.com/watch?v=0UTOLRTwOX0</a></a></p> <p>I hope to see you there!</p> ","photos":[],"time":1501723800000,"title":"PWL #34: Feral Concurrency Control","url":"https://www.meetup.com/papers-we-love-seattle/events/240921517/","utcOffset":-25200000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"240921627":{"description":"<p><a href=\"https://twitter.com/victorhurdugaci\">Victor Hurdugaci</a> presents \"<a href=\"https://www.microsoft.com/en-us/research/wp-content/uploads/2016/02/Orleans-MSR-TR-2014-41.pdf\">Orleans: Distributed Virtual Actors for Programmability and Scalability</a>\"</p> <p><i>High-scale interactive services demand high throughput with low latency and high availability, difficult goals to meet with the traditional stateless 3-tier architecture. The actor model makes it natural to build a stateful middle tier and achieve the required performance. However, the popular actor model platforms still pass many distributed systems problems to the developers.</i></p> <p><b>Who What Where? </b></p> <p>Big ups to <a href=\"http://thomasstreet.com/\">Thomas Street</a> for hosting! Show up at 6:30 for food, discussion of the paper starts at 7:00 on the dot.</p> <p><b>Please Remember </b></p> <p>Be an adult, don't be a jerk. You can find more details in the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a>.</p> ","photos":[],"time":1504834200000,"title":"PWL #35: Orleans","url":"https://www.meetup.com/papers-we-love-seattle/events/240921627/","utcOffset":-25200000,"venue":{"address1":"1505 Broadway Ave","address2":null,"city":"Seattle","country":"us","lat":47.61427688598633,"lon":-122.32112884521484,"name":"Thomas Street","postalCode":""}},"242431931":{"description":"<p><b>PWL Mini</b></p> <p>Want to talk about a paper you love (or think is kind of interesting), but not for very long? A PWL Mini is a 10-15 minute opening act, and we've got time for one this month. If you're interested, talk to David and/or Trevor!</p> <p><b>The Main Event</b></p> <p>Morgan Gellert presents <a href=\"https://arxiv.org/pdf/1412.5567.pdf\">Deep Speech</a> and <a href=\"https://arxiv.org/pdf/1512.02595.pdf\">Deep Speech 2</a></p> <p>I will be presenting a brief overview of modern speech recognition. We will discuss the challenges that are latent in the problem, how classical methods addressed the problem, and how modern systems are changing this model. Deep Speech (Hannun et al.) and Deep Speech 2 (Amodei et al.) present a remarkably simpler architecture that achieves massive improvements over previous works. Their work exemplifies how deep learning is taking over traditional methods across the board on recognition tasks. </p> <p><b>Who What Where?</b></p> <p>Big ups to <a href=\"https://www.comcasttechnologysolutions.com/\">Comcast Technology Solutions</a> for hosting this month! There will be a person at the front door letting you in and ushering you up to the 11th floor for the event. Food and chit-chat starts at 6:30, presentations start at 7:00.</p> <p><b>Please Remember</b></p> <p>As a chapter of Papers We Love we abide by and enforce the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a> at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p><b>Stop Slacking</b></p> <p>And join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com/\"><a href=\"https://papersweloveslack.herokuapp.com/\" class=\"linkified\">https://papersweloveslack.herokuapp.com/</a></a>!</p> ","photos":[],"time":1507253400000,"title":"PWL #36: Deep Speech","url":"https://www.meetup.com/papers-we-love-seattle/events/242431931/","utcOffset":-25200000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"243607249":{"description":"<p>Happy (slightly-more-than) three year anniversary, PWL @ Seattle!</p> <p><b>The Main Event</b></p> <p>Caitie McCaffrey presents <a href=\"https://people.csail.mit.edu/alinush/6.824-spring-2015/papers/argus88.pdf\">Distributed Programming in Argus</a></p> <p>\"Argus -- a programming language and system -- was developed to support the implementation and execution of distributed programs. Distribution gives rise to some problems that do not exist in a centralized system, or that exist in a less complex form. For example, a centralized system is either running or crashed, but a distributed system may be partly running and partly crashed. The goal of Argus is to provide mechanisms that make it easier for programmers to cope with these problems.\"</p> <p><a href=\"https://twitter.com/caitie\">Caitie</a> McCaffrey is a Backend Brat and Distributed Systems Diva at Microsoft Research.  Prior to that she was the Tech Lead for the Observability team at Twitter, and also built large scale services and systems that power the entertainment industry at 343 Industries, Microsoft Game Studios, and HBO. She has credits on several video games including Gears of War 2, Gears of War 3, Halo 4, and Halo 5.  She also has a B.S. in Computer Science from Cornell University.</p> <p><b>Who What Where?</b></p> <p>Big ups to <a href=\"https://www.thomasstreet.com/\">Thomas Street</a> for hosting this month! Food and chit-chat starts at 6:30, presentations start at 7:00.</p> <p><b>Please Remember</b></p> <p>As a chapter of Papers We Love we abide by and enforce the <a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\">PWL Code of Conduct</a> at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p><b>Stop Slacking</b></p> <p>And join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com/\"><a href=\"https://papersweloveslack.herokuapp.com/\" class=\"linkified\">https://papersweloveslack.herokuapp.com/</a></a>!</p> ","photos":[],"time":1509672600000,"title":"PWL #37: Argus","url":"https://www.meetup.com/papers-we-love-seattle/events/243607249/","utcOffset":-25200000,"venue":{"address1":"1505 Broadway Ave","address2":null,"city":"Seattle","country":"us","lat":47.61427688598633,"lon":-122.32112884521484,"name":"Thomas Street","postalCode":""}},"244676637":{"description":"<p>PWL Mini:<br/>Ankur Chauhan presents \"LittleTable: A Time-Series Database and Its Uses\"<br/>(<a href=\"https://dl.acm.org/citation.cfm?id=3056102\" class=\"linkified\">https://dl.acm.org/citation.cfm?id=3056102</a>)</p> <p>\"We present LittleTable, a relational database that Cisco Meraki has used since 2008 to store usage statistics, event logs, and other time-series data from our customers’ devices. LittleTable optimizes for time-series data by clustering tables in two dimensions. By partitioning rows by timestamp, it allows quick retrieval of recent measurements without imposing any penalty for retaining older history.\"</p> <p>The Main Event:<br/>Clive Boulton presents \"Robust Composition: Towards a Unified Approach to Access Control and Concurrency Control\"<br/>(<a href=\"http://www.erights.org/talks/thesis/markm-thesis.pdf\" class=\"linkified\">http://www.erights.org/talks/thesis/markm-thesis.pdf</a>)</p> <p>\"When separately written programs are composed so that they may cooperate, they may instead destructively interfere in unanticipated ways. These hazards limit the scale and functionality of the software systems we can successfully compose. This dissertation presents a framework for enabling those interactions between components needed for the cooperation we intend, while minimizing the hazards of destructive interference.\"</p> <p>Big ups to Comcast Technology Solutions (<a href=\"https://www.comcasttechnologysolutions.com\" class=\"linkified\">https://www.comcasttechnologysolutions.com</a>) for hosting this month! Food and chit-chat starts at 6:30, presentations start at 7:00.</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop Slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a></p> ","photos":[],"time":1512700200000,"title":"PWL #38: LittleTable / Robust Composition","url":"https://www.meetup.com/papers-we-love-seattle/events/244676637/","utcOffset":-28800000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"245935599":{"description":"<p>• What we'll do<br/>PWL Mini: FLP impossibility result: <a href=\"https://homes.cs.washington.edu/~arvind/cs425/doc/fischer.pdf\" class=\"linkified\">https://homes.cs.washington.edu/~arvind/cs425/doc/fischer.pdf</a>. Presented by Vaidhy!</p> <p>The main event: Casey presents \"A fast quantum mechanical algorithm for database search.\"<br/>(<a href=\"https://arxiv.org/pdf/quant-ph/9605043.pdf\" class=\"linkified\">https://arxiv.org/pdf/quant-ph/9605043.pdf</a>)</p> <p>\"Imagine a phone directory containing N names arranged in completely random order. In order to find someone's phone number with a probability of 1/2, any classical algorithm (whether deterministic or probabilistic) will need to look at a minimum of N/2 names. Quantum mechanical systems can be in a superposition of states and simultaneously examine multiple names. By properly adjusting the phases of various operations, successful computations reinforce each other while others interfere randomly. As a result, the desired phone number can be obtained in only O(sqrt(N)) steps. The algorithm is within a small constant factor of the fastest possible quantum mechanical algorithm.\"</p> <p>Big ups to Comcast Technology Solutions (<a href=\"https://www.comcasttechnologysolutions.com\" class=\"linkified\">https://www.comcasttechnologysolutions.com</a>) for hosting this month!</p> <p>• What to bring</p> <p>• Important to know<br/>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop Slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> ","photos":[],"time":1515121200000,"title":"PWL #39: Grover's Algorithm","url":"https://www.meetup.com/papers-we-love-seattle/events/245935599/","utcOffset":-28800000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"246771362":{"description":"<p>PWL Mini:<br/>Vaidhy presents the FLP impossibility result<br/>(<a href=\"https://homes.cs.washington.edu/~arvind/cs425/doc/fischer.pdf\" class=\"linkified\">https://homes.cs.washington.edu/~arvind/cs425/doc/fischer.pdf</a>)</p> <p>“The consensus problem involves an asynchronous system of processes, some of which may be unreliable. The problem is for the reliable processes to agree on a binary value. In this paper, it is shown that every protocol for this problem has the possibility of nontermination, even with only one faulty process. By way of contrast, solutions are known for the synchronous case, the “Byzantine Generals” problem.” The Main Event:<br/>John presents Bitcoin: A Peer-to-Peer Electronic Cash System<br/>(<a href=\"https://bitcoin.org/bitcoin.pdf\" class=\"linkified\">https://bitcoin.org/bitcoin.pdf</a>)</p> <p>\"A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution. Digital signatures provide part of the solution, but the main benefits are lost if a trusted third party is still required to prevent double-spending. We propose a solution to the double-spending problem using a peer-to-peer network. The network timestamps transactions by hashing them into an ongoing chain of hash-based proof-of-work, forming a record that cannot be changed without redoing the proof-of-work. The longest chain not only serves as proof of the sequence of events witnessed, but proof that it came from the largest pool of CPU power. As long as a majority of CPU power is controlled by nodes that are not cooperating to attack the network, they'll generate the longest chain and outpace attackers.\"</p> <p>Big ups to Comcast Technology Solutions (<a href=\"https://www.comcasttechnologysolutions.com\" class=\"linkified\">https://www.comcasttechnologysolutions.com</a>) for hosting!</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop Slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> ","photos":[],"time":1515897000000,"title":"PWL #40: FLP and Bitcoin","url":"https://www.meetup.com/papers-we-love-seattle/events/246771362/","utcOffset":-28800000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"246796632":{"description":"<p>PWL Mini:<br/>Vaidhy presents the FLP impossibility result<br/>(<a href=\"https://homes.cs.washington.edu/~arvind/cs425/doc/fischer.pdf\" class=\"linkified\">https://homes.cs.washington.edu/~arvind/cs425/doc/fischer.pdf</a>)</p> <p>“The consensus problem involves an asynchronous system of processes, some of which may be unreliable. The problem is for the reliable processes to agree on a binary value. In this paper, it is shown that every protocol for this problem has the possibility of nontermination, even with only one faulty process. By way of contrast, solutions are known for the synchronous case, the “Byzantine Generals” problem.”</p> <p>The Main Event:<br/>John presents Bitcoin: A Peer-to-Peer Electronic Cash System<br/>(<a href=\"https://bitcoin.org/bitcoin.pdf\" class=\"linkified\">https://bitcoin.org/bitcoin.pdf</a>)</p> <p>\"A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution. Digital signatures provide part of the solution, but the main benefits are lost if a trusted third party is still required to prevent double-spending. We propose a solution to the double-spending problem using a peer-to-peer network. The network timestamps transactions by hashing them into an ongoing chain of hash-based proof-of-work, forming a record that cannot be changed without redoing the proof-of-work. The longest chain not only serves as proof of the sequence of events witnessed, but proof that it came from the largest pool of CPU power. As long as a majority of CPU power is controlled by nodes that are not cooperating to attack the network, they'll generate the longest chain and outpace attackers.\"</p> <p>Big ups to Comcast Technology Solutions (<a href=\"https://www.comcasttechnologysolutions.com\" class=\"linkified\">https://www.comcasttechnologysolutions.com</a>) for hosting!</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop Slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> ","photos":[],"time":1517538600000,"title":"PWL #40: FLP and Bitcoin","url":"https://www.meetup.com/papers-we-love-seattle/events/246796632/","utcOffset":-28800000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"247794436":{"description":"<p>• What we'll do</p> <p>George Reilly presents Meltdown and Spectre</p> <p><a href=\"https://meltdownattack.com/meltdown.pdf\" class=\"linkified\">https://meltdownattack.com/meltdown.pdf</a><br/><a href=\"https://spectreattack.com/spectre.pdf\" class=\"linkified\">https://spectreattack.com/spectre.pdf</a><br/><a href=\"https://googleprojectzero.blogspot.com/2018/01/reading-privileged-memory-with-side.html\" class=\"linkified\">https://googleprojectzero.blogspot.com/2018/01/reading-privileged-memory-with-side.html</a></p> <p>On January 3rd, we learned about Meltdown and Spectre, serious flaws in computer hardware that lead to side-channel attacks against privileged memory through flaws in speculative execution.</p> <p>“Meltdown exploits side effects of out-of-order execution on modern processors to read arbitrary kernel-memory locations including personal data and passwords. Out-of-order execution is an indispensable performance feature and present in a wide range of modern processors. The attack is independent of the operating system, and it does not rely on any software vulnerabilities. Meltdown breaks all security assumptions given by address space isolation as well as paravirtualized environments and, thus, every security mechanism building upon this foundation.”</p> <p>“Spectre attacks involve inducing a victim to speculatively perform operations that would not occur during correct program execution and which leak the victim’s confidential information via a side channel to the adversary.”</p> <p>• Important to know</p> <p>Big ups to Microsoft for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/c/0/2/600_468903074.jpeg","width":null}],"time":1519957800000,"title":"PWL #41: Spectre and Meltdown","url":"https://www.meetup.com/papers-we-love-seattle/events/247794436/","utcOffset":-28800000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"248119134":{"description":"<p>• What we'll do<br/>PWL mini:<br/>David Murray presents NL2Bash: A Corpus and Semantic Parser for Natural Language Interface to the Linux Operating System<br/>(<a href=\"https://arxiv.org/pdf/1802.08979.pdf\" class=\"linkified\">https://arxiv.org/pdf/1802.08979.pdf</a>)<br/>\"We present new data and semantic parsing methods for the problem of mapping English sentences to Bash commands (NL2Bash). Our long-term goal is to enable any user to perform operations such as file manipulation, search, and application-specific scripting by simply stating their goals in English. We take a first step in this domain, by providing a new dataset of challenging but commonly used Bash commands and expert-written English descriptions, along with baseline methods to establish performance levels on this task.\"</p> <p>Main Event<br/>Max Payton present Blossom V: A new implementation of a minimum cost perfect matching algorithm<br/>(<a href=\"https://pub.ist.ac.at/~vnk/papers/blossom5.pdf\" class=\"linkified\">https://pub.ist.ac.at/~vnk/papers/blossom5.pdf</a>)<br/>\"We describe a new implementation of the Edmonds’s algorithm for computing a perfect matching of minimum cost, to which we refer as Blossom V. A key feature of our implementation is a combination of two ideas that were shown to be effective for this problem: the “variable dual updates” approach of Cook and Rohe and the use of priority queues.\"</p> <p>Dinner will be provided! You'll be asked for info on any dietary restrictions you have during the RSVP which we'll reference when figuring out what to serve, so please let us know!</p> <p>• Important to know</p> <p>Big ups to Twilio for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/4/d/b/600_468917627.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/4/d/c/600_468917628.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/4/4/d/e/600_468917630.jpeg","width":null}],"time":1522978200000,"title":"PWL #42: Blossom V and NL2Bash","url":"https://www.meetup.com/papers-we-love-seattle/events/248119134/","utcOffset":-25200000,"venue":{"address1":"999 Third Ave. Suite 700. Seattle, WA 98104","address2":null,"city":"Seattle","country":"us","lat":47.60498046875,"lon":-122.3342514038086,"name":"Surf Incubator","postalCode":""}},"249903928":{"description":"<p>• What we'll do<br/>Main Event<br/>Immad Naseer present \"Paxos from the ground up\"</p> <p>Consensus protocols are at the heart of most distributed systems and<br/>Paxos is one of the more widely used of such protocols. Instead of<br/>introducing Paxos with all its subtle details from the get-go, we'll<br/>instead derive the protocol step by step, starting with the simplest<br/>algorithm which comes to mind and then repeatedly refining it together<br/>till we finally reach the actual protocol. This will allow you to<br/>better appreciate its simplicity and beauty and use this important<br/>building block with more confidence and understanding in your next<br/>distributed systems project.</p> <p>Dinner will be provided! If you have any dietary restrictions, please send a message to the organizers ASAP</p> <p>• Important to know</p> <p>Big ups to Microsoft Reactor for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> ","photos":[],"time":1525397400000,"title":"PWL #43: Paxos from the ground up","url":"https://www.meetup.com/papers-we-love-seattle/events/249903928/","utcOffset":-25200000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"250977718":{"description":"<p>• What we'll do<br/>PWL mini:<br/>Brandon Sherman presents Tidy Data<br/>(<a href=\"http://vita.had.co.nz/papers/tidy-data.pdf\" class=\"linkified\">http://vita.had.co.nz/papers/tidy-data.pdf</a>)<br/>A huge amount of effort is spent cleaning data to get it ready for analysis, but there has been little research on how to make data cleaning as easy and effective as possible. This paper tackles a small, but important, component of data cleaning: data tidying. Tidy datasets are easy to manipulate, model and visualize, and have a specific structure:<br/>each variable is a column, each observation is a row, and each type of observational unit is a table. This framework makes it easy to tidy messy datasets because only a small set of tools are needed to deal with a wide range of un-tidy datasets. This structure also makes it easier to develop tidy tools for data analysis, tools that both input and output tidy datasets. The advantages of a consistent data structure and matching tools are demonstrated with a case study free from mundane data manipulation chores.<br/>The TL;DR is data should be organized in a way such that every row corresponds to an observation and every column corresponds to a variable.</p> <p>Main Event:<br/>Mohannad Elhamod presents Efficient Determination of Dynamic Split Points in a Decision Tree<br/>(<a href=\"https://www.microsoft.com/en-us/research/wp-content/uploads/2016/12/splits.pdf\" class=\"linkified\">https://www.microsoft.com/en-us/research/wp-content/uploads/2016/12/splits.pdf</a>)<br/>\"We consider the problem of choosing split points for continuous predictor variables in a decision tree. Previous approaches<br/>to this problem typically either (1) discretize the<br/>continuous predictor values prior to learning or (2) apply<br/>a dynamic method that considers all possible split points<br/>for each potential split. In this paper, we describe a number<br/>of alternative approaches that generate a small number<br/>of candidate split points dynamically with little overhead.<br/>We argue that these approaches are preferable to<br/>pre-discretization, and provide experimental evidence that<br/>they yield probabilistic decision trees with the same prediction<br/>accuracy as the traditional dynamic approach. Furthermore,<br/>because the time to grow a decision tree is proportional<br/>to the number of split points evaluated, our approach<br/>is significantly faster than the traditional dynamic<br/>approach.\"</p> <p>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Microsoft Reactor for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1528421400000,"title":"PWL #44: Dynamic Split Points in a Decision Tree","url":"https://www.meetup.com/papers-we-love-seattle/events/250977718/","utcOffset":-25200000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"252145950":{"description":"<p>• What we'll do<br/>PWL mini:<br/>Finallizing</p> <p>Main Event:<br/>Trevor Lalish-Menagh presents Boss Competence and Worker Well-Being<br/>(<a href=\"https://www.researchgate.net/publication/268491675_Boss_Competence_and_Worker_Well-Being\" class=\"linkified\">https://www.researchgate.net/publication/268491675_Boss_Competence_and_Worker_Well-Being</a>)<br/>\"Nearly all workers have a supervisor or ‘boss’. Yet there is almost no published research by economists into how bosses affect the quality of employees’ lives. This study offers some of the first formal evidence. First, it is shown that a boss’s technical competence is the single strongest predictor of a worker’s well-being. Second, we examine equivalent instrumental-variable results. Third, we demonstrate longitudinally that even if a worker stays in the same job and workplace then a newly competent supervisor greatly improves the worker’s well-being. Finally, we discuss analytical possibilities, and consider necessary future research. \"</p> <p>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Microsoft Reactor for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1530840600000,"title":"PWL #45: Boss Competence and Worker Well-Being","url":"https://www.meetup.com/papers-we-love-seattle/events/252145950/","utcOffset":-25200000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"253503024":{"description":"<p>PWL Mini:</p> <p>Maybe you! (10-15 minutes to talk about a paper YOU love)</p> <p>The Main Event:</p> <p>The paper that caught my attention is is Keys Under Doormats a paper published in November of 2015 that was co-authored by Susan Landau, Peter G. Neumann, Whitfield Diffie, et. al.</p> <p>This paper is the most recent of a series of scholarly papers which discusses the risks to the general public that are created when the U.S. Government requests or issues mandates for technology changes to provide \"greater security\".</p> <p>These papers published going back to at least 1994 discuss the trade offs between the desired result, the privacy of individuals and the overall reliability of the targeted technology (such as cell phones, internet traffic, etc.) I found the cycle of mandates and responses to be quite complex and compelling. There are many actions and consequences that are non-obvious at first glance and these papers do a good job of explaining these relationships.</p> <p>Other papers that enter into this dicussion are:</p> <p>National Security on the Line, May 2006<br/>The Real National-Security Needs for VoIP, November 2005<br/>Codes, Keys and Conflicts: Issues in U.S. Crypto Policy, June 1994</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/7/a/2/600_474382434.jpeg","width":null},{"height":null,"url":"https://secure.meetupstatic.com/photos/event/5/7/a/b/600_474382443.jpeg","width":null}],"time":1536283800000,"title":"PWL #47: Keys Under Doormats","url":"https://www.meetup.com/papers-we-love-seattle/events/253503024/","utcOffset":-25200000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"283686526":{"description":"<p>Details</p> <p>• What we'll do: We will chat about future paper discussions we want to have and plan out what we are thinking about for the upcoming year! Please join us and help us get organized!</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1643941800000,"title":"Papers We Love @ Seattle General Chat","url":"https://www.meetup.com/papers-we-love-seattle/events/283686526/","utcOffset":-28800000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"283704673":{"description":"<p>Details</p> <p>• What we'll do: Max Payton will be leading a discussion on Cynthia Dwork's Differential Privacy paper!</p> <p>Abstract</p> <p>In 1977 Dalenius articulated a desideratum for statistical<br/>databases: nothing about an individual should be learnable from the<br/>database that cannot be learned without access to the database. We give a general impossibility result showing that a formalization of Dalenius’ goal along the lines of semantic security cannot be achieved. Contrary to intuition, a variant of the result threatens the privacy even of someone not in the database. This state of affairs suggests a new measure, differential privacy, which, intuitively, captures the increased risk to one’s privacy incurred by participating in a database.</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1646361000000,"title":"A discussion on Differential Privacy","url":"https://www.meetup.com/papers-we-love-seattle/events/283704673/","utcOffset":-28800000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"284414867":{"description":"<p>Details</p> <p>• What we'll do: Aaron will be leading a discussion on Leemon Baird's Swirlds paper!</p> <p>Abstract</p> <p>A new system, the Swirlds hashgraph consensus algorithm, is proposed for replicated state machines with guaranteed Byzantine fault tolerance. It achieves fairness, in the sense that it is difficult for an attacker to manipulate which of two transactions will be chosen to be first in the consensus order. It has complete asynchrony, no leaders, no round robin, no proof-of-work, eventual consensus with probability one, and high speed in the absence of faults. It is based on a gossip protocol, in which the participants don’t just gossip about transactions. They gossip about gossip. They jointly build a hashgraph reflecting all of the gossip events. This allows Byzantine agreement to be achieved through virtual voting. Alice does not send Bob a vote over the Internet. Instead, Bob calculates what vote Alice would have sent, based on his knowledge of what Alice knows. This yields fair Byzantine agreement on a total order for all transactions, with very little communication overhead beyond the transactions themselves.<br/>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/8/1/3/600_503222067.jpeg","width":null}],"time":1649381400000,"title":"THE SWIRLDS HASHGRAPH CONSENSUS ALGORITHM: FAIR, FAST, BYZANTINE FAULT TOLERANCE","url":"https://www.meetup.com/papers-we-love-seattle/events/284414867/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"285687126":{"description":"<p>Details</p> <p>• What we'll do: Scott will be presenting on [A Compiler for 3D Machine Knitting!](<a href=\"https://la.disneyresearch.com/publication/machine-knitting-compiler/\" class=\"linkified\">https://la.disneyresearch.com/publication/machine-knitting-compiler/</a>)</p> <p>Abstract</p> <p>Industrial knitting machines can produce finely detailed, seamless, 3D surfaces quickly and without human intervention. However, the tools used to program them require detailed manipulation and understanding of low-level knitting operations. We present a compiler that can automatically turn assemblies of high-level shape primitives (tubes, sheets) into low-level machine instructions. These high-level shape primitives allow knit objects to be scheduled, scaled, and otherwise shaped in ways that require thousands of edits to low-level instructions. At the core of our compiler is a heuristic transfer planning algorithm for knit cycles, which we prove is both sound and complete. This algorithm enables the translation of high-level shaping and scheduling operations into needle-level operations. We show a wide range of examples produced with our compiler and demonstrate a basic visual design interface that uses our compiler as a backend.</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1651800600000,"title":"A Compiler for 3D Machine Knitting","url":"https://www.meetup.com/papers-we-love-seattle/events/285687126/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"286127692":{"description":"<p>Details</p> <p>• What we'll do: Trevor will be presenting on [Grammars for Free: Toward Grammar Inference for Ad Hoc Parsers](<a href=\"https://arxiv.org/pdf/2202.01021.pdf\" class=\"linkified\">https://arxiv.org/pdf/2202.01021.pdf</a>)</p> <p>Abstract</p> <p>Ad hoc parsers are everywhere: they appear any time a string is split, looped over, interpreted, transformed, or otherwise processed. Every ad hoc parser gives rise to a language: the possibly infinite set of input strings that the program accepts without going wrong. Any language can be described by a formal grammar: a finite set of rules that can generate all strings of that language. But programmers do not write grammars for ad hoc parsers—even though they would be eminently useful. Grammars can serve as documentation, aid program comprehension, generate test inputs, and allow reasoning about language-theoretic security. We propose an automatic grammar inference system for ad hoc parsers that would enable all of these use cases, in addition to opening up new possibilities in mining software repositories and bi-directional parser synthesis.</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1654219800000,"title":"Grammars for Free: Toward Grammar Inference for Ad Hoc Parsers","url":"https://www.meetup.com/papers-we-love-seattle/events/286127692/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"287040688":{"description":"<p>Details</p> <p>• What we'll do: Max will be presenting on [A brief history of data visualization](<a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.69.4737&amp;rep=rep1&amp;type=pdf\" class=\"linkified\">http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.69.4737&amp;rep=rep1&amp;type=pdf</a>)</p> <p>Abstract</p> <p>It is common to think of statistical graphics and data visualization as relatively modern developments in statistics. In fact, the graphic representation of quantitative information has deep roots. These roots reach into the histories of the earliest map-making and visual depiction, and later into thematic cartography, statistics and statistical graphics, medicine, and other fields. Along the way, developments in technologies (printing, reproduction) mathematical theory and practice, and empirical observation and recording, enabled the wider use of graphics and new advances in form and content. This chapter provides an overview of the intellectual history of data visualization from medieval to modern times, describing and illustrating some significant advances along the way. It is based on a project, called the Milestones Project, to collect, catalog and document in one place the important developments in a wide range of areas and fields that led to modern data visualization. This effort has suggested some questions of the use of present-day methods to analyze and understand this history, that I discuss under the rubric of “statistical historiography.”</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1657243800000,"title":"A brief history of data visualization","url":"https://www.meetup.com/papers-we-love-seattle/events/287040688/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"287553161":{"description":"<p>Details</p> <p>• What we'll do: Aaron will be presenting on [Merkle Search Trees: Efficient State-Based CRDTs in Open Networks Alex Auvolat, François Taïani](<a href=\"https://hal.inria.fr/hal-02303490/document\" class=\"linkified\">https://hal.inria.fr/hal-02303490/document</a>)</p> <p>Abstract</p> <p>Most recent CRDT techniques rely on a causal broadcast primitive to provide guarantees on the delivery of operation deltas. Such a primitive is unfortunately hard to implement efficiently in large open networks, whose membership is often difficult to track. As an alternative, we argue in this paper that pure state-based CRDTs can be efficiently implemented by encoding states as specialized Merkle trees, and that this approach is well suited to open networks where many nodes may join and leave. At the core of our contribution lies a new kind of Merkle tree, called Merkle Search Tree (MST), that implements a balanced search tree while maintaining key ordering. This latter property makes it particularly efficient in the case of updates on sets of sequential keys, a common occurrence in many applications. We use this new data structure to implement a distributed event store, and show its efficiency in very large systems with low rates of updates. In particular, we show that in some scenarios our approach is able to achieve both a 66% reduction of bandwidth cost over a vector-clock approach, as well as a 34% improvement in consistency level. We finally suggest other uses of our construction for distributed databases in open networks.</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1659663000000,"title":"Merkle Search Trees: Efficient State-Based CRDTs in Open Networks","url":"https://www.meetup.com/papers-we-love-seattle/events/287553161/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"288927143":{"description":"<p>Details</p> <p>• What we'll do: Max will be presenting on [A Fast File System for Unix](<a href=\"https://people.eecs.berkeley.edu/~brewer/cs262/FFS.pdf\" class=\"linkified\">https://people.eecs.berkeley.edu/~brewer/cs262/FFS.pdf</a>)</p> <p>Abstract</p> <p>A reimplementation of the UNIX file system is described. The reimplementation provides substantially higher throughput rates by using more flexible allocation policies that allow better locality of reference and can be adapted to a wide range of peripheral and processor characteristics. The new file system clusters data that is sequentially accessed and provides two block sizes to allow fast access to large files while not wasting large amounts of space for small files. File access rates of up to ten times faster than the traditional UNIX file system are experienced. Long needed enhancements to the programmers’ interface are discussed. These include a mechanism to place advisory locks on files, extensions of the name space across file systems, the ability to use long file names, and provisions for administrative control of resource usage.</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1665106200000,"title":"PWL Seattle: A Fast File System for UNIX","url":"https://www.meetup.com/papers-we-love-seattle/events/288927143/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"cggkvqyzgbgb":{"description":"<p>• What we'll do<br/>Main Event:<br/>Ankur Kalra: \"GAN Dissection\":</p> <p><a href=\"https://arxiv.org/abs/1811.10597\" class=\"linkified\">https://arxiv.org/abs/1811.10597</a></p> <p>This is a really interesting paper with neat results, and it takes a rigorous and principled approach to interpretability in ML (at least, in the vision domain). It's also one of my favorite papers from 2018.</p> <p>I'll cover some of the motivations, previous/related work, and some of the key ideas in the paper. This particular conversation will be mostly focused on providing an intuitive understanding instead of a rigorous mathematical understanding (at least during the talk itself). No prior machine learning experience will be necessary to follow along.</p> <p>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Lyft for hosting this month!</p> <p>Unfortunately, in order to host at Lyft, we need to email you an NDA form, so we need to collect emails. If you wish to attend, please send your email to Max Payton as a private message, and you'll get an NDA to sign. It's become very hard to find a place to use in Seattle proper, which is why last month had to be canceled, and I understand if this is too much to ask of anyone.</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1554427800000,"title":"PWL #52: GAN Dissection","url":"https://www.meetup.com/papers-we-love-seattle/events/cggkvqyzgbgb/","utcOffset":-25200000,"venue":{"address1":"83 S King St","address2":null,"city":"Seattle","country":"us","lat":47.59795379638672,"lon":-122.33494567871094,"name":"83 S King St","postalCode":"98104"}},"fpglbryzjbjb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: Polynomial-Time Algorithms for Prime Factorization<br/>and Discrete Logarithms on a Quantum Computer - Daniel Muldrew<br/>(<a href=\"https://arxiv.org/pdf/quant-ph/9508027.pdf\" class=\"linkified\">https://arxiv.org/pdf/quant-ph/9508027.pdf</a>)</p> <p>\"A digital computer is generally believed to be an efficient universal computing device; that is, it is believed able to simulate any physical computing device with an increase in computation time by at most a polynomial factor. This may not be true when quantum mechanics is taken into consideration. This paper considers factoring integers and finding discrete logarithms, two problems which are generally thought to be hard on a classical computer and which have been used as the basis of several proposed cryptosystems. Efficient randomized algorithms are given for these two problems on a hypothetical quantum computer. These algorithms take a number of steps polynomial in the input size, e.g., the number of digits of the integer to be factored.\"</p> <p>• Important to know</p> <p>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1559871000000,"title":"PWL #54:  Prime Factorization on Quantum Computers","url":"https://www.meetup.com/papers-we-love-seattle/events/fpglbryzjbjb/","utcOffset":-25200000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"fpglbryzlbcb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: Eric Hopper will present \"New directions in cryptography\" (<a href=\"https://ee.stanford.edu/~hellman/publications/24.pdf\" class=\"linkified\">https://ee.stanford.edu/~hellman/publications/24.pdf</a>) and \"A method for obtaining digital signatures and public-key cryptosystems\" (<a href=\"https://people.csail.mit.edu/rivest/Rsapaper.pdf\" class=\"linkified\">https://people.csail.mit.edu/rivest/Rsapaper.pdf</a>), a classic paper month covering RSA and diffie-hellman encryption<br/>• Important to know<br/>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1564709400000,"title":"PWL #55: \"New directions in cryptography\" Difie-Hellman and RSA","url":"https://www.meetup.com/papers-we-love-seattle/events/fpglbryzlbcb/","utcOffset":-25200000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"mqmvvqyzhbdb":{"description":"<p>• What we'll do<br/>Main Event: Toxic Workers by Max Payton</p> <p><a href=\"http://www.hbs.edu/faculty/Publication%20Files/16-057_d45c0b4f-fa19-49de-8f1b-4b12fe054fea.pdf\" class=\"linkified\">http://www.hbs.edu/faculty/Publication%20Files/16-057_d45c0b4f-fa19-49de-8f1b-4b12fe054fea.pdf</a></p> <p>Abstract:<br/>\"While there has been a strong focus in past research on discovering and developing top performers in the workplace, less attention has been paid to the question of how to manage those workers on the opposite side of the spectrum: those who are harmful to organizational performance. In extreme cases, aside from hurting performance, such workers can generate enormous regulatory and legal fees and liabilities for the firm. We explore a large novel dataset of over 50,000 workers across 11 firms to document a variety of aspects of worker characteristics and circumstances that lead them to engage in what we call \"toxic\" behavior.<br/>We also explore the relationship between toxicity and productivity, and the ripple effect that a toxic worker has on her peers. Finally, we find that avoiding a toxic worker (or converting him to an average worker) enhances performance to a much greater extent than replacing an average worker with a superstar worker.\"</p> <p>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1556847000000,"title":"PWL #53: Toxic Workers","url":"https://www.meetup.com/papers-we-love-seattle/events/mqmvvqyzhbdb/","utcOffset":-25200000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfrybccbdb":{"description":"<p>Details<br/>\"The Properties and Promises of UTF-8\", by Martin J. Dürst (1997).</p> <p>Presented by Marvin Humphrey.</p> <p>OVERVIEW:</p> <p>Created by Ken Thompson one night in September 1992 on a placemat in a New Jersey diner, UTF-8 is a spectacular quintuple bank shot of design: optimal across so many criteria that it's hard to believe anybody could pull it off.</p> <p>Over the years, UTF-8 has increasingly eclipsed all of the alternatives. UTF-1 and UTF-7 are obsolete and only of historical interest; UTF-32 has limited practical utility; UCS-2 can't express all of Unicode... the only serious competitor remaining is UTF-16, but UTF-8 has continued to gain market share.</p> <p>In 1997, Martin J. Dürst gave a talk at the 11th International Unicode Conference in San Jose on \"The Properties and Promises of UTF-8\". Two decades later at Papers We Love San Diego, we will review those marvelous properties and contemplate all of the promises that UTF-8 has fulfilled.</p> <p>DOWNLOAD:</p> <p><a href=\"https://www.sw.it.aoyama.ac.jp/2012/pub/IUC11-UTF-8.pdf\" class=\"linkified\">https://www.sw.it.aoyama.ac.jp/2012/pub/IUC11-UTF-8.pdf</a></p> <p>SLIDES:</p> <p><a href=\"http://www.rectangular.com/preso-utf8-props-promises.pdf\" class=\"linkified\">http://www.rectangular.com/preso-utf8-props-promises.pdf</a></p> <p>AUXILIARY MATERIALS:</p> <p>Here is a Rob Pike email from 2003 describing the scene in the diner, along with historical emails from Ken Thompson in 1992 articulating some of the design criteria for UTF-8:</p> <p><a href=\"http://doc.cat-v.org/bell_labs/utf-8_history\" class=\"linkified\">http://doc.cat-v.org/bell_labs/utf-8_history</a></p> <p>SOME ADVICE ON READING THE PAPER:</p> <p>Dürst's \"paper\" is really the transcription of a talk. Each page consists of a slide at the top, accompanied by text transcribing the presenter's narration over that slide. As a result, while the paper is 26 pages, it is not dense.</p> <p>A significant portion of the paper is dedicated to heuristic detection of UTF-8. We will simply accept that heuristic detection of UTF-8 works very well — so feel free to gloss over the details of the heuristic algorithm.</p> <p>If you don't have time to read the paper, contemplate the six design criteria enumerated by Ken Thompson in his 1992 email:</p> <p>1) Compatibility with historical file systems: Historical file systems disallow the null byte and the ASCII slash character as a part of the file name.</p> <p>2) Compatibility with existing programs: The existing model for multibyte processing is that ASCII does not occur anywhere in a multibyte encoding. There should be no ASCII code values for any part of a transformation format representation of a character that was not in the ASCII character set in the UCS representation of the character.</p> <p>3) Ease of conversion from/to UCS.</p> <p>4) The first byte should indicate the number of bytes to follow in a multibyte sequence.</p> <p>5) The transformation format should not be extravagant in terms of number of bytes used for encoding.</p> <p>6) It should be possible to find the start of a character efficiently starting from an arbitrary location in a byte stream.</p> <p>In addition consider the following three properties of UTF-8:</p> <p>A) Although UTF-8 is inefficient for CJK (Chinese Japanese Korean) texts compared with UTF-16, for CJK HTML documents that inefficiency is offset by UTF-8's efficiency in encoding HTML markup. This characteristic has been key to UTF-8's dominance as a web encoding.</p> <p>B) Unlike UTF-16 (and UTF-32), UTF-8 has no big-endian and little-endian<br/>variants, and thus does not need a Byte Order Mark.</p> <p>C) UTF-8 byte sequences sort in the same order as their corresponding expanded strings sorted in Unicode code point order.</p> <p>Big ups to Comcast for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1578018600000,"title":"PWL #60: The Properties and Promises of UTF-8","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrybccbdb/","utcOffset":-28800000,"venue":{"address1":"1000 2nd Ave","address2":null,"city":"Seattle","country":"us","lat":47.605865478515625,"lon":-122.33529663085938,"name":"Comcast Technology Solutions","postalCode":"98104"}},"rbfqfrybcdbjb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: Zachary New will present Backpropagation applied to handwritten zip code recognition (<a href=\"http://yann.lecun.com/exdb/publis/pdf/lecun-89e.pdf\" class=\"linkified\">http://yann.lecun.com/exdb/publis/pdf/lecun-89e.pdf</a>)</p> <p>The ability of learning networks to generalize can be greatly enhanced by providing constraints from the task domain. This paper demonstrates how such constraints can be integrated into a backpropagation network through the architecture of the network. This approach has been successfully applied to the recognition of handwritten zip code digits provided by the U.S. Postal Service. A single network learns the entire recognition operation, going from the normalized image of the character to the final classification.</p> <p>• Important to know</p> <p>Big ups to Create33 and Vanessa for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[{"height":null,"url":"https://secure.meetupstatic.com/photos/event/9/8/2/2/600_488798946.jpeg","width":null}],"time":1581042600000,"title":"PWL #61: Backpropagation applied to handwritten zip code recognition","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrybcdbjb/","utcOffset":-28800000,"venue":{"address1":"999 3rd Ave","address2":null,"city":"Seattle","country":"us","lat":47.60513687133789,"lon":-122.3335952758789,"name":"999 3rd Ave","postalCode":"98104"}},"rbfqfrybcgbdb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: Max Payton will be presenting Fixing Faults in C and Java Source Code: Abbreviated vs. Full-word Identifier Names (<a href=\"http://www2.unibas.it/gscanniello/Giuseppe_Scanniello%40unibas/Home_files/TOSEM.pdf\" class=\"linkified\">http://www2.unibas.it/gscanniello/Giuseppe_Scanniello%40unibas/Home_files/TOSEM.pdf</a>)<br/>\" We carried out a family of controlled experiments to investigate whether the use of abbreviated identifier names, with respect to full-word identifier names, affects fault fixing in C and Java source code. This family consists of an original (or baseline) controlled experiment and three replications. We involved 100 participants with different backgrounds and experiences in total. Overall results suggested that there is no difference in terms of effort, effectiveness, and efficiency to fix faults, when source code contains either only abbreviated or only full-word identifier names. We also conducted a qualitative study to understand the values, beliefs, and assumptions that inform and shape fault fixing when identifier names are either abbreviated or full-word. We involved in this qualitative study six professional developers with one to three years of work experience. A number of insights emerged from this qualitative study and can be considered a useful complement to the quantitative results from our family of experiments. One of the most interesting insight is that developers, when working on source code with abbreviated identifier names, adopt a more methodical approach to identify and fix faults by extending their focus point and only in a few cases they expand abbreviated identifiers.</p> <p>Mini Event: <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC300808/\" class=\"linkified\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC300808/</a> to get some humor into our day</p> <p>Inspired by this talk:<br/><a href=\"https://www.hillelwayne.com/talks/what-we-know-we-dont-know/\" class=\"linkified\">https://www.hillelwayne.com/talks/what-we-know-we-dont-know/</a></p> <p>• Important to know<br/>This meetup will be ONLINE! With COVID-19 isolation in effect, we're going to try to still get everyone together. We'll post a link to event as soon as it's ready, both here and in the slack channel, so feel free to join</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1585877400000,"title":"PWL #62: Fixing Faults: Abbreviated vs. Full-word Identifier Names","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrybcgbdb/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfrybchbkb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: TBD<br/>• Important to know</p> <p>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1588901400000,"title":"PWL #54: TBD","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrybchbkb/","utcOffset":-25200000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfrybcjbgb":{"description":"<p>Details<br/>• What we'll do<br/>Mini Paper: Shashwat will present The Tail at Scale <a href=\"https://cseweb.ucsd.edu/~gmporter/classes/fa17/cse124/post/schedule/p74-dean.pdf\" class=\"linkified\">https://cseweb.ucsd.edu/~gmporter/classes/fa17/cse124/post/schedule/p74-dean.pdf</a><br/>SYSTEMS THAT RESPOND to user actions quickly (within 100ms) feel more fluid and natural to users than those that take longer. Improvements in Internet connectivity and the rise of warehouse-scale computing systems have enabled Web services that provide fluid responsiveness while consulting multi-terabyte datasets spanning thousands of servers; for example, the Google search system updates query results interactively as the user types, predicting the most likely query based on the prefix typed so far, performing the search and showing the results within a few tens of milliseconds. Emerging augmented-reality devices (such as the Google Glass prototype) will need associated Web services with even greater responsiveness in order to guarantee seamless interactivity.</p> <p>Main Event: Max will present Racial Equity in Algorithmic Criminal Justice (<a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3144831\" class=\"linkified\">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3144831</a>)<br/>Algorithmic tools for predicting violence and criminality are being used more and more in policing, bail, and sentencing. Scholarly attention to date has focused on their procedural due process implications. My aim here is to consider these instruments’ interaction with the enduring racial legacies of the criminal justice system There are two competing lenses for evaluating the racial effects of algorithmic criminal justice: constitutional doctrine and emerging technical standards of “algorithmic fairness.” I argue first that constitutional doctrine is poorly suited to the task. It will often fail to capture the full range of racial issues that potentially arise in the use of algorithmic tools in criminal justice. While the emerging technical standards of algorithmic fairness are at least fitted to the specifics of the relevant technology, the technical literature has failed to ask how various conceptions of fairness track (or fail to track) policy-significant consequences. Drawing on the technical literature, I propose a reformulated metric for considering racial equity considerations in algorithmic design. Rather than asking about abstract definitions of fairness, a criminal justice algorithm should be evaluated in terms of its long-term, dynamic effects on racial stratification. The metric of nondiscrimination for the algorithmic context should focus on the net burden placed on a racial minority. Surprisingly, a precise formulation of this metric suggests that it can converge with the socially efficient decision rule under certain conditions.</p> <p>• Important to know</p> <p>Meetup will be at this link:<br/><a href=\"https://meet.jit.si/paperswelove\" class=\"linkified\">https://meet.jit.si/paperswelove</a></p> <p>This is last minute, but it's a rough time.</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1591320600000,"title":"PWL #62: Racial Equity in Algorithmic Criminal Justice","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrybcjbgb/","utcOffset":-25200000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfrybckbdb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event:<br/>Shashwat will present Conflict-free Replicated Data Types(<a href=\"https://hal.inria.fr/hal-00932836/file/CRDTs_SSS-2011.pdf\" class=\"linkified\">https://hal.inria.fr/hal-00932836/file/CRDTs_SSS-2011.pdf</a>)<br/>Replicating data under Eventual Consistency (EC) allows any replica to accept updates without remote synchronisation. This ensures performance and scalability in large-scale distributed systems (e.g., clouds). However, published EC approaches are ad-hoc and error-prone. Under a formal Strong Eventual Consistency (SEC) model, we study sufficient conditions for convergence. A data type that satisfies these conditions is called a Conflict-free Replicated Data Type (CRDT). Replicas of any CRDT are guaranteed to converge in a self-stabilising manner,<br/>despite any number of failures. This paper formalises two popular approaches (state- and operation-based) and their relevant sufficient conditions. We study a number of useful CRDTs, such as sets with clean<br/>semantics, supporting both add and remove operations, and consider in<br/>depth the more complex Graph data type. CRDT types can be composed<br/>to develop large-scale distributed applications, and have interesting theoretical properties</p> <p>• Important to know<br/>Meetup is online, link in this page</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1593739800000,"title":"PWL #54: TBD","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrybckbdb/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfrybcnbcb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: David Murray will present <a href=\"https://lamport.azurewebsites.net/pubs/time-clocks.pdf\" class=\"linkified\">https://lamport.azurewebsites.net/pubs/time-clocks.pdf</a><br/>The concept of one event happening before another<br/>in a distributed system is examined, and is shown to<br/>define a partial ordering of the events. A distributed<br/>algorithm is given for synchronizing a system of logical<br/>clocks which can be used to totally order the events.<br/>The use of the total ordering is illustrated with a<br/>method for solving synchronization problems. The<br/>algorithm is then specialized for synchronizing physical<br/>clocks, and a bound is derived on how far out of<br/>synchrony the clocks can become.<br/><a href=\"https://meet.jit.si/paperswelove\" class=\"linkified\">https://meet.jit.si/paperswelove</a><br/>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1601602200000,"title":"PWL #64: Lamport Time Clocks","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrybcnbcb/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfrybcqbfb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: Max will present STAR-Vote: A Secure, Transparent, Auditable, and Reliable Voting System (<a href=\"https://www.usenix.org/system/files/conference/evtwote13/jets-0101-bell.pdf\" class=\"linkified\">https://www.usenix.org/system/files/conference/evtwote13/jets-0101-bell.pdf</a>)</p> <p>STAR-Vote is a collaboration between a number of academics and the Travis County (Austin), Texas elections office, which currently uses a DRE voting system and previously used an optical scan voting system. STAR-Vote represents a rare opportunity for a variety of sophisticated technologies, such as end-to-end cryptography and risk limiting audits, to be designed into a new voting system, from scratch, with a variety of real world constraints, such as election-day vote centers that must support thousands of ballot styles and run all day in the event of a power failure. This paper describes the current design of STAR-Vote which is now largely settled and whose development will soon begin</p> <p><a href=\"https://meet.jit.si/paperswelove\" class=\"linkified\">https://meet.jit.si/paperswelove</a></p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1607049000000,"title":"PWL #COV: STAR-Vote: A Safe, Transparent, Auditable, Reliable Voting Algorithm","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrybcqbfb/","utcOffset":-28800000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfryccdbgb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: Krishna Venkat will present Virtual Consensus in Delos<br/>Consensus-based replicated systems are complex, monolithic, and difficult to upgrade once deployed. As a result, deployed systems do not benefit from innovative research, and new consensus protocols rarely reach production. We propose virtualizing consensus by virtualizing the shared log API, allowing services to change consensus protocols without downtime. Virtualization splits the logic of consensus into the VirtualLog, a generic and reusable reconfiguration layer; and pluggable ordering protocols called Loglets. Loglets are simple, since they do not need to support reconfiguration or leader election; diverse, consisting of different protocols, codebases, and even deployment modes; and composable, via RAID-like stacking and striping. We describe a production database called Delos which leverages virtual consensus for rapid, incremental development and deployment. Delos reached production within 8 months, and 4 months later upgraded its consensus protocol without downtime for a 10X latency improvement. Delos can dynamically change its performance properties by changing consensus protocols: we can scale throughput by up to 10X by switching to a disaggregated Loglet, and double the failure threshold of an instance without sacrificing throughput via a striped Loglet.</p> <p><a href=\"https://www.usenix.org/conference/osdi20/presentation/balakrishnan\" class=\"linkified\">https://www.usenix.org/conference/osdi20/presentation/balakrishnan</a></p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1612492200000,"title":"PWL #COVID - Virtual Consensus in Delos","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryccdbgb/","utcOffset":-28800000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfryccfbgb":{"description":"<p>Details<br/>• What we'll do</p> <p>PWL Mini: Krishnamoorthy Venkatraman will be leading a discussion about Here We Go Again: Why Is It Difficult for Developers to Learn<br/>Another Programming Language? (<a href=\"https://www.microsoft.com/en-us/research/uploads/prod/2020/05/herewegoagain_icse2020.pdf\" class=\"linkified\">https://www.microsoft.com/en-us/research/uploads/prod/2020/05/herewegoagain_icse2020.pdf</a>)</p> <p>Once a programmer knows one language, they can leverage concepts and knowledge already learned, and easily pick up another programming language. But is that always the case? To understand if programmers have difficulty learning additional programming languages, we conducted an empirical study of Stack Overflow questions across 18 different programming languages. We hypothesized that previous knowledge could potentially interfere with learning a new programming language. From our inspection of 450 Stack Overflow questions, we found 276 instances of interference that occurred due to faulty assumptions originating from knowledge about a different language. To understand why these difficulties occurred, we conducted semi-structured interviews with 16 professional programmers. The interviews revealed that programmers make failed attempts to relate a new programming language with what they already know. Our findings inform design implications for technical authors, toolsmiths, and language designers, such as designing documentation and automated tools that reduce interference, anticipating uncommon language transitions during language design, and welcoming programmers not just into a language, but its entire ecosystem.<br/>------------------------------------------------------------------------------------------------<br/>Main Event: Aaron David Goldman leading a discussion about Kademlia: A Peer-to-Peer Information System Based on the XOR Metric</p> <p>Abstract:<br/>We describe a peer-to-peer distributed hash table with provable consistency and performance in a fault-prone environment. Our system routes queries and locates nodes using a novel XOR-based metric topology that simplifies the algorithm and facilitates our proof. The topology has the property that every message exchanged conveys or reinforces useful contact information. The system exploits this information to send parallel, asynchronous query messages that tolerate node failures without imposing timeout delays on users.</p> <p>Read the paper at <a href=\"https://link.springer.com/chapter/10.1007/3-540-45748-8_5\" class=\"linkified\">https://link.springer.com/chapter/10.1007/3-540-45748-8_5</a></p> <p>Keywords:<br/>Distribute Hash Table, Replacement Cache, Close Node, Close Leaf, Empty Bucket</p> <p>• Important to know:</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1614911400000,"title":"PWL #67: Kademlia: A Peer-to-Peer Information System Based on the XOR Metric","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryccfbgb/","utcOffset":-28800000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfryccjbfb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: Arick Grootveld presents CLEVER: Combining Code Metrics with Clone Detection for Just-In-Time Fault Prevention and Resolution in Large Industrial Projects<br/>Automatic prevention and resolution of faults is an important research topic in the field of software maintenance and evolution.<br/>Existing approaches leverage code and process metrics to build<br/>metric-based models that can effectively prevent defect insertion in<br/>a software project. Metrics, however, may vary from one project to<br/>another, hindering the reuse of these models. Moreover, they tend to<br/>generate high false positive rates by classifying healthy commits as<br/>risky. Finally, they do not provide sufficient insights to developers<br/>on how to fix the detected risky commits. In this paper, we propose<br/>an approach, called CLEVER (Combining Levels of Bug Prevention<br/>and Resolution techniques), which relies on a two-phase process for<br/>intercepting risky commits before they reach the central repository.<br/>When applied to 12 Ubisoft systems, the results show that CLEVER<br/>can detect risky commits with 79% precision and 65% recall, which<br/>outperforms the performance of Commit-guru, a recent approach<br/>that was proposed in the literature. In addition, CLEVER is able<br/>to recommend qualitative fixes to developers on how to fix risky<br/>commits in 66.7% of the cases.<br/><a href=\"http://users.encs.concordia.ca/~abdelw/papers/MSR18.pdf\" class=\"linkified\">http://users.encs.concordia.ca/~abdelw/papers/MSR18.pdf</a></p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1622770200000,"title":"PWL #??: CLEVER: Combining Code Metrics with Clone Detection","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryccjbfb/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfrycckbcb":{"description":"<p>Details<br/>• What we'll do</p> <p>Main Event: Metastable Failures in Distributed Systems with David Murray! (<a href=\"https://sigops.org/s/conferences/hotos/2021/papers/hotos21-s11-bronson.pdf\" class=\"linkified\">https://sigops.org/s/conferences/hotos/2021/papers/hotos21-s11-bronson.pdf</a>)</p> <p>We describe metastable failures—a failure pattern in distributed systems. Currently, metastable failures manifest themselves as black swan events; they are outliers because nothing in the past points to their possibility, have a severe impact, and are much easier to explain in hindsight than to predict. Although instances of metastable failures can look different at the surface, deeper analysis shows that they can be understood within the same framework.</p> <p>We introduce a framework for thinking about metastable failures, apply it to examples observed during years of operating distributed systems at scale, and survey ad-hoc techniques developed post-factum for making systems resilient to known metastable failures. A systematic approach for building systems that are robust against unknown metastable failures remains an open problem.</p> <p>(bonus paper: ‘‘Those found responsible have been sacked’’ - <a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.623.5749&amp;rep=rep1&amp;type=pdf\" class=\"linkified\">http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.623.5749&amp;rep=rep1&amp;type=pdf</a>)</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1625189400000,"title":"PWL #69: Metastable Failures in Distributed Systems","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrycckbcb/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfryccnbkb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: TBD<br/>• Important to know</p> <p>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1633656600000,"title":"PWL #54: TBD","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryccnbkb/","utcOffset":-25200000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfryccpbgb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: David Murray will be speaking on Running BGP in Data Centers at Scale - Facebook Research (<a href=\"https://research.fb.com/publications/running-bgp-in-data-centers-at-scale/\" class=\"linkified\">https://research.fb.com/publications/running-bgp-in-data-centers-at-scale/</a>)</p> <p>In this paper, we present Facebook’s BGP-based data center routing design and how it marries data center’s stringent requirements with BGP’s functionality. We present the design’s significant artifacts, including the BGP Autonomous System Number (ASN) allocation, route summarization, and our sophisticated BGP policy set.</p> <p>• Important to know</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1636075800000,"title":"PWL #70: Running BGP in Data Centers at Scale","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryccpbgb/","utcOffset":-25200000,"venue":{"address1":false,"address2":null,"city":false,"country":false,"lat":null,"lon":null,"name":null,"postalCode":null}},"rbfqfryccqbdb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: TBD<br/>• Important to know</p> <p>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1638498600000,"title":"PWL #54: TBD","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryccqbdb/","utcOffset":-28800000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfrydccbjb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: TBD<br/>• Important to know</p> <p>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1641522600000,"title":"PWL #54: TBD","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfrydccbjb/","utcOffset":-28800000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfryzmbhb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event:<br/>Shuheng presents on Einsteins Special Relativity (<a href=\"https://www.academia.edu/375613/Einsteins_Original_Paper_on_General_Relativity\" class=\"linkified\">https://www.academia.edu/375613/Einsteins_Original_Paper_on_General_Relativity</a>, <a href=\"https://web.stanford.edu/~oas/SI/SRGR/notes/srHarris.pdf\" class=\"linkified\">https://web.stanford.edu/~oas/SI/SRGR/notes/srHarris.pdf</a>)<br/>Special relativity was introduced by Einstein in 1905. Before Einstein's special relativity, we had a concept called Newtonian/Galilean relativity. The idea is that if you sit in an inertial reference, like an uniformly moving train, you won't be able to tell that it is moving and the physics laws are unchanged. An outside observer to the moving train, given the train's velocity, could re-write all coordinates local to the moving train using coordinates local to the outside observer. This could be done in a simple transformation. If you transform Newton's laws of motion, you would see that they remain the same in both coordinate systems, in fact all inertial frames.<br/>The key assumption above was that time is untransformed between two observers.<br/>Maxwell's electromagnetism equations do not take the same form between two inertial frames. It also predicts electromagnetic waves moving at approximately[masked] km/h. But the question is, with respect to what?<br/>So Einstein postulates that light actually moves at this velocity with respect to all inertial observers. Which leads to the consequence that time is not going at the same rate for all observers, and actually relates to relative velocity between the two observers.<br/>This leads to a beautiful new view on the universe where space and time must be considered together as \"spacetime\".</p> <p>• Important to know<br/>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1567733400000,"title":"PWL #56: Special Relativity","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryzmbhb/","utcOffset":-25200000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfryznbfb":{"description":"<p>Details<br/>• What we'll do<br/>Main Event: Trevor Lalish-Menagh<br/>will be presenting \"Full-Stack Teams, not Engineers\" (<a href=\"https://itrevolution.com/forum-paper-downloads/\" class=\"linkified\">https://itrevolution.com/forum-paper-downloads/</a>)<br/>\"Randy is a full-stack engineer. He knows the company’s software<br/>better than anyone else. He has experience with all aspects of the<br/>company’s production services: literally “from chips to CSS.” He<br/>writes server code and front-end code, makes user-interface decisions, administers the database, configures the CI/CD system, and<br/>handles outages. For all this he is paid handsomely.<br/>There are two things that Randy doesn’t know. First, he’s about to<br/>burn out. Nobody can sustain his level of stress for long. His health<br/>is starting to suffer, and he can’t figure out why working more hours<br/>doesn’t enable him to stay ahead of all the projects that need to be<br/>completed. He hasn’t had a vacation in years.<br/>The second thing Randy doesn’t know is that he’s becoming a bottleneck who is hurting the company. He has so much responsibility<br/>that nearly every project depends on him; therefore, nearly every<br/>project stalls while waiting for him. The teams’ frustration is palpable.<br/>Randy’s manager knows this. The company has tried to hire an<br/>additional full-stack engineer for two years but have failed. Full-stack<br/>engineers are as rare as hen’s teeth. In the rare cases where they do<br/>exist, it is an unhealthy situation for themselves and the company.<br/>Finding Randy was a lucky accident. Now, he’s a single point of failure. The company is one bicycle accident or winning lottery ticket<br/>away from disaster.<br/>So what is a company to do?\"</p> <p>• Important to know</p> <p>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1570152600000,"title":"PWL #57: Full-Stack Teams, not Engineers","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryznbfb/","utcOffset":-25200000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfryzpbkb":{"description":"<p>Details<br/>• What we'll do<br/>Lightning Talk: Marvin Humphrey, visiting from the San Diego chapter of Papers We Love, will present on the evolution of error handling. <a href=\"http://joeduffyblog.com/2016/02/07/the-error-model/\" class=\"linkified\">http://joeduffyblog.com/2016/02/07/the-error-model/</a></p> <p>Main Event: Alec Morgan will be presenting \"Attention Is All You Need\" (<a href=\"https://arxiv.org/abs/1706.03762\" class=\"linkified\">https://arxiv.org/abs/1706.03762</a>)<br/>\"The dominant sequence transduction models are based on complex recurrent or convolutional neural networks in an encoder-decoder configuration. The best performing models also connect the encoder and decoder through an attention mechanism. We propose a new simple network architecture, the Transformer, based solely on attention mechanisms, dispensing with recurrence and convolutions entirely. Experiments on two machine translation tasks show these models to be superior in quality while being more parallelizable and requiring significantly less time to train. Our model achieves 28.4 BLEU on the WMT 2014 English-to-German translation task, improving over the existing best results, including ensembles by over 2 BLEU. On the WMT 2014 English-to-French translation task, our model establishes a new single-model state-of-the-art BLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction of the training costs of the best models from the literature. We show that the Transformer generalizes well to other tasks by applying it successfully to English constituency parsing both with large and limited training data.\"<br/>(Talking to Alec last month, it's a very important modern paper for Natural Language Processing)</p> <p>• Important to know</p> <p>Big ups to Glympse for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1573180200000,"title":"PWL #58: Attention Is All You Need","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryzpbkb/","utcOffset":-28800000,"venue":{"address1":"113 Cherry St Suite 60215","address2":null,"city":"Seattle","country":"us","lat":47.61371612548828,"lon":-122.3177261352539,"name":"Glympse","postalCode":"98122"}},"rbfqfryzqbhb":{"description":"<p>Details<br/>• What we'll do<br/>Lightning Talk: A very special guest David Murray will be presenting on the Convoy Phenomenon (<a href=\"https://jimgray.azurewebsites.net/papers/Convoy%20Phenomenon%20RJ%202516.pdf\" class=\"linkified\">https://jimgray.azurewebsites.net/papers/Convoy%20Phenomenon%20RJ%202516.pdf</a>)</p> <p>A congestion phenomenon on high-traffic locks is described<br/>and a non-FIFO strategy to eliminate such congestion is presented.</p> <p>Main Event: Max Payton will be presentingLightweight Asynchronous Snapshots for Distributed Dataflows (<a href=\"https://arxiv.org/pdf/1506.08603.pdf\" class=\"linkified\">https://arxiv.org/pdf/1506.08603.pdf</a>)</p> <p>Distributed stateful stream processing enables the deployment and execution of large scale continuous computations in the cloud, targeting both low latency and high throughput. One of the most fundamental challenges of this paradigm is providing processing guarantees under potential failures. Existing approaches rely on periodic global state snapshots that can be used for failure recovery. Those approaches suffer from two main drawbacks. First, they often stall the overall computation which impacts ingestion. Second, they eagerly persist all records in transit along with the operation states which results in larger snapshots than required. In this work we propose Asynchronous Barrier Snapshotting (ABS), a lightweight algorithm suited for modern dataflow execution engines that minimises space requirements. ABS persists only operator states on acyclic execution topologies while keeping a minimal record log on cyclic dataflows. We implemented ABS on Apache Flink, a distributed analytics engine that supports stateful stream processing. Our evaluation shows that our algorithm does not have a heavy impact on the execution, maintaining linear scalability and performing well with frequent snapshots.</p> <p>• Important to know</p> <p>Big ups to Comcast for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1575599400000,"title":"PWL #59: Lightweight Asynchronous Snapshots for Distributed Dataflows","url":"https://www.meetup.com/papers-we-love-seattle/events/rbfqfryzqbhb/","utcOffset":-28800000,"venue":{"address1":"1000 2nd Ave #1000","address2":null,"city":"Seattle","country":"us","lat":47.60566711425781,"lon":-122.3351058959961,"name":"Comcast Technology Solutions","postalCode":""}},"sdftxpyxlbdb":{"description":"<p>• What we'll do<br/>PWL mini:<br/>Jared Anderson will be discussing a CAPM paper.</p> <p>Main Event:<br/>Ankur Chauhan will be speaking on TritanDB (<a href=\"http://www.tritandb.com/\" class=\"linkified\">http://www.tritandb.com/</a>).</p> <p>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Microsoft Reactor for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1533259800000,"title":"PWL #46: TritanDB","url":"https://www.meetup.com/papers-we-love-seattle/events/sdftxpyxlbdb/","utcOffset":-25200000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"sdftxpyxnbgb":{"description":"<p>• What we'll do<br/>PWL mini:<br/>Maybe you!!!</p> <p>Main Event:<br/>One VM to Rule Them All by Brandon Bloom</p> <p><a href=\"https://the.gregor.institute/papers/onward2013-wuerthinger-truffle.pdf\" class=\"linkified\">https://the.gregor.institute/papers/onward2013-wuerthinger-truffle.pdf</a></p> <p>Download and try Graal (<a href=\"https://www.graalvm.org/docs/getting-started/\" class=\"linkified\">https://www.graalvm.org/docs/getting-started/</a>); you can call back and forth between Java, R, Python, Ruby, etc!</p> <p>Abstract</p> <p>Building high-performance virtual machines is a complex<br/>and expensive undertaking; many popular languages still<br/>have low-performance implementations. We describe a new<br/>approach to virtual machine (VM) construction that amor-<br/>tizes much of the effort in initial construction by allowing<br/>new languages to be implemented with modest additional<br/>effort. The approach relies on abstract syntax tree (AST) in-<br/>terpretation where a node can rewrite itself to a more special-<br/>ized or more general node, together with an optimizing com-<br/>piler that exploits the structure of the interpreter. The com-<br/>piler uses speculative assumptions and deoptimization in or-<br/>der to produce efficient machine code. Our initial experience<br/>suggests that high performance is attainable while preserv-<br/>ing a modular and layered architecture, and that new high-<br/>performance language implementations can be obtained by<br/>writing little more than a stylized interpreter.</p> <p>Brandon's Bio</p> <p>Brandon Bloom walks a fine line between laser focused pragmatism and broad academic interests. Most recently in his varied career, Brandon worked on Code.org's Hour Of Code campaign. In the past, he's founded and sold a startup, as well as worked on Microsoft Xbox and Google Translate. Now, he's indulging his inner scientist and exploring technology for his next venture. Find him on the web at &lt; <a href=\"http://www.brandonbloom.name/\" class=\"linkified\">http://www.brandonbloom.name/</a> &gt;.</p> <p>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Microsoft Reactor for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1538703000000,"title":"PWL #48: One VM to Rule Them All","url":"https://www.meetup.com/papers-we-love-seattle/events/sdftxpyxnbgb/","utcOffset":-25200000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"sdftxpyxpbcb":{"description":"<p>• What we'll do<br/>PWL mini:<br/>Maybe you!!!</p> <p>Main Event:<br/>Joshulyne Park will be leading a discussion on \"The Tangle.\" This is the paper behind IOTA, a cryptocurrency for the Internet of Things (IoT).</p> <p>Abstract:<br/>In this paper we analyze the mathematical foundations of IOTA, a cryptocurrency for the Internet-of-Things (IoT) industry. The main feature of this novel cryptocurrency is the tangle, a directed acyclic graph (DAG) for storing transactions. The tangle naturally succeeds the blockchain as its next evolutionary step, and offers features that are required to establish a machineto-machine micropayment system.</p> <p>An essential contribution of this paper is a family of Markov Chain Monte<br/>Carlo (MCMC) algorithms. These algorithms select attachment sites on the tangle for a transaction that has just arrived.</p> <p>Paper Link:<br/><a href=\"https://assets.ctfassets.net/r1dr6vzfxhev/2t4uxvsIqk0EUau6g2sw0g/45eae33637ca92f85dd9f4a3a218e1ec/iota1_4_3.pdf\" class=\"linkified\">https://assets.ctfassets.net/r1dr6vzfxhev/2t4uxvsIqk0EUau6g2sw0g/45eae33637ca92f85dd9f4a3a218e1ec/iota1_4_3.pdf</a><br/>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Microsoft Reactor for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1541122200000,"title":"PWL #49: The Tangle","url":"https://www.meetup.com/papers-we-love-seattle/events/sdftxpyxpbcb/","utcOffset":-25200000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"sdftxpyxqbjb":{"description":"<p>• What we'll do</p> <p>Main Event:<br/>John Shuheng will be speaking on FaRM (<a href=\"https://pdos.csail.mit.edu/6.824/papers/farm-2015.pdf\" class=\"linkified\">https://pdos.csail.mit.edu/6.824/papers/farm-2015.pdf</a>).<br/>Abstract:<br/>FaRM is a distributed in-memory storage system with a single virtual address space and support for strictly serializable transactions at very low latency. The system achieves much lower latency previously possible by skipping CPU involvement in most transactions through heavily optimizing the transaction protocol using one-sided RDMA reads and writes</p> <p>Supplemental paper:<br/><a href=\"https://www.usenix.org/system/files/conference/nsdi14/nsdi14-paper-dragojevic.pdf\" class=\"linkified\">https://www.usenix.org/system/files/conference/nsdi14/nsdi14-paper-dragojevic.pdf</a></p> <p>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Microsoft Reactor for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1544149800000,"title":"PWL #50: FaRM: a distributed ACID compliant in-memory store","url":"https://www.meetup.com/papers-we-love-seattle/events/sdftxpyxqbjb/","utcOffset":-28800000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"sdftxpyzcbfb":{"description":"<p>• What we'll do<br/>PWL mini:<br/>Maie - A Unified approach to interpreting model predictions<br/>(<a href=\"http://papers.nips.cc/paper/7062-a-unified-approach-to-interpreting-model-predictions\" class=\"linkified\">http://papers.nips.cc/paper/7062-a-unified-approach-to-interpreting-model-predictions</a>)</p> <p>Main Event:<br/>Eric Wolak - Kademlia - A peer to peer Information system based on XOR Metric<br/>(<a href=\"https://pdos.csail.mit.edu/~petar/papers/maymounkov-kademlia-lncs.pdf\" class=\"linkified\">https://pdos.csail.mit.edu/~petar/papers/maymounkov-kademlia-lncs.pdf</a>)</p> <p>Dinner will be provided! We usually eat between 6:30 and 7:00, with papers starting at 7.</p> <p>• Important to know</p> <p>Big ups to Microsoft Reactor for hosting this month!</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1546569000000,"title":"PWL #51: Kademlia - A peer to peer Information system based on XOR Metric","url":"https://www.meetup.com/papers-we-love-seattle/events/sdftxpyzcbfb/","utcOffset":-28800000,"venue":{"address1":"320 Westlake Ave N","address2":"4th floor","city":"Seattle","country":"us","lat":47.62157440185547,"lon":-122.33810424804688,"name":"Microsoft Reactor Westlake","postalCode":"98109"}},"sdftxpyzdbkb":{"description":"<p>• What we'll do<br/>PWL mini:<br/>Max Payton will be presenting \"Reflections on Trusting Trust\"<br/><a href=\"https://www.archive.ece.cmu.edu/~ganger/712.fall02/papers/p761-thompson.pdf\" class=\"linkified\">https://www.archive.ece.cmu.edu/~ganger/712.fall02/papers/p761-thompson.pdf</a><br/>\"To what extent should one trust a statement that a program is free of Trojan horses? Perhaps it is more important to trust the people who wrote the software.\"</p> <p>Main Event:<br/>Scott Francis will be presenting \"The Ultimate Display\" (1965)<br/><a href=\"http://worrydream.com/refs/Sutherland%20-%20The%20Ultimate%20Display.pdf\" class=\"linkified\">http://worrydream.com/refs/Sutherland%20-%20The%20Ultimate%20Display.pdf</a><br/>\"A display connected to a digital computer gives us a chance to gain familiarity with concepts not realizable in the physical world. It is a looking glass into a mathematical wonderland.\" Scott will also be talking about how the prediction in this paper turned out.</p> <p>• Important to know<br/>We have a new location this month! Check the map, we'll be meeting at Lyft Seattle. PLEASE try to come early if you can. We graciously will have someone helping sign people in, but she will not be there all night.</p> <p>Big ups to Lyft for hosting this month</p> <p>As a chapter of Papers We Love we abide by and enforce the PWL Code of Conduct (<a href=\"https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md\" class=\"linkified\">https://github.com/papers-we-love/seattle/blob/master/code-of-conduct.md</a>) at our events. Please give it a read, plan on acting like an adult, and involve one of the organizers if you need help.</p> <p>Stop slacking and join us in the #seattle channel at <a href=\"https://papersweloveslack.herokuapp.com\" class=\"linkified\">https://papersweloveslack.herokuapp.com</a>!</p> <p>If you have a paper you'd like to present, or even just a mini, please hit up one of the organizers :) We're always looking for more presenters.</p> ","photos":[],"time":1549593000000,"title":"PWL #52: The Ultimate Display","url":"https://www.meetup.com/papers-we-love-seattle/events/sdftxpyzdbkb/","utcOffset":-28800000,"venue":{"address1":"83 S King St","address2":null,"city":"Seattle","country":"us","lat":47.59795379638672,"lon":-122.33494567871094,"name":"83 S King St","postalCode":"98104"}}}