{"239291531":{"url":"https://www.meetup.com/Papers-We-Love-Teresina/events/239291531/","description":"<p>Luiz AndrC Barroso, Kourosh Gharachorloo, Robert McNamarat, Andreas Nowatzyk, Shaz Qadeert, Barton Sano, Scott Smith, Robert Stets, and Ben Verghese - \"<a href=\"https://www.ece.cmu.edu/~ece740/f13/lib/exe/fetch.php?media=barroso00_piranha.pdf\">PIRANHA: A scalable architecture based on single-chip multiprocessing</a>\"</p> <p><b><br/></b></p> <p><b>Article will be presented by Alan Jheyson Ribeiro da Costa <br/></b></p> <p><b><br/></b></p> <p><b>Summary</b></p> <p>The microprocessor industry is currently struggling with higher development costs and longer design times that arise from exceedingly complex processors that are pushing the limits of instructionlevel parallelism. Meanwhile, such designs are especially ill suited for important commercial applications, such as on-line transaction processing (OLTP), which suffer from large memory stall times and exhibit little instruction-level parallelism. Given that comercia1 applications constitute by far the most important market for high-performance servers, the above trends emphasize the need to consider altemative processor designs that specifically target such workloads. The abundance of explicit thread-level parallelism in commercial workloads, along with advances in semiconductor integration density, identify chip multiprocessing (CMP) as potentially the most promising approach for designing processors targeted at commercial servers. This paper describes the Pirunhn system, a research prototype being developed at Compaq that aggressively exploits chip multiprocessing by integrating eight simple Alpha processor cores along with a two-level cache hierarchy onto a single chip. Piranha also integrates further on-chip functionality to allow for scalable multiprocessor configurations to be built in a glueless and modular fashion. The use of simple processor cores combined with an industry-standard ASIC design methodology allow us to complete our prototype within a short time-frame, with a team size and investment that are an order of magnitude smaller than that of a commercial microprocessor. Our detailed simulation results show that while each Piranha processor core is substantially slower than an aggressive next-generation processor, the integration of eight cores onto a single chip allows Piranha to outperform next-generation processors by up to 2.9 times (on a per chip basis) on important workloads such as OLTP. This performance advantage can approach a factor of five by using full-custom instead of ASIC logic. In addition to exploiting chip multiprocessing, the Piranha prototype incorporates several other unique design choices including a shared second-level cache with no inclusion, a highly optimized cache coherence protocol, and a novel 110 architecture. </p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/e/3/c/f/600_460858319.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/e/3/d/0/600_460858320.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/e/3/d/1/600_460858321.jpeg","height":null,"width":null}],"venue":{"lat":-5.088054180145264,"address1":"Av. dos Expedicionários, 790 - São João","address2":null,"name":"Auditório da Estácio CEUT","postalCode":null,"lon":-42.76380920410156,"country":"br","city":"Teresina"},"utcOffset":-10800000,"time":1493233200000,"title":"PIRANHA: A scalable architecture based on single-chip multiprocessing"},"239932264":{"url":"https://www.meetup.com/Papers-We-Love-Teresina/events/239932264/","description":"<p>Jorge Biolchini, Paula Gomes Mian, Ana Candida Cruz Natali and Guilherme Horta Travasssos - \"<a href=\"http://www.elizabete.com.br/site/Outros/Entradas/2012/11/19_Revisao_Sistematica_files/ConceitosRevisaoSistematica_Biolchini.pdf\">Systematic Review in Software Engineering</a>\"</p> <p>\n\n\n<b>Summary</b></p> <p>The term Systematic Review (SR) is used to refer to a specific methodology of research, developed in order to gather and evaluate the available evidence pertaining to  a focused topic.In contrast to the usual process of literature review, unsystematically conducted whenever one starts a particular investigation, a SR is developed, as the term denotes, in a formal and systematic way. This means that the research conduction process of a systematic type of review follows a very well defined and strict sequence of methodological steps, according to an aprioristically developed protocol. This instrument is constructed around a central issue, which represents the core of the investigation, and which is expressed by using specific concepts and terms, that must be addressed towards information related to a specific, pre-defined, focused, and structured question. The methodological steps, the strategies to retrieve the evidence, the focus of the question are explicitly defined, so that other professionals can reproduce the same protocol and also be able to judge about the adequacy of the chosen standards for the case.Synonyms of this methodology that are to be found in the literature include the following terms: overview, research review, research synthesis, research integration, systematic overview, systematic research synthesis, integrative research review, and integrative review.The type of acceptable evidence to be gathered in a systematic review is stated beforehand. The retrieved evidence is thoroughly reviewed, comparable to other types  of evidence previously and elsewhere retrieved.The evidence data are normalized in such a way as to make results from different studies comparable, in terms of their magnitude of effect, even when they are presented in diverse ways but related to compatible concepts. It is then possible, e.g., to compare studies which evidence is expressed by absolute risk reduction with others where it is expressed by relative risk.Besides comparing results of individual studies, different kinds of syntheses can be done. The election mode allows the researcher to look for each study separately and counting them as “votes” about the question focus. For instance, in a specific SR conducted in the field of medicine, the researcher could find that, among 35 valid studies, 29 showed a positive result, while 5 showed no result, and one study showed a negative result. Internal comparison of studies, based on their specific parameters, can show contrasts and other kinds of differences that may elucidate distinct aspects of the question. In the same example, one could find that the negative effect must be due to a different dosage scheme, while the five studies that showed no result were conducted in subjects that had a different age distribution in comparison to the 29 positive ones.Another type of research synthesis is known as meta-analysis, where the original individual studies are treated as if they were parts of one larger study, by having their data pooled together in one single and final result that summarizes the whole evidence. By selecting studies that are compatible in their quality level, and by taking strict care with their specific details, this methodological procedure can produce evidence as well as reveal aspects that the original studies are not individually able to elucidate. For instance, meta-analysis may prove that the results are statistically significant when small studies give inconclusive results with large confidence intervals. Besides that, when conflicting results arise from different individual studies, meta-analysis may reconcile the data in a synthetic result, while each individual study can then be weighted and compared with it, so that other kinds of conclusions might be derived from these discrepancies.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/6/9/4/c/600_461426956.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/6/9/4/d/600_461426957.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/6/9/4/e/600_461426958.jpeg","height":null,"width":null}],"venue":{"lat":-5.075520992279053,"address1":"R. João Cabral, 2231 - Pirajá","address2":null,"name":"Auditório Pirajá - UESPI","postalCode":null,"lon":-42.82667541503906,"country":"br","city":"Teresina"},"utcOffset":-10800000,"time":1495134000000,"title":"Systematic Review in Software Engineering"},"240408170":{"url":"https://www.meetup.com/Papers-We-Love-Teresina/events/240408170/","description":"<p>Anis Koubâa, André Cunha, Mário Alves, Eduardo Tovar - \"&lt;a&gt;TDBS: a time division beacon scheduling mechanism for ZigBee cluster-tree wireless sensor networks&lt;/a&gt;\"</p> <p>\n\n\nArticle will be presented by Ranulfo Plutarco Bezerra Neto</p> <p>\n\n\n\n<b>Summary</b></p> <p><b><br/></b></p> <p>Synchronization is a challenging and important issue for time-sensitive Wireless Sensor Networks (WSN) since it requires a mutual spatiotemporal coordination between the nodes. In that concern, the IEEE[masked]/ZigBee protocols embody promising technologies for WSNs, but are still ambiguous on how to efficiently build synchronized multiple-cluster networks, specifically for the case of cluster-tree topologies. In fact, the current IEEE[masked]/ZigBee specifications restrict the synchronization to beacon-enabled (by the generation of periodic beacon frames) star networks, while they support multi-hop networking in mesh topologies, but with no synchronization. Even though both specifications mention the possible use of cluster-tree topologies, which combine multi-hop and synchronization features, the description on how to effectively construct such a network topology is missing. This paper tackles this issue by unveiling the ambiguities regarding the use of the cluster-tree topology and proposing a synchronization mechanism based on Time Division Beacon Scheduling (TDBS) to build cluster-tree WSNs. In addition, we propose a methodology for efficiently managing duty-cycles in every cluster, ensuring the fairest use of bandwidth resources. The feasibility of the TDBS mechanism is clearly demonstrated through an experimental test-bed based on our open-source implementation of the IEEE[masked]/ZigBee protocols.</p> ","photos":[],"venue":{"lat":0.0,"address1":"Rua Cícero Eduardo, S/N - Bairro Junco - Picos/PI","address2":null,"name":"UFPI - Picos","postalCode":null,"lon":0.0,"country":"br","city":"Picos"},"utcOffset":-10800000,"time":1497389400000,"title":"TDBS: a time division beacon scheduling mechanism for ZigBee cluster-tree WSN"},"241327211":{"url":"https://www.meetup.com/Papers-We-Love-Teresina/events/241327211/","description":"<p>Anis Koubâa, André Cunha, Mário Alves, Eduardo Tovar - \"&lt;a&gt;TDBS: a time division beacon scheduling mechanism for ZigBee cluster-tree wireless sensor networks&lt;/a&gt;\"</p> <p>\n\n\nArticle will be presented by Ranulfo Plutarco Bezerra Neto</p> <p>\n\n\n\n<b>Summary</b></p> <p><b><br/></b></p> <p>Synchronization is a challenging and important issue for time-sensitive Wireless Sensor Networks (WSN) since it requires a mutual spatiotemporal coordination between the nodes. In that concern, the IEEE[masked]/ZigBee protocols embody promising technologies for WSNs, but are still ambiguous on how to efficiently build synchronized multiple-cluster networks, specifically for the case of cluster-tree topologies. In fact, the current IEEE[masked]/ZigBee specifications restrict the synchronization to beacon-enabled (by the generation of periodic beacon frames) star networks, while they support multi-hop networking in mesh topologies, but with no synchronization. Even though both specifications mention the possible use of cluster-tree topologies, which combine multi-hop and synchronization features, the description on how to effectively construct such a network topology is missing. This paper tackles this issue by unveiling the ambiguities regarding the use of the cluster-tree topology and proposing a synchronization mechanism based on Time Division Beacon Scheduling (TDBS) to build cluster-tree WSNs. In addition, we propose a methodology for efficiently managing duty-cycles in every cluster, ensuring the fairest use of bandwidth resources. The feasibility of the TDBS mechanism is clearly demonstrated through an experimental test-bed based on our open-source implementation of the IEEE[masked]/ZigBee protocols.</p> ","photos":[{"url":"https://secure.meetupstatic.com/photos/event/3/4/6/b/600_462673419.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/3/4/6/c/600_462673420.jpeg","height":null,"width":null},{"url":"https://secure.meetupstatic.com/photos/event/3/4/6/d/600_462673421.jpeg","height":null,"width":null}],"venue":{"lat":-5.0590620040893555,"address1":"R. Dirce Oliveira, 1521-1655 - Ininga, Teresina - PI","address2":null,"name":"Auditório da Química (SG-02)","postalCode":null,"lon":-42.790977478027344,"country":"br","city":"Teresina"},"utcOffset":-10800000,"time":1499437800000,"title":"TDBS: a time division beacon scheduling mechanism for ZigBee cluster-tree WSN"}}