{"237190154":{"url":"https://www.meetup.com/papers-we-love-utrecht/events/237190154/","description":"<p>What does it take to generate realistic scenes in a game? What are the trade-offs faced by game studios when implementing algorithms to this end? Have there been any fundamental breakthroughs in recent years regarding scene rendering? This edition of Papers We Love will answer these and more questions. Jacco Bikker will tell us about his adventures with ray tracing and how a Ph.D. dissertation lured him from game programming to the academic world.</p> <p>You can check out the following sources to prepare for the meetup:</p> <p><br/>• <a href=\"https://pdfs.semanticscholar.org/7627/1eee79d6c3bf431954439081f4018faa88a9.pdf\">Ingo Wald: Realtime Ray Tracing and Interactive Global Illumination, Ph.D. thesis, 2004, Computer Graphics Group, Saarland University</a>.</p> <p>• <a href=\"https://drive.google.com/file/d/0B-7-eIprnKk5bzdmVDE4WEV4QWs/view?usp=sharing\">Jacco Bikker: Real-time Ray Tracing through the Eyes of a Game Developer, RT '07 Proceedings of the 2007 IEEE Symposium on Interactive Ray Tracing.</a></p> <p><b>Title</b></p> <p><br/>Games and Ray Tracing: a follow-up on Ingo Wald's Ph.D. thesis \"Realtime Ray Tracing and Interactive Global Illumination\".</p> <p><br/><b>Abstract</b></p> <p>Generating 3D images for games has traditionally been done by rasterization. Modern engines have enhanced the basic algorithm with approximations for shadows, reflection, indirect light and other features. This leads to complex programs with millions of lines of code, which are very expensive to maintain. Until recently, an alternative algorithm, ray tracing, had been regarded as too CPU-intensive to use in real-time applications like games. Ingo Wald's research shows that ray tracing is possible on normal PCs. This offers fundamental benefits, not only for the quality of the generated images, but also to achieve lower production costs of games. In this talk we will follow the quest of a game programmer that felt challenged by Ingo Wald and decided to jump into the academic world, with a promising algorithm that is able to handle even the most powerful systems.</p> <p><b>Speaker: Jacco Bikker</b></p> <p>Dr. Jacco Bikker teaches <i>Optimization &amp; Vectorization</i> and <i>Advanced Graphics</i> in de Game &amp; Media Technology Master at Universiteit Utrecht. Before this, he was responsible for the curriculum of the HBO bachelor Game Architecture &amp; Design and the Game Technology master of the NHTV in Breda. He also has a background in game development, with ten years of experience in the Dutch game industry, where he worked for Lost Boys Interactive, Davilex, Overloaded and Vanguard.</p> <p><br/><b>Sponsor</b></p> <p>This edition of Papers We Love Utrecht is made possible by the lovely folks at <a href=\"https://infi.nl/\">Infi</a>. We want to thank them for providing us with the space, food and drinks we need to make this edition a reality.</p> <p><b>Schedule</b></p> <p><i>19:00 - W</i>elcome with food and drinks <br/><i>19:30 - </i>Talk + Discussion <br/><i>20:15</i> - Announcements <br/><i>21:30 - </i>Fin</p> ","photos":[],"venue":{"lat":52.08069610595703,"address1":"Arthur van Schendelstraat 500","address2":null,"name":"Infi","postalCode":null,"lon":5.119401931762695,"country":"nl","city":"Utrecht"},"utcOffset":3600000,"time":1487268000000,"title":"Games and Ray Tracing"},"234916338":{"url":"https://www.meetup.com/papers-we-love-utrecht/events/234916338/","description":"<p>Crazy about concurrency, and love some linearizability? Then this edition of Papers We Love is something that should get you excited! Marco Rietveld will discuss all things ACID to give you a solid BASE of understanding about single node database systems.</p> <p>Find the paper <a href=\"https://www.microsoft.com/en-us/research/publication/a-critique-of-ansi-sql-isolation-levels/\">here</a>.</p> <p><b>Title</b></p> <p>A Critique of ANSI SQL Isolation Levels</p> <p><br/><b>Abstract</b></p> <p>ANSI SQL-92 defines Isolation Levels in terms of phenomena: Dirty Reads, Non-Repeatable Reads, and Phantoms. This paper shows that these phenomena and the ANSI SQL definitions fail to characterize several popular isolation levels, including the standard locking implementations of the levels. Investigating the ambiguities of the phenomena leads to clearer definitions; in addition new phenomena that better characterize isolation types are introduced. An important multiversion isolation type, Snapshot Isolation, is defined.</p> <p><b>Target audience</b></p> <p>The presentation is intended for those who understand the concepts of threads, transactions, concurrency and databases. The motivation behind the talk is to provide the basis necessary for understanding the challenges in heavy-load systems as well as systems involving parallel data storage. </p> <p><br/><b>Speaker: Marco Rietveld</b></p> <p>Marco has been working as a Java software engineer for the last 8 years, most recently as a core developer on the jBPM/Drools project where he focused on persistence, core (BPM) engine and serialization issues as well as the REST API. At the moment, he is currently taking a sabbatical in order to improve his technical knowledge and skills. Before working as a software engineer, he has worked as both an information analyst at Schiphol and as well as a Linux/Unix systems administrator.</p> <p>You can find Marco on GitHub at <a href=\"https://github.com/mrietveld/\"><a href=\"https://github.com/mrietveld/\" class=\"linkified\">https://github.com/mrietveld/</a></a></p> <p><b>Sponsor</b></p> <p>This edition of Papers We Love Utrecht is made possible by the lovely folks at <a href=\"https://www.channable.com/\">Channable</a>. We want to thank them for providing us with the space, food and drinks we need to make this edition a reality.</p> <p><b>Schedule</b></p> <p><i>19:00 - W</i>elcome with food and drinks<br/><i>19:30 - </i>Talk + Discussion<br/><i>20:00</i> - Announcements<br/><i>21:00 - </i>Fin</p> <p><b>Getting to the location</b></p> <p>Channable's office is located next to the Janskerkhof. You can find the front door between Ludwig Coffee Bar and The Florin. Look out for the Papers We Love sign. Use the bottom doorbell (\"Rentman/ProductImpulse\") if the door is closed. Find us on the second floor.</p> <p><b>Parking</b></p> <p>The location is in the center of Utrecht. Therefore, parking options are limited. You can try your luck here:</p> <p>Keizerstraat 29<br/>3512 EA Utrecht</p> <p><br/>If full, there is a proper parking garage within a 10 minute walk of the Channable office:</p> <p>Kruisstraat 2<br/>3581 GK Utrecht</p> ","photos":[],"venue":{"lat":52.09324645996094,"address1":"Nobelstraat 2A","address2":null,"name":"Channable","postalCode":null,"lon":5.123452186584473,"country":"nl","city":"Utrecht"},"utcOffset":3600000,"time":1478023200000,"title":"A Critique of ANSI SQL Isolation Levels"},"230808314":{"url":"https://www.meetup.com/papers-we-love-utrecht/events/230808314/","description":"<p>This is the first meetup of Papers we Love Utrecht. We will discuss the <a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/paxos-simple.pdf\">Paxos Made Simple</a> paper. For extra context you can also refer to <a href=\"http://www.cs.utexas.edu/users/lorenzo/corsi/cs380d/papers/paper2-1.pdf\">Paxos Made Live</a> and <a href=\"http://research.microsoft.com/en-us/um/people/lamport/pubs/lamport-paxos.pdf\">The Part-Time Parliament</a>, but it is not strictly necessary.</p> <p><b>Schedule</b><br/>19:00 - Welcome<br/>19:15 - Laurens Duijvesteijn will present the paper<br/>20:00 - Discussion + social</p> <p>This meetup is the first in a series about distributed systems. Possible future topics are:<br/>* &lt;a&gt;Spanner: Google's Globally-Distributed­ Database&lt;/a&gt;<br/>* <a href=\"http://www.allthingsdistributed.com/files/amazon-dynamo-sosp2007.pdf\">Dynamo: Amazon’s Highly Available Key-value Store</a><br/>* <a href=\"http://ramcloud.stanford.edu/raft.pdf\">The Raft consensus algorithm</a></p> <p><br/>Feel free to contact us if you have any suggestions about interesting topics.</p> <p><i>Note: This meetup could still use a a sponsor for drinks, so if you know someone who could provide any or both don't hesitate to contact us.</i></p> <p><i><br/></i></p> <p><b>Finding the place</b></p> <p>We are hosted at the Marinus Ruppertgebouw on De Uithof. It's easily reachable by car or public transport. For public transport, bus 12, 28 and 128 run regularly. Get off at \"Heidelberglaan\" and cross the street. It's the building behind the green flat.</p> <p>If you're by car, follow the  \"De Uithof\" signs if you're on Utrecht's ring road.</p> <p>The room is located on the first floor of the Marinus Ruppertgebouw. We will try to get some signs up to guide you there.   Also, a map of the building can be found here: <a href=\"http://www.cdbeta.uu.nl/panama/Plattegrond_Educatorium_en_Ruppert.pdf\" class=\"linkified\">http://www.cdbeta.uu.nl/panama/Plattegrond_Educatorium_en_Ruppert.pdf</a></p> <p><b>Parking</b></p> <p>There are many (paid, but not that expensive) parking spots around the campus.  Behind the Marinus Ruppertgebouw, there are some free parking spots but they are usually occupied. It's worth a shot though</p> ","photos":[],"venue":{"lat":52.085933685302734,"address1":"Leuvenlaan 21","address2":null,"name":"Universiteit Utrecht, Marinus Ruppertgebouw, Zaal 136","postalCode":null,"lon":5.1737518310546875,"country":"nl","city":"Utrecht"},"utcOffset":7200000,"time":1465318800000,"title":"Kickoff meetup: Paxos Made Simple"},"233665871":{"url":"https://www.meetup.com/papers-we-love-utrecht/events/233665871/","description":"<p>This is the second meetup of Papers we Love Utrecht. </p> <p>Behrooz Nobakht from <a href=\"https://here.com\">HERE</a> will give us a 30 minute presentation about TLA+, a specification language for concurrent and distributed systems. He will give an introduction to textbook examples of TLA+ and, if time allows, he will also show us real-world TLA+ specifications (e.g. the one for the raft consenus protocol).</p> <p>We think it sounds very exciting and fits well with the last meetup's subject!</p> <p>Links about the subject for ones who want to come prepared:</p> <p>- <a href=\"http://research.microsoft.com/en-us/um/people/lamport/tla/amazon.html\"><a href=\"http://research.microsoft.com/en-us/um/people/lamport/tla/amazon.html\" class=\"linkified\">http://research.microsoft.com/en-us/um/people/lamport/tla/amazon.html</a></a><br/>- <a href=\"http://research.microsoft.com/en-us/um/people/lamport/tla/hyperbook.html\"><a href=\"http://research.microsoft.com/en-us/um/people/lamport/tla/hyperbook.html\" class=\"linkified\">http://research.microsoft.com/en-us/um/people/lamport/tla/hyperbook.html</a></a><br/>- Resources from <a href=\"https://groups.google.com/forum/#!forum/tlaplus\"><a href=\"https://groups.google.com/forum/#!forum/tlaplus\" class=\"linkified\">https://groups.google.com/forum/#!forum/tlaplus</a></a><br/>- TLA+ spec for Raft at <a href=\"https://github.com/ongardie/raft.tla\"><a href=\"https://github.com/ongardie/raft.tla\" class=\"linkified\">https://github.com/ongardie/raft.tla</a></a></p> <p>\n\n<b>Title</b><br/>A primer on TLA+ and its applications </p> <p><b><br/>Abstract</b><br/>We have a fast deep dive into Temporal Logic of Actions (TLA) and its associated tools (TLA+). TLA+helps to formally specify systems with simple mathematics, then verify certain properties and provehow they work. We go through an example to start using TLA+ including a specification and using the model checker. We try to provide examples on how/why using TLA+ is crucial in many softwareengineering domains. We will have an open discussion on how using TLA+ could fill the gaps indaily software engineering challenges. If time allows, we look at the TLA+ spec of a well-knowndistributed systems algorithm.<br/>You can find the slides and resources for this talk on GitHub's repo for PwL Utrecht after thetalk.</p> <p>\n\n\n\n<b>Speaker</b><br/>I am Behrooz, a software engineer with a specific focus and interest on JVM stack and programminglanguages. Since 2009, I've turned more to distributed systems and concurrency in programminglanguages to apply the principles to the practice of software engineering. I am usually active onTwitter @behruz and code on GitHub @nobeh.</p> <p><br/><b>Sponsor</b></p> <p>Speaker, food and drinks have all been provided by the lovely people at HERE. If you're into cartography and/or computer science, you should definitely check them out.</p> <p><b>Schedule</b></p> <p>19:00 Welcome  + Food &amp; Drinks<br/>19:30 Talk   + Discussion<br/>20:15 Drinks &amp; Social<br/>21:00 Fin</p> <p><b>General information</b></p> <p>This meetup is the second in a series about distributed systems. Possible future topics are: <br/>* <a href=\"http://www.allthingsdistributed.com/files/amazon-dynamo-sosp2007.pdf\">Dynamo: Amazon’s Highly Available Key-value Store</a> <br/>* <a href=\"http://ramcloud.stanford.edu/raft.pdf\">The Raft consensus algorithm</a><br/>* <a href=\"https://www.microsoft.com/en-us/research/publication/a-critique-of-ansi-sql-isolation-levels/\">SQL isolation levels</a></p> <p>We are also interested in other topics of course.  Or new series. If you want certain topics to be covered or want to present a topic yourself, don't hesitate to contact us!</p> <p><b>Finding the place</b></p> <p>We are hosted at the Marinus Ruppertgebouw on De Uithof. It's easily reachable by car or public transport. For public transport, bus 12, 27, 28 and 128 run regularly. Get off at \"Heidelberglaan\" and cross the street. It's the building behind the green flat.</p> <p>If you are coming by car, follow the  \"De Uithof\" signs if you're on Utrecht's ring road.</p> <p>The room is located on the first floor of the Marinus Ruppertgebouw. We will get some signs up to guide you there. Also, a map of the building can be found here: <a href=\"http://www.cdbeta.uu.nl/panama/Plattegrond_Educatorium_en_Ruppert.pdf\"><a href=\"http://www.cdbeta.uu.nl/panama/Plattegrond_Educatorium_en_Ruppert.pdf\" class=\"linkified\">http://www.cdbeta.uu.nl/panama/Plattegrond_Educatorium_en_Ruppert.pdf</a></a></p> <p><b>Parking</b></p> <p>There are many (paid, but not that expensive) parking spots around the campus.  Behind the Marinus Ruppertgebouw, there are some free parking spots but they are usually occupied. It's worth a shot though</p> ","photos":[],"venue":{"lat":52.085933685302734,"address1":"Leuvenlaan 21","address2":null,"name":"Universiteit Utrecht, Marinus Ruppertgebouw, Zaal 136","postalCode":null,"lon":5.1737518310546875,"country":"nl","city":"Utrecht"},"utcOffset":7200000,"time":1474304400000,"title":"Meetup : TLA+ - a specification language for concurrent and distributed systems"},"240477277":{"url":"https://www.meetup.com/papers-we-love-utrecht/events/240477277/","description":"<p>How should we structure complex and large software programs? How can we ensure they are modular and easy to maintain and reason about? Functional programming provides higher order functions and lazy evaluation. How can these features be used to write programs with these nice properties?</p> <p>For this edition of Papers We Love, we are lucky to have João Pizani discuss a classic: John Hugues' \"Why Functional Programming Matters\".</p> <p>Link to paper: <a href=\"https://www.cs.kent.ac.uk/people/staff/dat/miranda/whyfp90.pdf\"><a href=\"https://www.cs.kent.ac.uk/people/staff/dat/miranda/whyfp90.pdf\" class=\"linkified\">https://www.cs.kent.ac.uk/people/staff/dat/miranda/whyfp90.pdf</a></a></p> <p><br/><b>Schedule</b></p> <p>18:30 - Welcome with food and drinks <br/>19:00 - Opening<br/>19:10 - Talk<br/>20:00 - Announcements<br/>21:00 - Fin</p> <p><b>Talk Abstract</b></p> <p><br/>John Hugues' paper \"Why Functional Programming Matters\" was not the first FP (Functional Pogramming) paper that I read, but it was the one which convinced me to go on and study FP for many years. This paper shows how FP can be not only efficient, productive and formal, but also very beautiful. With an easy-to-understand style, John uses two examples in this paper to show how complex programs can be written in a VERY elegant and maintainable way. I hope to go together with you through these examples, and share the excitement I had when I first read this landmark paper.</p> <p><b>Speaker: João Pizani</b></p> <p>João Pizani did a B.Sc in Computer Science back in Brazil, and during this period loved low-level tinkering with electronics, operating systems and networking (some of this tinkering still persists as lunch chats and hobbies). Also during his bachelor, in 2009, he heard for the first time of this thing called \"Haskell\" and started to write lots of class projects in it. After reading \"Why Functional Programming Matters\" he has \"Seen The Light™\", and decided to study FP in the \"Software Technology\" master's program in Utrecht University. Now he is doing Ph.D research also in Utrecht, on the formal description and verification of digital circuits. This topic nicely allows him to combine his two passions: low-level hacking and high-level reasoning.</p> <p><b>Sponsor: Bol.com</b></p> <p>This edition of Papers We Love is made possible by the lovely folks at Bol.com. Thanks to their generosity, we have a venue and food and drinks for this edition.</p> ","photos":[],"venue":{"lat":52.06517028808594,"address1":"Papendorpseweg 100, 3528 BJ Utrecht","address2":null,"name":"Bol.com","postalCode":null,"lon":5.090010166168213,"country":"nl","city":"Utrecht"},"utcOffset":7200000,"time":1498753800000,"title":"Why Functional Programming Matters"},"235323489":{"url":"https://www.meetup.com/papers-we-love-utrecht/events/235323489/","description":"<p>Tired of writing unit tests by hand? Ever wondered if you could let the computer do that for you? Then this edition of Papers We Love is something that should get you excited! Wouter Swierstra will discuss QuickCheck, a library that helps you generate tests for your programs.</p> <p>Find the paper <a href=\"https://goo.gl/R8ABFG\">here</a>.</p> <p><b>Title</b></p> <p>QuickCheck: a lightweight tool for random testing Haskell programs</p> <p><br/><b>Abstract</b></p> <p>QuickCheck is a tool which aids the Haskell programmer in formulating and testing properties of programs. It has been hugely successful and the underlying ideas have been ported to many different languages. In this talk, I want to present the original QuickCheck paper and say a bit about the field of research that it has sparked.</p> <p><br/><b>Speaker: Wouter Swierstra</b></p> <p>Wouter Swierstra is a lecturer in the Software Technology group of the University of Utrecht. His PhD was on making programming languages with dependent types more practical. Since then he has worked with a variety of functional languages in both academia and industry. Most recently, he co-authored the book 'Functional Programming in Swift'.</p> <p><br/><b>Sponsor</b></p> <p>This edition of Papers We Love Utrecht is made possible by the lovely folks at <a href=\"http://thehyve.nl/\">The Hyve</a>. We want to thank them for providing us with the space, food and drinks we need to make this edition a reality.</p> <p><br/><b>Schedule</b></p> <p><i>19:00 - W</i>elcome with food and drinks <br/><i>19:30 - </i>Talk + Discussion <br/><i>20:15</i> - Announcements <br/><i>21:00 - </i>Fin</p> ","photos":[],"venue":{"lat":52.082340240478516,"address1":"Arthur van Schendelstraat 650","address2":null,"name":"The Hyve","postalCode":null,"lon":5.117528915405273,"country":"nl","city":"Utrecht"},"utcOffset":3600000,"time":1481565600000,"title":"QuickCheck: a lightweight tool for random testing Haskell programs"}}