{"222214950":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/222214950/","description":"<p><b>Title: </b>The Bargaining Problem</p> <p><b>Field: </b>Economics, Game Theory</p> <p><br/><b>Author: </b>John F. Nash, Jr.</p> <p><b>Published: </b>April 1950</p> <p><br/><b>Abstract:</b><br/>A new treatment is presented of a classical economic problem, one which occurs in many forms, as bargaining, bilateral monopoly, etc. It may also be regarded as a nonzero-sum two-person game. In this treatment a few general assumptions are made concerning the behaviour of a single individual and of a group of two individuals in certain economic environments. From these, the solution (in the sense of this paper) of the classical problem may be obtained. In the terms of game theory, values are found for the game.</p> <p><b>Presenter Bio:</b><br/>Daniel Simeone is a doctoral candidate in history, specializing in 19th-century Quebec bankruptcy. In another life, he studied discrete mathematics, graph theory, and algorithms. He likes reading, biking, and cooking. He also enjoys programming, but does so in a manner that makes professional programmers cringe.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1432252800000,"title":"The Bargaining Problem"},"233820636":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/233820636/","description":"<p><b>Title: </b><a href=\"http://web.cs.ucdavis.edu/~rogaway/papers/moral.pdf\">The Moral Character of Cryptographic Work</a><a href=\"https://www.cs.virginia.edu/%7Erobins/Turing_Paper_1936.pdf\">&lt;/a&gt;</p> <p><b>Author: </b>Phillip Rogaway</p> <p><b>Abstract:</b></p> <p>Cryptography rearranges power: it configures who can do what, from what. This makes cryptography an inherently political tool, and it confers on the field an intrinsically moral dimension. The Snowden revelations motivate a reassessment of the political and moral positioning of cryptography. They lead one to ask if our inability to effectively address mass surveillance constitutes a failure of our field.</p> <p><br/><b>Presenter Bio:</b></p> <p>&lt;a href=\"http://markjenkins.ca/\"&gt;Mark Jenkins</a> is a Winnipeg based information technology contractor, B.C.Sc, and LFCS.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1475107200000,"title":"The Moral Character of Cryptographic Work"},"225277008":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/225277008/","description":"<p><b>Title: </b>Recursive Functions of Symbolic Expressions and Their Computation by Machine</p> <p><b>Summary</b>: The original Lisp paper</p> <p><br/><b>Field: </b>Programming Language Theory</p> <p><b>Author: </b>John McCarthy</p> <p><b>Published: </b>April 1960</p> <p><br/><b>Abstract:</b></p> <p>In this article, we first describe a formalism for defining functions recursively. We believe this formalism has advantages both as a programming language and as a vehicle for developing a theory of computation. Next, we describe <i>S-expressions</i> and <i>S-functions</i>, give some examples, and then describe the universal S-function <i>apply </i>which plays the theoretical role of a universal Turing machine and the practical role of an interpreter. Then we describe the representation of S-expressions in the memory of the IBM 704 by list structures similar to those used by Newell, Shaw and Simon, and the representation of S-functions by program. Then we mention the main features of the LISP programming system for the IBM 704. Next comes another way of describing computations with symbolic expressions, and finally we give a recursive function interpretation of flow charts.</p> <p><br/><b>Presenter Bio:</b></p> <p><b>Mak Kolybabi</b> is the founder of Papers We Love Winnipeg, co-founder of the SkullSpace Winnipeg hackerspace, and co-founder of the BSides Winnipeg conference. In the past few years, Mak has written multi-day workshops that teach threat modeling, cryptography, and secure coding practices to international audiences, and has delivered full-day training on SSL/TLS and Wireshark at SharkFest 2013 at Berkeley. He currently works full-time as a penetration tester while pursuing his M.Sc. in Computer Science. There's always a plush squirrel in his pocket.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1443657600000,"title":"Recursive Functions of Symbolic Expressions and Their Computation by Machine"},"229663801":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/229663801/","description":"<p><b>Title: </b><a href=\"https://securewww.esat.kuleuven.be/cosic/publications/article-2456.pdf\">A Critical Evaluation of Website Fingerprinting Attacks</a></p> <p><br/><b>Author: </b>Juarez et al.</p> <p><br/><b>Published: </b><i>Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security</i>. ACM, 2014<i><br/></i></p> <p><b>Abstract:</b></p> <p>Recent studies on Website Fingerprinting (WF) claim to have found highly effective attacks on Tor. However, these studies make assumptions about user settings, adversary capabilities, and the nature of the Web that do not necessarily hold in practical scenarios. The following study critically evaluates these assumptions by conducting the attack where the assumptions do not hold. We show that certain variables, for example, user’s browsing habits, differences in location and version of Tor Browser Bundle, that are usually omitted from the current WF model have a significant impact on the efficacy of the attack. We also empirically show how prior work succumbs to the base rate fallacy in the open-world scenario. We address this problem by augmenting our classification method with a verification step. We conclude that even though this approach reduces the number of false positives over 63%, it does not completely solve the problem, which remains an open issue for WF attacks.</p> <p><br/><b>Presenter Bio:</b></p> <p><br/>Colin \"Phoul\" Childs is a privacy and anonymity advocate. His interests in privacy, security, and cryptography have led to his work with the <a href=\"https://www.torproject.org/\">Tor Project</a>, co-founding the security conference <a href=\"http://bsideswpg.ca/\">BSides Winnipeg</a> and the non-profit security, privacy, and freedom of speech advocacy group <a href=\"https://coldhak.ca/\">Coldhak</a>. He can be found tweeting about security, privacy, and politics under the handle <a href=\"https://twitter.com/Phoul\">@Phoul</a>.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1461196800000,"title":"A Critical Evaluation of Website Fingerprinting Attacks"},"234643056":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/234643056/","description":"<p><b>Title: </b><a href=\"https://public.econ.duke.edu/~erw/197/forget-cea%20%282%29.pdf\">The Town With No Poverty</a></p> <p><b>Author: </b>Evelyn L. Forget</p> <p><b>Abstract:</b></p> <p>MINCOME, a Canadian Guaranteed Annual Income (GAI) field experiment ran in the province of Manitoba between 1974 and 1979, and ended with no final report and no analysis of data from the saturation site. This essay uses a quasi-experimental design and routinely collected health administration data to revisit outcomes for the saturation site. We found a significant reduction in hospitalization, especially for admissions relate d to mental health and to accidents and injuries, relative to the matched comparison group. Physician contacts for mental health diagnoses fell relative to the comparison group. A greater proportion of high school students continued on to grade 12. We found no increase in fertility, no increase in family dissolution rates and no improvement in birth outcomes. Our results document the value of health administration data for historical analysis, and demonstrate that a relatively modest GAI can improve population health suggesting the possibility of health system savings.</p> <p><b>Presenter Bio:</b></p> <p><a href=\"http://benbergman.ca/\">Ben Bergman</a> is a University of Manitoba Computer Engineering graduate, a software developer at Tenable Network Security, and an electronics hobbyist (creator of the world's smallest Nintendo controller).</p> <p>Note that this meetup occurs as part of <a href=\"http://hax.vmsrv.skullspace.ca/\">SkullSpace's Hax weekend</a>.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1476489600000,"title":"The Town With No Poverty"},"228524077":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/228524077/","description":"<p><b>Title: </b><a href=\"http://www.cs.duke.edu/courses/cps296.4/spring04/papers/Adleman94.pdf\">Molecular Computation of Solutions to Combinatorial Problems</a></p> <p><b>Author: </b>Leonard M. Adleman</p> <p><br/><b>Published: </b><i>Science</i>, New Series, Volume 226, Issue 5187 (Nov. 11, 1994),[masked]</p> <p><b>Abstract:</b></p> <p>The tools of molecular biology were used to solve an instance of the directed Hamiltonian path problem. A small graph was encoded in molecules of DNA, and the \"operations\" of the computation were performed with standard protocols and enzymes. This experiment demonstrates the feasibility of carrying out computations at the molecular level.</p> <p><br/><b>Presenter Bio:</b></p> <p><a href=\"https://twitter.com/Andy_CDandy\">Andrew Sinclair</a> enjoys many aspects of Computer Science including algorithms, languages, and programming challenges. He prefers to use a good ol' text editor and regular expressions when they will suffice to solve a problem. While away from the computer, he is often found tabletop gaming and going to user groups.<br/>Andrew is passionate about gratuitous use of hotkeys and macros.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1458777600000,"title":"Molecular Computation of Solutions to Combinatorial Problems"},"234922870":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/234922870/","description":"<p><b>Title: </b><a href=\"https://bitcoin.org/en/bitcoin-paper\">Bitcoin: A Peer-to-Peer Electronic Cash System</a><a href=\"https://public.econ.duke.edu/~erw/197/forget-cea%20%282%29.pdf\"><br/></a></p> <p><b>Author: </b><a href=\"https://en.wikipedia.org/wiki/Satoshi_Nakamoto\">Satoshi Nakamoto</a></p> <p><b>Abstract:</b></p> <p>A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution. Digital signatures provide part of the solution, but the main benefits are lost if a trusted third party is still required to prevent double-spending. We propose a solution to the double-spending problem using a peer-to-peer network. The network timestamps transactions by hashing them into an ongoing chain of hash-based proof-of-work, forming a record that cannot be changed without redoing the proof-of-work. The longest chain not only serves as proof of the sequence of events witnessed, but proof that it came from the largest pool of CPU power. As long as a majority of CPU power is controlled by nodes that are not cooperating to attack the network, they'll generate the longest chain and outpace attackers. The network itself requires minimal structure. Messages are broadcast on a best effort basis, and nodes can leave and rejoin the network at will, accepting the longest proof-of-work chain as proof of what happened while they were gone</p> <p><br/><b>Presenter Bio:</b></p> <p><a href=\"https://twitter.com/xorrbit\">Andrew Orr</a> is a University of Manitoba Computer Science graduate working in vulnerability research. His interest in Bitcoin and cryptocurrency in general persists to this day despite selling most of his original Bitcoin at $30/BTC (currently $800/BTC), \"investing\" in an scrypt ASIC mining platform that never shipped, and doubling his electricity bill one summer from mining Dogecoin. There's never a plush squirrel in his pocket.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-21600000,"time":1479862800000,"title":"Bitcoin: A Peer-to-Peer Electronic Cash System"},"228523758":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/228523758/","description":"<p><b>Title: </b><a href=\"https://www.cs.cmu.edu/~./seunghak/petuum_kdd15.pdf\">Petuum: A New Platform for Distributed Machine Learning on Big Data</a></p> <p><b>Author: </b>Xing et al.</p> <p><b>Published: </b><i>Big Data, IEEE Transactions on</i> 1.2 (2015): 49-67.</p> <p><b>Abstract:</b></p> <p>How can one build a distributed framework that allows efficient deployment of a wide spectrum of modern advanced machine learning (ML) programs for industrial-scale problems using Big Models (100s of billions of parameters) on Big Data (terabytes or petabytes)? Contemporary parallelization strategies employ fine-grained operations and scheduling beyond the classic bulk-synchronous processing paradigm popularized by MapReduce, or even specialized operators relying on graphical representations of ML programs. The variety of approaches tends to pull systems and algorithms design in different directions, and it remains difficult to find a universal platform applicable to a wide range of different ML programs at scale. We propose a general-purpose framework that systematically addresses data- and model-parallel challenges in large-scale ML.</p> <p><b>Presenter Bio:</b></p> <p><a href=\"https://twitter.com/canada6279040\">Shibashis Bal</a> completed his B.Sc. (Mathematics) at the University of Manitoba. He has obtained the MCSE, CNE, CISSP, and CISA designations. After using his skills in some far corners of the world, he currently owns and operates <a href=\"http://canadainc.yolasite.com/news.php\">[masked] Canada Inc.</a>, an information security, audit and analysis company.  When not engaged directly in IT security audit, he is applying statistical techniques to health, fitness and financial analysis.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-21600000,"time":1455323400000,"title":"Petuum: A New Platform for Distributed Machine Learning on Big Data"},"226080050":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/226080050/","description":"<p><b>Title: </b>Do Artifacts Have Politics?</p> <p><b>Summary:</b> Yes.¹</p> <p><br/><b>Author: </b> Langdon Winner</p> <p><b>Published: </b>Winter 1980</p> <p><br/><b>Abstract:</b></p> <p>In controversies about technology and society, there is no idea more provocative than the notion that technical things have political qualities. At issue is the claim that the machines, structures, and systems of modern material culture can be accurately judged not only for their contributions of efficiency and productivity, not merely for their positive and negative environmental side effects, but also for the ways in which they can embody specific forms of power and authority. Since ideas of this kind have a persistent and troubling presence in discussions about the meaning of technology, they deserve explicit attention.</p> <p><b>Presenter Bio:</b></p> <p>Brittany Postnikoff is an undergraduate computer science student focusing on Human-Robot Interaction and security at the University of Manitoba. Her previous diplomas, Business Administration and Business Information Technology, are from Red River College, where she studied a blend of management practices and Web/application development techniques. Her security knowledge is rooted in SkullSpace (Winnipeg’s Hackerspace), yearly pilgrimages to DEF CON and other hacker conferences, and three years of industry experience.</p> <p>¹ For specific values of Yes.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-21600000,"time":1448499600000,"title":"Do Artifacts Have Politics?"},"237145737":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/237145737/","description":"<p><b>We're going to keep having events, but we're moving away from Meetup.com. </b>We will be deleting our account this week. To keep informed of future events, please choose one (or more) of the following methods:</p> <p>• Join #pwlwpg on the global<a href=\"http://papersweloveslack.herokuapp.com/\"> Papers We Love Slack</a> team</p> <p>• Import our <a href=\"https://calendar.google.com/calendar/ical/pwlwpg.ca_mb5hhj0ftpolf06ovfgqbd4ld4%40group.calendar.google.com/public/basic.ics\">Google Calendar</a></p> <p>• Follow us on <a href=\"https://www.facebook.com/Papers-We-Love-Winnipeg-247795452317589\">Facebook</a></p> <p>• Follow us on <a href=\"https://twitter.com/pwlwpg\">Twitter</a></p> <p>• Follow us via <a href=\"http://pwlwpg.ca/feed.xml\">RSS</a></p> <p>If you have any questions, or need assistance with subscribing to any of these methods, please contact us at<a href=\"mailto:[masked]\"> [masked]</a>.</p> <p><br/>Our <a href=\"https://www.facebook.com/events/1361677543906173/\"> next meeting</a> takes place on Wednesday, January 25th, 2017 from 7:00pm - 8:00pm at the St. Boniface Library (131 Provencher Blvd). The paper, entitled \"CSP Is Dead, Long Live CSP! On the Insecurity of Whitelists and the Future of Content Security Policy,\" describes how a team at Google performed a large scale analysis of real-world deployments of the Content Security Policy and found that roughly 95% of all distinct policies could be bypassed. This paper discusses how they did it, and how to improve the situation.</p> <p>Our presenter, Russell Schreyer, is an IT Security enthusiast and professional. Russ has achieved a Network Security Diploma, Information Assurance &amp; Security Certificate, Management Certificate, and a Diploma in Business Administration. He has worked for such companies as Octopi Managed Services Inc., Above Security (Seccuris), and recently Tangent Animation (from Frantic Films). Russ has been privileged with having done and assisted in many interesting projects such as setting up cell phone detection units, geo-IP filters, CryptoWall recovery, and client assessments. He enjoys being current on IT trends; being a member of SkullSpace (IT community) and DC204 (InfoSec community).</p> <p>If you plan on coming, please<a href=\"https://www.eventbrite.ca/e/csp-is-dead-long-live-csp-tickets-31092304921\"> RSVP via EventBrite</a>.</p> ","photos":[],"venue":{"lat":49.8917121887207,"address1":"131 Provencher Boulevard","address2":null,"name":"St. Boniface Library","postalCode":"","lon":-97.12467193603516,"country":"ca","city":"Winnipeg"},"utcOffset":-21600000,"time":1485392400000,"title":"Our Last Event via Meetup and a New Location"},"229663695":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/229663695/","description":"<p><b>Title: </b><a href=\"https://www.cs.virginia.edu/~robins/Turing_Paper_1936.pdf\">On Computable Numbers, with an application to the Entscheidungsproblem</a></p> <p><b>Author: </b>Alan M. Turing</p> <p><br/><b>Published: </b><i>Journal of Math</i>, Volume 58,[masked] (1936)<i><br/></i></p> <p><b>Abstract:</b></p> <p>The \"computable\" numbers may be described briefly as the real numbers whose<br/>expressions as a decimal are calculable by finite means. Although the subject of this paper is ostensibly the computable numbers, it is almost equally easy to define and investigate computable functions of an integral variable or a real or computable variable, computable predicates, and so forth. This will include a development of the theory of functions of a real variable expressed in terms of computable numbers. <i>According to my definition, a number is computable if its decimal can be written down by a machine.</i></p> <p><br/><b>Presenter Bio:</b></p> <p><b><a href=\"https://twitter.com/stungeye\">Kyle Geske</a></b> is a computer engineer, web coder, and artist. He is a co-founder of <a href=\"http://opendemocracymanitoba.ca/\">Open Democracy Manitoba</a>, their current chair, and their lead programmer. Separately, as a programming instructor at <a href=\"http://rrc.ca\">Red River College</a>, Kyle challenges and inspires the next generation of Manitoban web and app innovators.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1464220800000,"title":"On Computable Numbers"},"227942585":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/227942585/","description":"<p><b>Title: </b>Communication in the Presence of Noise</p> <p><b>Author: </b>CLAUDE E. SHANNON</p> <p><b>Published: </b>1948</p> <p><br/><b>Abstract:</b></p> <p>A method is developed for representing any communication system geometrically. Messages and the corresponding signals are points in two “function spaces,” and the modulation process is a mapping of one space into the other. Using this representation, a number of results in communication theory are deduced concerning expansion and compression of bandwidth and the threshold effect. Formulas are found for the maximum rate of transmission of binary digits over a system when the signal is perturbed by various types of noise. Some of the properties of “ideal” systems which transmit at this maximum rate are discussed. The equivalent number of binary digits per second for certain information sources is calculated.</p> <p><br/><b>Presenter Bio:</b></p> <p>Jay Smith is an Information Security Consultant with Online Business Systems’ Security Consulting Practice. Jay is a co-founder of the Winnipeg chapter of the Security BSides conference a and is a Director of the SkullSpace, Winnipeg's hackerspace. He is very active in the application security space in Winnipeg and recently delivered the keynote at the 2015 Prairie Developer’s Conference entitled “These Walls Can Talk” which discussed the security aspects of the Internet of Things.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-21600000,"time":1453338000000,"title":"Communication in the Presence of Noise"},"225858519":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/225858519/","description":"<p><b>Title: </b>Secrecy, Authentication, and Public Key Systems</p> <p><b>Summary</b>: Merkle's PhD Thesis</p> <p><br/><b>Field: </b>Cryptography</p> <p><b>Author: </b>Ralph Charles Merkle</p> <p><b>Published: </b>June 1979</p> <p><br/><b>Abstract:</b></p> <p>This thesis describes Ralph Merkle's work between 1974 and 1979 on a variety of cryptography-related topics. The presentation will include a subset of the thesis's findings, due to the thesis's large size and the presentation's limited time. This thesis introduce Merkle's Puzzles, a public-key cryptosystem allowing two users to establish an encrypted channel without any secrets shared beforehand. It also covers the trapdoor knapsack and signature schemes.</p> <p><br/><b>Presenter Bio:</b></p> <p>Alex Weber is a Director Emeritus of SkullSpace, Director of BSides Winnipeg, and co-host of Papers We Love Winnipeg. His day job at Tenable Network Security involves working on the Nessus vulnerability scanner. Alex has a hobbyist interest in cryptography, compilers, and application security.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1444867200000,"title":"Secrecy, Authentication, and Public Key Systems"},"221603856":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/221603856/","description":"<p><b>[Rescheduled]</b></p> <p><br/>This meetup has been rescheduled from April 23 to April 30 due to an urgent matter that came up with the speaker.</p> <p><br/><b>Abstract</b>:<br/>An object recognition system has been developed that uses a new class of local image features. The features are invariant to image scaling, translation, and rotation, and partially invariant to illumination changes and affine or 3D projection. These features share similar properties with neurons in inferior temporal cortex that are used for object recognition in primate vision. Features are efficiently detected through a staged filtering approach that identifies stable points in scale space. Image keys are created that allow for local geometric deformations by representing blurred image gradients in multiple orientation planes and at multiple scales. The keys are used as input to a nearest-neighbour indexing method that identifies candidate object matches. Final verification of each match is achieved by finding a low-residual least-squares solution for the unknown model parameters. Experimental results show that robust object recognition can be achieved in cluttered partially-occluded images with a computation time of under 2 seconds.</p> <p><b>Presenter Bio</b>:<br/>Stephen Kiazyk completed his bachelor's in Computer Science at the University of Manitoba, followed by a master's degree at the University of Waterloo with a specialization in Computational Geometry. He has since left behind his life as a globetrotting academic to return to Winnipeg, where he writes visual effects and simulation software for the film industry. When he's not at the computer, he spends his free time practicing Yoga and collecting old video games.</p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1430438400000,"title":"[RESCHEDULED] Object Recognition from Local  Scale-Invariant Features"},"220117454":{"url":"https://www.meetup.com/Papers-We-Love-Winnipeg/events/220117454/","description":"<p><a href=\"http://djrea.ca/\">Daniel J. Rea</a> will be presenting his <a href=\"http://djrea.ca/#PaintBoard\">Master's thesis</a>, which he successfully defended in January 2015.</p> <p>\n\n<img src=\"http://photos1.meetupstatic.com/photos/event/8/e/8/4/600_433776484.jpeg\" /></p> <p>\n\n\n\n\n\n\n\n\n\n<i>The creation of interactive worlds, such as those in video games, often include a set of computer controlled characters that must intelligently act and react in response to dynamic input from the user. These interactive behaviours usually require authors to programmatically define each behaviour, reaction, and interaction the character should take in response to user input across a range of scenarios, a process that can take significant time. While this method can successfully create robust characters, the large development overhead is not conducive to the exploration, prototyping, and testing of new character ideas.</i></p> <p><i>We designed and developed PaintBoard, a system that enables users to rapidly prototype interactive character movement by digitally painting a storyboard. PaintBoard promotes prototyping by facilitating quick, visual authoring, and by enabling immediate testing by allowing the user to interact in real-time with a behaviour generated from a painted storyboard. To generate the interactive behaviour, we developed a novel algorithm that analyzes a painted storyboard and uses machine-learning to generalize the painted examples to new situations. Our algorithm uses this generalized behaviour to control the computer character during real-time interaction with the user character.</i></p> <p><i>To help ground our design decisions in how real designers approach the problem of creating interactive behaviours, we conducted two preliminary exploratory studies with industry professionals and programmers. We further conducted a proof-of-concept workshop with our prototype to investigate how real developers may use PaintBoard; this illustrated the initial success of our painting-storyboards authoring metaphor. Finally, we performed an initial evaluation of the behaviour generation algorithm which informed us of directions for future work to improve PaintBoard’s performance.</i></p> <p><i>Contributions of this work include the design and evaluation of both a new interaction metaphor— digitally painting storyboards for interactive behaviour authoring—and a novel behaviour generation algorithm (for generating real-time interactive behaviours from storyboards). Our results demonstrate that the PaintBoard approach can be useful to developers as an exploratory prototyping tool due to its fast and understandable painting metaphor, and that PaintBoard itself can quickly (in real-time) generate an interactive behaviour.</i></p> <p>\n\n\n\n\n\nDoors will open by 6:30pm, and the venue will be open until 8:30pm. The presentation will occur between 7pm and 8pm.<i><br/></i></p> ","photos":[],"venue":{"lat":49.89603042602539,"address1":"374 Donald Street","address2":"2nd Floor","name":"SkullSpace","postalCode":"R3B 2J2","lon":-97.1444320678711,"country":"ca","city":"Winnipeg"},"utcOffset":-18000000,"time":1427414400000,"title":"PaintBoard: Prototyping Interactive Character Behaviours by Painting Storyboards"}}